[{"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "A perfect alternative of Kempty Falls", "review": "I recently visited Bhatta falls with my family and trust me, It was an amazing experience. I found it much better than the famous Kempty Falls. Bhatta falls is situated on the Dehradun-Mussorie road. You need to travel off road on a steep narrow lane down the hill. There is a parking available. There are few shops available which are serving maggie, coldrink etc along with lockers facility and a changing rooms.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r585703004-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Massorie trip", "review": "Mussoorie is at an average altitude of 1,880 metres (6,170 ft). To the northeast are the Himalayan snow ranges, and to the south, the Doon Valley and Shiwalik ranges. The second highest point is the original Lal Tibba in Landour, with a height of over 2,275 metres (7,464 ft). Mussoorie is popularly known as The Queen of the Hills.[ Best place i love it", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r588912477-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "In a very sorry state", "review": "Thr is a lot of construction going around and the falls hasn't been maintained at all. Utter waste of time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r592031937-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Authorities developing the Site for full-fledged sightseeing", "review": "Less popular than Kempty Falls in Mussoorie, this site is under development and the authorities are creating a big sightseeing platform where tourists can enjoy the waterfall in all its grandeur. We visited it on our last day of sightseeing and quite early in the morning after breakfast. The site is not very open or organized for tourist inflow. One has to walk half a kilometer to reach the Fall from the Parking space. Nevertheless, the rich flow of water and greenery all around pretty much refreshes your mood at the start of the day. Tourists and Locals were seen taking bath in a narrow space where the waterfall was in its full flow.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r594873497-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 2.0, "title": "Could have been better", "review": "The falls have lost its natural vibe. The place is terribly crowded and hence is littered around. The maintenance could have been better.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r595143104-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Ideal picnic spot", "review": "Bhatta Falls, is about six kilometres on the Dehradun - Mussoorie road. It is a beautiful waterfall. This is an ideal picnic spot for some fun time with family and friends.  Unlike Kempty falls, Bhatta falls are not very crowded so you can enjoy the scenery and get yourself drenched in its natural beauty. The site is not very organized for tourists. One has to walk half a kilometre to reach the point from the Parking space, but it is worth the trouble.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r613751352-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "A lovely view", "review": "This waterfall is a famous tourist spot for people travelling to Mussoorie . Due to excessive rainfall in the recent months, even the lack people love to watch as the quantum of water is much more than normal ... Governor Amoak Rattan Kohli", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r628702213-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "During Diwali week no water in falls", "review": "There was hardly any water in the falls and it looked pale in front company garden water fall. So, avoid going here. you can see the when you drive from dehradun to mussorie", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r633574597-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "too low from ground level. stay away", "review": "though we went towards Bhatta fall, this is quite lower side from the ground level and driver has to be skilled. dont go unnecessarily when you can visit kempty fall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r639552969-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "Poor maintenance ", "review": "Bhatta falls is located in between Dehradun to Mussoorie. It is 8 km from mussorie towards dehradun.  The fall is 1.5 to 2 km down the main road.  The driver needs good driving skills to drive through the steep and broken road. The place is not maintained at all.  There are only 2-3 shops before the fall. The stairs, bridge to the fall are in bad shape too. The water was sufficient however it is found clean at only one place... Rest all is dirty (plastic bottles etc). After climbing 150 stairs you will find a adventure base camp,  the view from top was also not very beautiful. The way and the place is not tourist friendly as there are no signboards. No proper shop close to the fall,  no changing room or locker facility.  The place could have been heaven if maintained.  The best point is a place where table chair are placed in between the fall,  so you can sit with your feet dipped in water", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r660958133-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Bhatta Falls-A Hidden Gem", "review": "Bhatta Falls is a waterfall which is still unknown to most of the people who visit Mussoorie. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r498432867-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "One time", "review": "This place is good for one time visit as this place is on the way to Mussoorie from Dehradun so u can visit and enjoy the place. Quiet and peaceful as not many come here", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r512577697-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Love the beauty", "review": "Very good, natural look, clean and more water than Kempty fall, very calm place, not commercialized. Must go, enjoy and spend 1-2 hours there, you can enjoy tea/maggie while seeing the Bhatta Fall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r514308103-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Nice, non commercialized natural beauty", "review": "The way to the falls was decent. However you need to park your vehicle before the falls. The road ahead is still motor-able to few more metres bu is very narrow and steep. Not recommended considering the distance. The walk is short and nice with some stairs to climb at the end. You could get into water, play around. The water may be extremely cold depending on the season. The place is quiet and you wont see people flooding it like Kempty Falls. The water is clean and the flow is good (again depends on the season you visit). I am sure the flow would be best during the ice melting seasons. There are 2 maggi points that serves OK maggi and omelette.  Be cautious to ask for very less sugar in tea over there as you might get sugar syrup instead of tea :P. Overall a place worth visiting. Could be a substitute of Kempty falls if you want to avoid mad rush during long weekends or tourist seaons.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r558610699-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Must visit", "review": "A very beautiful place. But the amount of garbage thrown and around the falls is appalling.  Plastic bottles, slippers, bags and even Styrofoam boxes are in the water and these get collected near rocks which gives a sad look to the this beautiful place. The restaurants which have started appearing is also throwing traah right into the water and mountain area. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r569354434-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Nice Sacred, Clean and Evolving Fall", "review": "Great Picnic and day activity spot", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r573235458-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Secluded Waterfall - But NOT For Long", "review": "Our visit to Bhatta Falls (on way to Mussoorie) wasn't planned, but we were glad that we decided to visit it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r577584541-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "bhatta fall is just behind the Mussoorie lake", "review": "bhatta fall is least popular as compared to kempty fall in Mussoorie. You can visit here by staying at youth hoste ( 500 rs per room ). the room is clean and cheap. the staff members are good and kind . i have book this hostel at flakytravel.com", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r578969298-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Amazing falls with Super clean water", "review": "We are so glad that we visited this place and were able to forget the horrible Kempty falls. THis falls is no Dehradun - Mussoorie route. You have to take 10 mins off roading from main road and very steep roads. You get parking near falls and then you need to walk for 2-3 mins. Now that falls is not very crowded so don't get scared. There are some shops near falls offering clothes and changing rooms and regular snacks along with Maggi. There are multiple levels to the falls, and you need to climb stairs for each level. You must go till the top level as that is the best place to take bath. The water is very clean, we can even drink it. Its much better than Kempty falls. You can enjoy some good time with Family here. At one of the level, they have arranged tables in the water area, where you can sit and enjoy some snacks. There is a small zip line also which you can enjoy at 250. This was our best time we spent in this falls in Mussoorie. My suggestion, don't waste you time and money in Kempty falls, rather visit this falls. I can guaranty you that you will not regret it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r583779404-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "Wastage of time", "review": "I was there on 3rd June 2018, I was having bad experience here. I also visited by seeing review, but nothing is there. Accordingly to me all the reviews are posted by the management of this place, to attract people. only one falls is there, construction is going on. In future it may good place, but currently it is totally wastage of time, more over the way to reach Bhatta fall is too narrow, not safe to drive by self, even I went with driver, he was also scare by driving at this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r585262221-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Unexplored destination", "review": "This place is little unexplored compared to Kempty falls in mussorie. However it is really worth visiting and very beautifull. The kind of noise made by the fast falling water is really heartthrobing. You hardly find any tourist over here and neither those shops and sales people, hence you can enjoy the nature in its true sense. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r436988536-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Bhatta falls is a punishment for your car", "review": "The road to Bhatta falls and back is really steep and needs an expert driving hand. The falls are not too grand, but small stream falling from about 25 feet. The barrage on the way is all dried up and dirty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r449885693-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "summer location", "review": "On the mussorie road, there lies a undiscovered location of Bhatta Falls. It is very quiet, you can enjoy nice sun and the refreshing water is all what this place offers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r464066614-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "One of the best attraction of mussoorie . ", "review": "Located on the way between Dehradun and Mussoorie. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r479658848-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Small and Sweet Waterfall", "review": "Its a little remote but good water fall. As the bathing is not allowed it is clean. However, you may find it not very attractive by looking at its surroundings.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r482819435-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "bhatta falls is best place of picnic and waterfall in mussoorie", "review": "it is located in between the dehradun and mussoorie, just 1.5 km away from mussoorie lake. rush of people is very less as compared to kempty fall and water is clean. you can enjoy bathing under the fall", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r484866950-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Lovely untouched waterfalls", "review": "Bhatta falls near the Mussoorie lake makes for a nice trek for visitors and locals alike,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r485831882-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Relatively unspoilt place", "review": "Bhatta falls is a rather inaccessible and hence unspoilt waterbody near Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r490088242-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Beautiful", "review": "Lovely,beautiful,unspoilt,untouched,neat and clean place.visitors are less but place is beautiful and u can also njoy zip linning here ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r491064856-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "clean, less crowded, away from main city", "review": "visited mussorie in June, peak season. way from our hotel jaypee manor to city, mall road and kempty falls was loaded with traffic going at snail's pace. so we decided to avoid Kempty falls and go for Bhatta falls. last 1 km of road leading to it has steep curves, need a skilled driver by car . falls are a picturesque sight, but nothing extraordinary. falls can be seen coming from a height . can play inside the flowing water, not under the fall.  maggi available to eat at the location. locals had arranged some sort of flying fox on a small scale for fun @ Rs 150. can spend 60 mins of leisure over here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r386889641-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Nyc Time", "review": "Bhatta falls is around 10 km from mall road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r493699878-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Amazing Waterfall..", "review": "Its an amazing waterfall i have seen. Such a beautiful and greenery place i have seen. Its a very romantic place to hang out.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r398084326-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Beautiful fall n chilled water", "review": "It is a great place to visit..  The way down to Bhatta fall is very dangerous yet thrilling..  I would recommend only good drivers to drive through this way.. Bhatta fall is a naturally beautiful waterfall.. Have forests all around and with least artificial things in it..  Come and get lost in the beauty of nature...  Be a little careful while you wadethrough into the flowing water. ..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r398276458-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "WORTH VIEWING FROM DISTANCE", "review": "One can see and enjoy its beauty on way up or driving on this road.Not many people walk upto fall to have bath in that water.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r415769854-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Better than Kempty falls", "review": "Went with wife , 2 kids aged 3 and 8 and brother-in-law. Had planned for Kempty falls but the road to mussourie was totally jammed so decided to go to bhatta falls instead. Probably the best decision I made because the falls ,although smaller and single , were the best experience on my dehradun trip. Much lesser crowd , the rushing falls and walk to the falls was amazing and then the rushing falls on your body felt like bullets. It was truly much better than Kempty falls ever can. Would recommend everyone planning to visit Kempty falls to first give a try to bhatta falls. They will definitely love it more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r422042711-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Just Beautifulllll", "review": "Pure nature. Very beautiful with great views. Still very natural.  Not at all commercialised. Dont forget to carry extra clothes as very difficult to resist bath in the shower.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r424269212-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "One of the must visit falls in Mussorie", "review": "The road leading to this falls is down and full of curves. Visiting the falls is worth the drive. No shops available there. Visited in Oct 2016 and no crowd in Mussorie and near the falls. Can enjoy the falls and get completely drenched.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r427207850-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "One of the best falls of North India", "review": "Bhatta Falls is certainly the One of the best falls of North India, I had visited their with my family and cousins and enjoyed there for around 3-4 hours. Place is natural beauty with good for photography as well. Recommended place for Travellers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r428359210-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Bhatta Falls", "review": "Not too clean area and a small water-fall that would be an average visit, but not a visit to relish.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r432564480-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Away from the crowd", "review": "Bhatta falls are located on the Mussoorie Dehradun road. Car goes down to the fall. On the day we went there was no one around. The water was clear and cool. The area  was clean since there  are no food stalls around. However there was one restaurant on the main road. The road to the falls is in a bad shape and pretty steep. We saw unusual birds and butterflies there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r432707025-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Unexploited nature - must visit", "review": "Really nice experience. This is the only place which is not commercialized yet and provide a nice nature view. The fall is also very good. The only issue is with the road and it is not for the novice as the road is very steep.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r346586890-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Awesome place", "review": "Great place to visit with your family. The place is in between dehradun and mussoorie. Near mussoorie lake.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r365071932-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 2.0, "title": "Average falls, not well maintained", "review": "About 7-8 kms from Mussoorie. Not well maintained at all. Plenty of garbage all around. Can be easily skipped. Much better things to do around Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r371333976-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Summer", "review": "Its amazing place u can visit with your friends family and with your gf also. You will definatly enjoy this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r377451678-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Away from crowd of Kempty falls", "review": "This falls is slightly away and lesser known compare to Kempty falls. That's why it was quiet and less crowded. It is clean and good place to visit. You need to walk little bit from main parking lot but worth a trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r376954090-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Good place in need of maintenance", "review": "Nice waterfall though not very big. But people are throwing plastic bottles in it. The authoroties should be strict or the place will soon be filthy again", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r381532350-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Best Falls....Far Better than Kempty", "review": "If you are visiting mussorie and that too in May June, better avoid Kempty falls and go for Bhatta falls. Awesome falls and diffeerent heights . We had a great time. Just be careful of the way. Drive is very risky . Steep curves. Overall we had a wonderful time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r382365723-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Surpassing Kempty !!", "review": "Defintly better than Kempty falls ! It is less crowded therefore cleaner than Kempty falls.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r386813167-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Good option", "review": "Bhatta falls in all terms is better than Kempty on any given day. Don't understand why people go to torturous Kempty when they have a place like Bhatta falls. Though it would also lose its charm the moment tourist mad rush reaches here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r385560784-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Best Bhattas", "review": "The fall is genuine and less crowded. Dresses are available on rent so there is no problem if you get wet. Corns, maggi and local eatables are available here to refresh you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r383586374-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Nothing out of ordinary", "review": "Visited this place as I was in Dehradun for some work. It its okay place nothing gr8 or so. Can give it a try but keep hope not much high", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r294357361-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Must go", "review": "The waterfalls is a beautiful sight. Though I think the authorities can better maintain the place. One can also have a bath in waterfall. However there are changing room problems. If one can deal with it, one must enjoy getting drenched in waterfall. Nice experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r316465983-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "amazing veiw   and realex you body and mind", "review": "I vist this place when I stay for 5 days in Dehradun after that I came to mussoorie  what a beautiful place ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r322819185-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "A Beautiful waterfall at a beautiful location", "review": "It is a beautiful waterfall in the lap of nature. The scenic and untouched beauty all around is the plus point of this waterfall. The road up to waterfall is very steep but it is in good condition and approachable. Due to less gathering and beautiful location it is worth taking to visit this photogenic water fall. No shop available there so be prepare.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r323385334-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Excellent water falls!!", "review": "It's very difficult location to reach as road is very steep one and you need to be expert in driving in very narrow & steep turnings all the way. Its dangerous approach road for driving and hence better to go with local expert drivers who are used to this approach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r326154386-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Beautiful waterfall and amazing view", "review": "It is a beautiful waterfall in the lap of nature. The road up to waterfall is very steep and few people know about the fall. You will find only one shop that can offer you maggie and other food. You can enjoy your good time over here on the way to Mussoorie. Very less people go to this fall so it is an untouched beauty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r331049674-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Better than Kempty falls", "review": "I liked this better than Kempty Falls. This is more peaceful and serene compared to the crowded Kempty Falls.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r335431018-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Nice water Fall", "review": "Nice water fall in mussoorie so many people are visiting in this place good food available in this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r338088882-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Beautiful Place and excellent fall too!", "review": "Its a beautiful fall. To experience more beauty of the fall better to go up on the fall. There are some spots where people can enjoy bath too (for boys only). Prefer to go in big groups, if going with family( Since place is abandoned now and we saw some group of guys drinking there in parking area).", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r338167019-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "veru beautiful", "review": "Bhatta Fall was a very scenic and nice water fall. The only thing is that around 2 kms walk from main road down towards fall, if u dont have vehicle it becomes very difficult going back. must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r276099740-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Much better than Kempty Falls", "review": "Not as crowded as Kempty Falls, Bhatta Falls is on Dehradun Mussoorie Road (around 7-8 Kms before Mussoorie)....There is just one shop with not so good changing room....but you will enjoy if you just want to relax your feet in cold fresh water (away from hotch potch like in Kempty) or have fun with water.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r277881914-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "good fall", "review": "this is a good fall but and a less noisy also as compared to other fall in mussoorie. one can visit this if you are in mussoorie for few hours.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r279765548-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "average water fall, not well maintained", "review": "it is a dirty place to visit with family & kids...you can go for another waterfall in mussoorie...Not recommended to visit with family", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r284978581-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Nice place but not maintained", "review": "It could be a lot better place if the city admin spend 1% of energy and money compared to kempty fall..Though was a nice altenative and there werent too many people in the rush season..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r282527315-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Drive to this location is fun", "review": "Reaching this location itself is fun , on the way to massourie and then those steep curves. Walk a couple of kms and you can get closer to the water.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r286256122-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Good fall", "review": "A small but good fall. I would recommend if you are planning to get wet. Not much crowd so more fun...plan if you have 2 days in Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r286317020-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Nice Place", "review": "The place is good.The place is less visited though not very clean.very easily accessible.The view is superb..and it is safe enough.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r287111322-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Good weekend getaway", "review": "it is nice place if you are looking for  a weekend getaway. You can easily take  acab and reach this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r290273676-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Recommended time to visit monsoons but not on weekends.", "review": "It was beautiful place to visit .Luckily the time i visited was not the season time but the water fall had ample water. The water fall was not crowded and getting to it was difficult. It's about 15 min before you get to Mussorie from Dehradun a sharp and a steep turn on to your left. Only skilled drivers should be on wheels if you are getting there by car or bike. Other then chilling at the water fall there is nothing much to do. Recommended time to visit monsoons but not on weekends.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r290318483-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Over Crowded and not so nice", "review": "If you like crowds, then visit Bhatta Falls. It is over built up and too crowded to be enjoyed any more. The place is littered with garbage and plastic bottles. it could be a nice place if there wasn't so much built up around it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r238195621-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Bhatta Falls- entry gate to mussorie", "review": "Better than the over hyped Kempty falls. Not a big one but yes the 2 km travel to reach the bhatta fall is cool. Avoid in rains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r241501124-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Better alternative to Kempty Falls", "review": "Found it to be much better then the over-hyped and overcrowded Kempty Falls. Good but narrow roads, not over commercialized, nice overall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r265493628-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "awesome fall", "review": "it was good than kempty fall. if you want to visit kempty fall then it would be very crowded. but this bhatta fall is awesome, so natural, actually this is a electricity dam. but now this is only a waterfall. not maintained.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r267401807-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Drive from Delhi to Dehradun is horrible", "review": "I drove to Dehradun from Delhi, the condition of road was bad, except for meerut toll road which is properly maintained. Other wise the busy haridwar route is ill maintained I don't know why. It should be four lane road with smooth drive, hope some one is listening. I suggest you visit Dehradun by train only. The charm of attraction got lost due to bad road experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r268839005-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Fabulous fall...must visit", "review": "A very chilled water fall...the drops of water on your back gives ..oh..ultimate experience near this fall..it is a must visit. .u r gonna luv it..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r271742209-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "A pretty falls with some history", "review": "One can drive all the way down to the river on a newly concreted road. The stream looks clean and people do dip in despite it being quite cold. At the top of the falls is the remainder on the old canal off take for the hydro station down stream. The short walk from the carpark up to the falls takes you past the large sedimentary / storage for the hydro scheme - now disused. I'm told there are plans to put in a ropeway from Bhatta village. I hope it doesn't go ahead as there is enough rubbish on the ground already. Kempty Falls has been spoiled in the name of making money off tourists!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r271631363-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "The famous among friends", "review": "the fall of water and group of friends may go and enjoy, but if you are heading to mussourie, better not to waste your time here. but if you want to spend some good time without been to mussourie and stay near to dehradun then it is a half way fun.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r273231724-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "neglected site", "review": "we came to know the bhatta falls by chance when we reached there place was awesome but due to non upkeepment  it was looked like secluded place where tourist doesn't come so often  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r273243255-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "more secluded than Kempty..worth a visit !", "review": "Bhatta Falls is en route Mussoorie..you can see a huge sign indicating the turn..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r274116902-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 1.0, "title": "Worst we have seen till date", "review": "It's sheer waste of time, energy & literally a enthu killer place.  Absolutely nothing except a waterfall.  Not at all maintained.  Horrible place.  Do not even think of it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r202503856-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 3.0, "title": "Do stop by if you have time", "review": "It is located on the main Dehradun – Mussoorie road (a detour of around 2 KM). We went there in June and were happy to find chilled water flowing down the waterfall. We weren’t expecting much people, but were surprised to see a lot of vehicles with Delhi and Haryana registration.  The place has very basic infrastructure and construction was in progress, it has a makeshift changing room, a fully covered rest area, canteen and a parking. Water level is not much so one can easily and safely enjoy over there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r210254199-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Peacefull place and a good experience", "review": "If you have time you should visit this place but your day should not be oriented around Bhatta fall. It is not as organised place as Kempty fall and girls may face issue in taking a bath here. No changing rooms and not maintained properly. You may find scenic points here. Water was chilled even in June.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r211446011-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Unexplored falls of Mussoorie", "review": "Compared to Kempty falls, Bhatta falls offers a clean unexplored tourist spot where your family will enjoy. It was much cleaner and had very few people there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r214502653-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Nice place", "review": "Good place nice chilled water and good place to freak around. only dicsonnect is that the govt has not managed to maintain the same properly. only one shop which sells eggs, softdrinks chips. no option available for a full fledged meal. good place to spent time in water", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r232331175-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 5.0, "title": "Excellent, Better than Kempty", "review": "Amazing location and soaring sound of waterfall will simply amaze you. I visited in Oct14 with family and enjoyed the windy water romancing my face. A picturesque natural beauty. Must visit for me.  Forget KEMTY Falls Visit Bhatta Falls.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r234057826-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Bhatta Falls", "rating": 4.0, "title": "Excellent but unattended", "review": "These falls on Dehradun Road are located about 10 Kilometers from Mussoorrie. Excellent place, but not maintained properly. It could have been a better attraction comparing to Kempty falls in Mussoorie. No proper place to sit and enjoy except one small shop selling some cold drinks and wafers. See the pictures to appreciate. Approach is steep down the hill but road is wide and  good. Take an expert driver for safe journey.  Do not miss this attraction.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d4435939-r236763577-Bhatta_Falls-Mussoorie_Dehradun_District_Uttarakhand.html"}]