[{"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Private forest, nice half day trip", "review": "It's private forest, initiative by Jain family to preserve local flora and fauna. There is nice walk inside with very knowledgeable staff. They have put camera which captures animals including leopard. We all had fun. Do call in advance and fix up time with virender.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r581709064-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Guided hike in carefully restored ecosystem", "review": "Very informative and pretty hike.  Knowledgeable guide.  Worth supporting the effort to preserve habitat.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r606122427-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Fascinating trek", "review": "A must visit place when in Mussorie, no matter what’s your age they have something for the not so young. Well trained experts to guide you through the pristine forests. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r615086962-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Amazing experience", "review": "We were a group of 7 including 3 kids below 8 years. It was amazing trekking through nature.....this is as close to forest as u can get. Our guide Vipul gave us nice details throughout the trek. Do visit this place if you want to forget yourself with nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r627472905-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Excellent place to go for a short walk - Himalaya Views too", "review": "One of the best places close to Mussoorie to see the Himalayas. Go in the morning as it gets very hazy in the afternoon. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r632514415-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Hike / Trek @ Jabarkhet", "review": "A great few hours of hiking in a beautiful part of India — highly recommended. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r625820060-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Lovely trek up to Flag Hill !!!", "review": "So we took a guided tour up to the Flag Hill. There is an easy path too for senior citizens or people who have altitude issues. But the trek up the Flag hill was worth the view. Its a private reserve owned by a Jain family and they are doing commendable job in preserving the place. Hats off to the effort. The best time to go would be March - April when the flowers are in full bloom.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r635936986-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Nature lovers abode!", "review": "It is a wonderful nature trek in the mountains. The forest is calm, cool and splendid. The trek guide Virendra is a warm and cordial person and has a good knowledge about the wildlife and birds that are found there. The 110-acre reserve forest is a boon for people who want to relax and enjoy nature. The reserve forest is managed and preserved by one Ms. Sejal Vohra and such initiates will go a long way in preserving the ecology in India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r641235979-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Away from the tourist trap", "review": "We had a nice peaceful walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r651419554-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Refreshing jungle trek", "review": "Jabarkhet is a beautiful, lush forest full of indigenous trees like deodar and rhododendron. The guide naturalist Virendra was very knowledgeable and helpful. I really enjoyed the short trek up to the hill top from where you can see the snow covered mountain ranges.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r564202027-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Good offbeat place , very helpful and knowledge caretaker", "review": "We decided to go for a trek at Jabarkhet. It is a privately owned property hence it is clean and well maintained. The cartaker/manager is Mr Virender. He has excellent knowledge of birds, flora and fauna Though in Feb there werent any birds or blooming flowers and it rained about 30 mins into our trek, yet, he was very informative. Shared few photos of wildlife he has seen in the park. Its a good place to go to if you are not the typical shopping/picnic crowd going to Mussoorie. The entry fee is Rs 500 per person.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r652772120-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Nature Trails", "review": "One of the best place for hill waking and wildlife - great initiative for the conservation of nature and wildlife", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r549933403-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Good trek with Veeru, the naturalist!", "review": "I think it is the first private conservatory of India. Good walk along with information on trees, herbs, fauna and indigenous trees. It takes 3 hours roughly and is scenic. If it is a smaller group and also a quiet one, bird watching is possible. The Jain family along with Sejal Wohrah have shown us how any piece of land could be converted from disuse to becoming a conservancy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r568860606-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Nature walk", "review": "We walked down to this place from Landour which passes via Sachin Tendulkar's demolished property and has a small jungle route. Alternately, you can also reach here by car. Once you are there, your guide will brief you on the significance of the reserve and there is an entry fee of Rs. 500 per person. Based on your hiking capacity, he will take you from different routes. On your way, you can see different trees and trails. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r557847876-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Brilliant ", "review": "Not being a nature lover exactly was hesitant about the walk ... but willing to try and learn new skills and hobby I decided to go for the walk. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r576506478-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Escape in Nature", "review": "Always looking for places to escape to in nature, we came across Jabarkhet. A very humble entrance welcomed us to the wildlife reserve. We were met by a pleasant guide who gave us our tickets and a good map/info brochure - a rarity in the area, we found a lack of info and maps at most sites in Mussoorie. There are quite a few routes, all well sign-posted. We opted for the guide to lead the way (INR 500 pp - entrance + guide). We had a good 2-hour walk/hike. The scenery was lovely, so many trees and lots of views of the mountains (unfortunately the large Himalayan range wasn't visible due to the air pollution restricting visibility). Our guide was knowledgeable and carried bird & flora books and binoculars with him. He also showed us the footage on some of the camera traps. Glad we saw the images and didn't encounter some of the animals face to face. The reserve has leopards, black bears, wild boar and numerous other wildlife. Overall a good outing outdoors. Not too streneous. I walked in flipflops although I wouldn't recommend it. Would be nice if they sold some water, softdrinks, sunblock, tissues and snacks at a kiosk at the entrance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r575633850-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "India's first private nature reserve", "review": "If you want to experience a different Musoorie which is away from the crowded picnic spots then JABARKHET is a must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r575116561-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 3.0, "title": "Went for Bird watching ", "review": "It is around 15 minutes drive from main mussoorie and is privately owned. Went with a guide but being October there was nothing much to watch out for. Did see some birds like woodpecker etc. It is a quite and green place but nothing great about place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r571677828-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "The hidden gem in Mussoorie", "review": "Checkout their site .. call up Virendra and fix the date and time and turn up for the walk .. This a private forest and is pristine. It is green and has nice trek routes, but do not go on your own. Take the guided tour and you would love it. Start early in the morning and if you are lucky you would have good sightings of birds and animals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r570036295-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Vision of a family to purchase a forest just to preserve it", "review": "This is a must visit for all those who enjoy the wild. A guided trek lasts 2 hours - through absolute wilderness", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r490239955-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Conservatory - well kept", "review": "My wife and I wanted to do something off the beaten path on our trip to Mussorie.  Jabarkey is a nice pleasant walk in natural surroundings.  Accompanied by a guide, the gentle slopes of the conservatory is a great, quiet place for a trip which provides solitude.  Kids can also learn about nature among the rhododendron trees and the well maintained and well marked trails.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r577323892-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Extremely well preserved", "review": "We did around an one hour walk/trek with teens 16 and 14. Don't think younger kids could have done this though. Unless they have something milder for them as its a very large forest area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r490889416-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 3.0, "title": "Trails for trekking at Mussoorie", "review": "Jajbrkhet Nature Reserve offers different views depending on the season. There are endless trails for trekking. Tough for elderly since the trails are with steep ups and downs. We were there in March which is not a good season since the greenery was just coming up along with flowers. So i could not see any thing i learned from the literature. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r490270617-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Nature.....", "review": "This is a revived natural forrest. You need to go there after advance booking. there is a lot of natural beauty in the forrest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r494195582-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Quaint and Peaceful Reserve", "review": "Jabarkhet is worth a visit for any nature enthusiast hoping to get away from Mussoorie or even Landour. The park charges 300 entry per person (150 extra if you have a guide) and has a variety of well marked trails. I easily spent 4 hours in there just walking around. The scenery is stunning everywhere, but it is nice to walk in the forest. It is a little bit of a walk from Landour, but what else did you come to the hills to do??", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r496040028-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "nice place to be", "review": "amazing trek dont forget to wear ur treking shoes or ahoes with grip. the guide virendra is a nice person and he will answer all ur question and a passionate nature lover. if u r in mussorie u can spend 2 hrs of time for this trek .. rather than wasting time at market.. amazing view,plant birds... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r498550334-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "A wonderful Success Story", "review": "The Jabarkhet Wildlife Reserve is indeed one of those wonderful success stories wherein a group of people (Villagers and Environmentalists)set out to recover, to protect a small piece of the forested land in this area.  In so doing it was hoped the vegetation that the birds and animals depended on would recover and hopefully the animals, large and small would return.  That is what has happened.  We were fortunate to view some of the love camera clips taken at night showing the Leopards, for example moving into,and about the area.  The local villagers have actively participated, e.g. bringing waters for miles up and down the mountain paths to the various water holes that were set up.  Today you can catch a guide and walk along the trails (there are a number — short and long), be in this wonderful space and see Mother Nature returning in all Her Glory.  A very Definite Recommended space.  See their web site (use Dr. Google ) for location et cetera.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r531545903-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Lovely, quiet, serene walks", "review": "This is a great place to come to get away from the bustling Mall Rd or honking horns of the Landour and Mussoorie roads. It isn’t a big nature reserve but the trails are well designed and offer a lot of different sorts of treks - from pretty steep stretches to valley walks. There is a hut where you can buy your tickets (Rs 300/person) and get walking trail maps and flower guides. You can also get a guide to take you on the walks - we didn’t but I think that would add a lot about the flora and fauna. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r529534327-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "great fun", "review": "Visiting this place was a great fun.  we went with family and we all loved it.  it is worth going there and enjoying.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r497051432-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Nice place for wild life lovers", "review": "its a mice place in mussoorie specially for those who loves wildlife its really a good treck place was awesome ..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r546137071-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Its a treasure trove of trees carefully nurtured by a nature conservator..", "review": "Our guide was the best part of this visit. He took us through some interesting trails, explained different types of trees, blossoms of Rhododendron, Fern, Acorns to collect..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r439229294-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "An excellent, comfortable walk in the mountains", "review": "This is a new venture, started about a year ago on the mountains outside of Landour. On the road from Landour to Dhanoulti, look out for a small hut on the left of the road about 250 meters beyond Jabarkhet village. They offer guided tours twice a day and the tours should be booked in advance. The trips last from 1.5 to 3 hours, depending on your stamina and the guide will walk with you on trails of varying difficulty. Most of them are easy even for small children. The guide will point out the local flora and the rare fauna and generally make it interesting. It's more a walk than a trek but on the mountain-side covered completely with trees which makes it interesting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r428305540-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Good jungle walk", "review": "Good jungle walk. It has motion capture  cameras that capture animal movements. Its interesting to look at pictures from these cameras. Just confirm the price and tour path beforehand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r420019185-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "A return visit to a 'Returning To Nature' area of land", "review": "I first visited Jabarkhet with a larger group and our teachers.  It was wonderful to return and recall the detailed information we had previously been given on our earlier visit.  This entire Reserve is the product of some wonderful folks who believed in setting aside an area of land and allow Mother Nature to restore it to its former natural state, included therein return of the wildlife and birds.  The establishment of waterholes has helped. That the 4 legged have returned is visible on the night cameras.  Allow yourself several hours to walk about the trails and although marked you would find it useful to have a guide who can give you insight on the specifics of this wonderful natural undertaking. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r430894631-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Good", "review": "JNR offers something to the visitor at all times of the year. Each month brings with it new discoveries and vistas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r447382988-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Nature Lovers Paradise", "review": "Jabarkhet Wildlife Reserve is a great initiative that will help conserve the habitat and make us realise the importance of forests and wildlife. There are many trails here that overlap each other. Our guide, Virender was sharp with knowledge about almost everything wildlife. He kept us engaged and also threw in a few trivia about the reserve. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r470216035-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Worth the price", "review": "It is a privately owned and run pristine nature reserve with well guided and diverse trails. It has a 300 Rs per adult entry fee but in my opinion well worth the price. It gives a 2-3 hr or longer if so interested treks across the hills, heavily forested paths and wild flower swathes. this place is a few miles outside Landour and on the way to Dhanaulti", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r488593604-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Must visit!!!", "review": "Spare some good time and be prepared to walk a lot. Its one place not to miss when you're in Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r451505263-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Fulfilling Wildlife experience", "review": "One of the best guided wildlife tours I have experienced. The guides are well versed in seasonal plant names and their uses. They will not only give you proof of animal habits, but will also show you recent photos of animals taken on hidden movement censor cameras. It enhances the entire experience to know that a leopard or a Himalayan Black Bear had crossed our path  less than an hour back. A well designed, informative wildlife experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r340922545-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Jabarkhet Wildlife walk", "review": "Really nice walk. It was not too strenuous, despite some inclined to ascend. The rhododendron were beautiful. We wished we could have seen the Himalayas, but there was too much fog. The highlights were the lone oak and the flag hill. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r360003341-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Interesting nature reserve", "review": "A nice private nature reserve offering nature walks inside fairly dense forest. They have installed cameras to capture wild life that habitat the couple of water holes. They also have a guide to explain details of flora & fauna", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r366615406-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Flag Hill", "review": "Old timers to the area will know this as Flag Hill. The initiative to turn this into a nature reserve is brilliant. The wildlife is returning and the walk is beautiful. Enjoy!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r489309190-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Best wildlife place to enjoy", "review": "This is very peaceful place as much people does not come here as they think this will not be a good place. The guide here are well behaved and charge very reasonable amount. They will show very good footprints of the animals. This is a very big place spread in a big region. Good with children and family.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r351730214-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Reviving the local flora and fauna.", "review": "A private prop[erty of almost 110 acres of land is now being revived with the dedicated effort of the  local community to provide a suitable environment for the flora and fauna to survive and florish.A visit worth undertaking to sight variety of birds with the help of a naturalist working there.Around 4 to 5 km from Landour .It takes almost 2 to 3 hours to cover the forest on foot.Carry binoculars and maintain the decorum of the forest if in a big group. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r369187432-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "A magical walk in the wild", "review": "We visited with two little girls aged six and thirteen.. and were a little uncertain whether they will be able to walk in the forest trails for about two hours. The children surprised us and we spent more than three hours in the forest with Virendra Panwar our nature guide.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r381587246-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Excellent place for Nature Walk", "review": "Mild hiking trails where you can see the flora and fauna of Garhwal - take one of their guided trails where they show you various trees and also tell about their initiative to restore jungles of Uttarakhand. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r387713983-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "Fantastic walk / trek through wild trails, hardly 5 kms from Landour Mussoorie!", "review": "My wife, son and I had the good opportunity to visit this beautiful area in June 2016. We walked up / downhill on small paths, finding with the help of our excellent guide Virender, wild goat dropping, Woodpecker holes in trees, Leopard poo containing goat hairs from its last meal, Rhododendron trees & flowers, Barbets (birds), Swallow-tail Drongos, and many many other species that we could not identify.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r386873797-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 5.0, "title": "An incredible private reserve", "review": "Jaberkhet stands testimony to the incredible difference that individuals like Sejal Worah can make to preserve nature. Our two-hour guided walk was peppered with sights of incredible mushrooms, barking deer, and a forest-in-progress. Only wish we spent more time while we were there, but will be back for sure. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r394666803-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Jabarkhet Wildlife Reserve", "rating": 4.0, "title": "Pleasant trails with great views", "review": "You can reach here by walking on Tehri Road, past Woodstock School. You pay a small entrance fee and they will give you a map with the different trails in the reserve. The trails are very well maintained and marked, and are easy to hike. The views were pleasant and had a good time here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d9749588-r411304808-Jabarkhet_Wildlife_Reserve-Mussoorie_Dehradun_District_Uttarakhand.html"}]