[{"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Love this place", "review": "Yes, I love this place and my princess also. Good food, good shoping and fantastic environment.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r640543678-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Burger King", "review": "Burger King is one of the brand chains of burger outlet all over the world. It serves delicious variety of burgers. It is one of my favourite burger joints and always keep tempted by it's amazing offers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r645717180-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "A good place to visit for all your shopping needs in  Dehradun", "review": "Pacfic mall located on rajpur road on way to Mussorie is ideal for tourists for last minute shopping on way to Mussorie. Probably this is the most spacious mall in Dehradun. But very crowdy in weekend evenings.Visit before 2.00pm to get parking inside. Do not be tempted for roadside parking, your vehicle may be deflated.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r641509882-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Best in Dehradun", "review": "if you want to go for shopping in Dehradun in a mall category then it is the only option or the best one .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r646387265-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Wholesome tourist attraction in Dehradun and Mussoorie", "review": "I have visited this Mall many times with my family since my parents lives in this beautiful city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r649152057-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Pacific Mall", "review": "Pacific mall is the biggest mall of Dehradun. It is centrally located. Its about 4 km from clock tower. Very nice built with ample space and parking. It has 4 screen multiplex of PVR. Food court on top floor is good and you get all variety of food.Almost all brands are available. From clothing to footwear , perfumes, watches, saloon etc. In food court you get muglai, chineese, south Indian, pizza. ice creams, shakes, etc. It is centrally air conditioned and AC is very effective. You have escalators as well as lifts for old and disabled people.There is a kid zone also where your kids can enjoy toys and electric cars etc. This is an idle place if you have to pass few hours with your family or friends. Only thing lacking is that there is no bar in the mall. If you are fond of drinking than this place is not for you. Many times and specially during festive season almost all shops give promotional sales and that is the best time to do your shopping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r650978051-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Huge and beautiful", "review": "Almost all the brand name shops are here to make shopping a joy.. Additionally,the food items from dominos,k.f.c etc are here to enjoy shopping additionally", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r650994909-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "One Mall for all in Doon...", "review": "For someone coming from Delhi, this may be nothing but for Dehradun, this is a go-to place. Although not fully occupied, it still offers a good shopping experience...If you are staying in Lemon tree Hotel, then do cross over for hanging out late evening...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r654442662-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "pacific mall.", "review": "the mall is located on the main rajpur road in jakhan. most of the brands are  available. amble parking available. the movie hall PVR has 5 screens and clean. this is the only mall in dehradun which is maintained properly and hence running well. though many other places are there which are called malls by their owners are miniscule and very badly maintained and hence partially functional. food court has many options. wash rooms are clean and overall a good place to hang out if not for shopping and watching a movie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r652049868-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Good place to visit for purchase ", "review": "In evening time I went to mall for purchase of some woollen items and found that number of shops of woollen clothes of branded companies are there in mall . This is best mall in Dehradoon ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r657198731-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Great mall with excellent facilities.", "review": "Pacific mall is a great mall for shopping and dining. Can be busy on occasions such as New Years Day.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r607955695-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Pacafic Mall Dehradun Review", "review": "Overall all a convenient mall with almost all popular brands and some good eateries. Located in a pretty posh area of the city on way to Mussourie. Added advantage for people who satys at the Four Points Sheraton which is almost next door. Good option to spend few hours with a cinema hall as well", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r614483699-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Great place for shopping and dining at Dehradun", "review": "Pacific Mall has plenty of dining options available. Ambience is great with plenty of shopping options. Mall is very centrally located. Probably the best in town. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r604750576-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Best place to hangout", "review": "Pacific mall is the best place to hangout with friends. Almost all brands are available. Nie food court ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r624149784-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Visit to dehradoon", "review": "Great place. Clean and has some great food and shopping options.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r616367200-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good mall", "review": "Good and conveniently located mall in Dehradun. Multiple brands under one roof. Great variety available at the food court. Has a multiplex, so, you could catch a movie too :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r625898656-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Nice place", "review": "This restaurant is located at a perfect place, it also has good service and good atmosphere. Vegetarian momos are best", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r628555675-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good place for shopping", "review": "Many brands under one roof kids zone is also good and food court has lot off outlets like Pizza Hut etc", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r631592854-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Review of Subway at Pacific Mall", "review": "There are newmerous eateries in Pacific but this has been my favourite.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r639526057-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Family shopping", "review": "One of the biggest mall of Dehardun with big brands , for all age group , large food court and PVR cinema experience ...great sales to save your pocket", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r636276203-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Great shopping for shopaholics", "review": "Having lived in Dehra Dun some 50 years ago it was a surprise to find that it now had a large shopping complex.  It attracts both shopaholics and food lovers as it not only has many shops but also a large food court that caters for many tastes.  It was however disappointing to find that the very nice restaurant I had visited two years ago had been replaced by a cinema.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r571626831-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Canadian family", "review": "Finally an excellent, safe, clean, air conditioned shopping mall with superb high end clothing stores equivalent to western standards maybe slightly better in some instances. Tommy Hilfigur, CK, French Connection, Peter England, Nike, Polo US, Reebok, Puma, Van Heusen, Nautica etc. You will also find several familiar restaurants such as KFC, Burger King, Dunkin Donuts, Baskin Robins, Dominos, Pizza Hut etc. There is also a playland/arcade that the children enjoyed and is reasonably priced. There is also a movie theatre with Hollywood/Bollywood options. Do come here to get away from the hustle bustle of the city and spend some money on brand name quality clothing and home goods. There are also high end South Asian options here as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r570113337-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Nice place to go eat", "review": "The mall is quite nice and is well done for Dehradun's people. The food court is well maintained and not over busy like other malls", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r575058730-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "best mall in dehradun", "review": "pacific mall is one of the best mall in dehradun, as it has maximum brand outlet as compared to others . staff of pacific mall i s also kind and helpful. parking space is also specious. best time to visit is ANYTIME....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r580827290-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "A nice place to hangout and shop ", "review": "The mall is one of the attractions in the town. Located on the main Rajput road, the mall is known to have many shopping outlets like lifestyle, pantaloons etc.. apart from which PVR cinemas attract people towards itself too. And before you watch any movie, do hangout at the food joints on the top floor which has adequate seating for groups and individuals. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r580328940-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "One stop for your all needs", "review": "In Pacific Mall you found everything  Branded Cloths, Accessories, Food Court(KFC, Mc.D, etc) , PVR, Game Zone to Pocket Friendly shops like MAX, Bata etc., it is place where you can spend your complete day without sitting in a same place for hours, go for movie, game and also variety of food in food court from KFC to Masala dosa, also Lifestyle showroom allow you to chose your favourate clothing, footware amoung various top brands like puma, nike, addidas, Vero Moda, LP, Peter England etc. Manyawar, Kid zone are laso there which add more variety in your shopping .   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r583198060-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Cute and cool place ", "review": "Though a small Mall, it has many good brands. Even on a weekday afternoon, the place was buzzing. We did some shopping and then tried a few dishes in the food court. Reasonably good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r585456794-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Shopping mall", "review": "Best shopping mall in dehradun.....at festival time events keep happening there.......Lott's of food variety at food court and total fun for shopping ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r594612133-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "It's good. But misses basic safety requirements.", "review": "It's a nice mall. All major brands have outlets there. Staff is courteous. I always found it clean even during rains. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r603395813-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "It flaunts in style but...", "review": "The only spacious mall in dehradun where you will find almost all the brands with varied stuff. Third floor is the food court where the food served is of good standard. Always comes up with different themes for occasion or otherwise. The only thing which the mall lacks is the proper hygienic washrooms. With the brand name so good, the condition of the washrooms is a real concern. I am writing this post after observing the issue repeatedly. The management should really keep a check on the same. Rest everything is fine.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r594728945-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good place to spend some time", "review": "The best mall in Dehradun, it has some great shops. Crowd is trendy. Food court is limited but good. A great way to spend an evening. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r504330023-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Shopping  for Kids", "review": "Nice place to shop . Availability  of almost all international brands. Becomes convenient to pick up your requirements at place without any hassles. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r513197522-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Good place", "review": "We didn't expect anything like this in Dehradun and it was nice to find all regular brands and whatever you need was there.. the food court also has lot of options and my 10 yr old son really enjoyed playing in the play area and the food.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r505643537-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Maybe!?", "review": "The location is excellent, next to the InterState Bus Stand, where the roads from Saharanpur and Haridwar meet. The building is spacious, but details have been omitted, either due to lack of funds or thinking. So what could have been an exciting and exemplary has been rendered average. Although perspective differs, for a person from hills this may be epitome. The food court has average offerings. Shopping is not exciting, everything can be bought in Paltan bazaar. Escalator are irritating and lifts are painfully slow.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r519707642-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Goid place ", "review": "This place offers major all brands of clothing and other stuff whatsoever is required ! There are decent food outlets as well and few food joints", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r518394308-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "The best mall of dehradun.", "review": "Location is good. Hosts almost all major branded stores. PVR is also there. Food court also offers variety of food type. A must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r522368443-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Once more...", "review": "It is quite natural to step in to Pacific Mall while staying in Lemon Tree Hotel. Had lunch in the Mall's food court on one of those I was staying in Lemon. The mall's food court hasn't changed much, except for a couple of stores gone and a couple of kiosks added. Definitely avoidable coffee shop is the Beanberry Coffee. They serve tea bag for Rs.70, with not so hot water, rip off.  The Mall has added a few more brands. Contines to be the # 1 Mall of Doon Valley.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r533087157-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Good for a stopover if you are proceeding towards o returning from Mussoorie ", "review": "Pacific Mall is a 4 storey  elegant Mall located on Rajpur Road in Dehradun on the way to Mussoorie.  You can shop here for branded goods, watch movies at the PVR multiplex and relish delicious food at the multi cuisine good court on the 3rd floor which also includes lip smacking icecreams , Kulfis and flavoured milk shakes.  Very clean and well maintained .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r533440619-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Utility Mall", "review": "This is one of the utilitity malls in Dehradun. It is represented by all reputed brands. There is cinema theatre, utility shops, specific area for kids to play & various quality eating joints. There is enough parking place in basement. Overall, it can be a good experience to enjoy along with friends & families. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r540544379-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Finest mall in Dehradun", "review": "It is on the Rajpur Road, heart of the city. The finest mall in Dehradun. Good for festive shopping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r461854537-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "All in one mall", "review": "Has almost all brands , food court, pvr cinema hall,  store 99 , a hair salon,  aroma thai day spa, children recreation centre, a plam reader, hotel lemon tree, dominos, dunkin doughnut, bugger king . Max lifestyle, pantaloons ...woh... And many more", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r464250925-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "all brands under a single roof", "review": "Pacific mall is a multi storey mall that also has PVR inside and also has the food court on the top floor. you will get all the national and international brands inside and thus providing a good amount of option for your selection. Can be said to be the biggest mall in dehradun. A good place for shopaholics. Do enjoy and try the momos available there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r563354263-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "An average mall", "review": "If you are looking for locally made items then this is not the mall for you.  There are name brand stores at good but not great prices.  The best prices were at the massage place and the salon on the top floor.  I preferred finding India made things but all I could find were shawls and other textiles at a couple of small booths out in front of the entrance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r476249091-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "One of the A grade malls in India.", "review": "What a place this is located on the most famous Rajpur road of Dehradun. This mall has a mix of various big & small brands which in itself is enough to pull in crowd everyday. Very nice place it is to visit & well maintained too. Pvr cinemas here is the best place I liked.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r476987491-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Best Family Destination in Dehradun", "review": "Besides being the only Shopping Destination worth visiting in Dehradun, Pacific Mall has the best collection of Brands under one roof. Interesting Premium brands available like CK, Tommy, Jack & Jones, VeroModa, Only, Nautica and the newly opened Asics. The Food Court had a wide range of cuisines and not to miss the only Burger King outlet in the city. The Lemon Tree Hotel is a part of the building.Well Maintained Mall with lots of activities for all age groups. A True Family Destination.Worth the visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r488952557-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Place to chill  and with option to entertain kids", "review": "Visited on 26th May'17", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r495446059-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Awesome place", "review": "Very good place and the atmosphere is very good ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r492442000-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "The Best City Hangout Place of Dehadun", "review": "I don't miss metro city life anymore since Pacific has started in Dehradun...they have everything in place....infact introduced the best outlets dehraudn has ever seen....i just love this place...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r497125979-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Pretty decent for a township", "review": "Not crowded, not empty. Decent food joints. Great for waiting, sitting and talking to friends. Also a few decent brand shops. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r496367390-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Decent Mall with great outlets and crowd", "review": "Right on Rajpur Road way to DELHI oR MUSSURRIE this is nice mall, do some shopping, food and fun for kids", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r500548164-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "decent mall", "review": "situated at rajpur road jakkhan. Pacific mall is the only mall to visit in dehradun city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r420023619-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Largest and best in Dehradun.", "review": "It is the largest mall in Dehradun and accommodates almost all major brands. With five floors and a large area for parking,it is the largest mall in Dehradun and one of the largest in Uttarakhand.I think it is a must visit for those who visit Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r412638165-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Nice place", "review": "You can shop what so ever you want in clothing etc", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r425999954-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Improved..", "review": "The Mall is looking more packed in terms of floor space since I visited this place a few months ago. There are few more international brands now, the food court has a bigger Burger King. Avoid the South Indian items at Bikano, that's not their strength. Try Vaango if you are looking for South Indian food. The Amritsari stuff is also good..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r426358449-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Yet another Mall", "review": "I have been witness of the past decade or so to the changes along Rajpur Road.  The erection of malls and hotels have become the mark of 'progress'.  Where once it was the 'tree lined Rajpur Road' it is now becoming the 'mall' Road.  Following my visit to the Pacific Mall today I note its content of shops is what you find in most Malls today, clothing, footwear, electronics of varying sort,  movie house and a pleasant surprise herein... books and of course the ubiquitous Food Court minus a MacDonalds.  Parking is available for Rps40, the Lift/elevator is free.  All said I prefer the Mall road in Mussooire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r430533387-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good place", "review": "Biggest shopping mall in Heart of The City Of Dehradun", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r430830429-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "An evening @ Pacific Mall", "review": "Sunday evening spent @ Pacific Mall. There is no doubt that Its a good place for Hangout, number of food joint, shopping ,Movies  etc. The mall management is very creative. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r435747926-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "One happening place in Doon", "review": "Pacific mall is actually the only place in Dehradun which is bright and happening. Had good brands, a multiplex, restaurants and a food court which serves reasonably good food. Generally on weekends there is more crowd. Ample of parking area is available. It is located on main Rajpur road. Great place to spend a few hours.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r447385697-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good Food Court, but not much Brands Variety", "review": "Well we visited on 1st Nov2016, their food court has good capacity and good food with good speedy service, but its shaking all the time, as the escalation machine keeps on vibrating whole floor vibrates like some earthquake, well otherwise nice place to shop, enjoy and dine", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r436724870-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Great place", "review": "Bright and happening place. Good brands. Nice food court. Many options. Located on beautiful Rajpur Road. Multiplex. Lemon tree hotel. Large ample parking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r453977920-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good time pass", "review": "Worth to visit once. almost all brands available. Nice & clean place with lovely food & gentry. Easy to reach too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r365941283-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Well it's the best in town", "review": "Not a classic mall sized mall. It's really compact by any standards but it does the job I guess. Most regular brand stores and a jam packed food court with most popular eateries. No pubs/ lounges/ restaurants though which is very surprising for a town with a pretty up and about kind of population. Way too crowded on weekends so go early to get a parking spot. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r371478863-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Pacific mall", "review": "This is a very good mall in dehradun. Most if the brands are available and decent place to visit. Food court is good. This is safe for couples and situated in a nice place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r372570805-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "biggest mall in dhradun", "review": "if you have less time and want to visit a mall then go straight to pacific.it has all the brands.all the crowd of rishikesh and dehradun comes here. its is which is always have people. quality of crowd is between moderate. and at last if u r hungry straight to to 3rd floor(food court).", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r381305843-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Leader in Dehradun", "review": "This mall comes as a 'blessing in disguise' to people of Dehradun. Space utilization is very good and one may get everything and anything from here :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r385254788-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Dehradun own GIP", "review": "It was a pleasant surprise to see such a beautiful and clean Mall next to Hotel", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r396181148-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Shopping for Son's Bday", "review": "Well i have done shopping for my son's bday at Pacific Mall. The flat 50% discount at Lifestyle & Pantaloons was amazing. The PVR cinemas is best in the city. Watched Sultan there. Had great food at KFC  & dunkins donuts in pacific malls", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r406475576-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Good place", "review": "Nice place to go shop and dine.It has lot of good brands and good foodcourt.Though it a small mall but interms of shopping there are many brands that you can buy from", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r401525410-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "The mall has it all", "review": "Movies? Food court? Tons of brand stores? This mall has it all. One downside is that almost all the places to eat are fast foos outlets with no real option for your higher end dining. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r399189992-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "very good mall in dehradun", "review": "This is one of the good place to hangout. Nice place for shoppers, approx every brand is available here. On the top floor there is lot of activities for children to enjoy here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r333193268-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Great place to shop and have food at Dehradhun", "review": "This mall is a relatively small Mall as compared to other big cities in India, yet, it has most of the top international brand and Indian brand outlets here. Most of all it is not as crowded and noisy as other malls I have visited and there are plenty to choose from at the food court as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r412354436-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "a good attraction", "review": "we were here on new year day.the place was decorated for the occasion and the shops were full of discount offers.a memorable experience indeed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r339081668-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Gift by the Pacific Group", "review": "Visited the beautiful and well planned mall in Dehradun and found it be to be a very well planned and aesthetically designed mall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r339189812-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "A must visit on a dehradoon visit", "review": "The mall has a wide range of showrooms and a great food-court.As I live in a big metro like Delhi, I did not expected a great experience in a Dehradoon mall, but I was wrong , the mall has some big brands like  Clarks, Levi's and the mall is very well maintained at par with any mall in Delhi", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r340594334-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "The only weekend destination ", "review": "All in one place to go to ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r342786163-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Everything in one roof", "review": "mall  has everything for customer in terms of foodcourt ,apperal brands...PVR cinemas..funky kingdom for kids...love to visit that place again and again", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r341860781-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Nice place to shop and eat ", "review": "It's a decent place to shop and eat.If you are a movie buff then there is PVR in it to watch the latest release.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r361460446-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Nice", "review": "A typical mall,with all the branded shops and a big food court which houses many national and international brands. overall a good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r343759408-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Time Pass", "review": "It is good place for time pass in dehradun and very good palce to see it has movie theater which is very good", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r363574218-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "A lovely Mall on Rajpur Road", "review": "A very nice shopping mall with a decent food court where you can get all sorts of cuisines. The PVR outlets are perfect too - should you wish to drop in for a movie. With this Mall situated along with our hotel (Lemon Tree), it was an ideal place for us to hang out.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r343704872-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Decent Place to shop and eat", "review": "This is one of the newest and professionally managed average sized mall, which also has a PVR cinema. If you just want to spend some time with your family and kids for a day, you can safely choose this place. There's a decent gaming area for kids and adults too on the top floor, offing arcade video games, kids rides and bumper car rides too! The food court is usually packed over the weekends, offering primarily Indian food, but also has option of KFC and American food.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r304556505-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Nice place to stroll around for shopping and food", "review": "It is located on the busy Rajpur road on the way to Mussori. It is decent and clean, lot of shops selling clothing, accessories etc. It is well managed compared to other similar facilities in Dehradun. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r305687931-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "\"Looking To The Future\"", "review": "The Pacific Mall at Dehradun really is something else. Glittering, soaring, rife with luxury shopping that boasts the likes of Louis Philippe and Van Heusen, US Polo Assn. and Blackberry's, Nautica and John Players alongside familiar department stores like Lifestyle, Pantaloons and Max, this is where the well-heeled go to spend en masse and the rest of the world goes to splurge -- or just ogle, dream and enjoy a latte from Barista Lavazza. With its tony ambiance, tonier brand names and a veritable Milky Way of satellite shopping venues and eateries, it's a favorite of locals and a must-do for the most mall-inclined of visitors.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r312957910-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Sizzler at the Food-Court is what my Kids Love :)", "review": "Good Place to hang out with family.Window-shop, watch movies at the Multiplex, or enjoy variety of Food at the Food-Court.Tends to get a bit Crowded .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r307120073-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Family Favourite", "review": "This mall is the latest in Dehra Dun,that has come up in Rajpur Road.An ideal place to spend quality time with friends and family.Good PVR Movie halls,wide variety food,you name it and it is here.Shopping is another attraction.Kids just love the KFC,Dominos and the Candy store.The place has good security arrangements and the vast area at several levels ,makes this mall even more unique.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r322996012-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "A good mall in Dehradun", "review": "The mall is on rajpur road. The mall is good with a good number of restaurants and exclusive showrooms. Its also has a PVR for a complete experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r320898694-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Good mall", "review": "It was quiet a decent mall and was even crowded on a weekday. The eating options were quite good too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r277580220-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Middle sized mall for every purchase", "review": "The mall is not very big but contains all major retail outlets from KFC to woodlands. Everything from flowers to chocolates to textile to cinema to food is available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r281774215-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "well designed mall with good retail outlets and eating joints", "review": "Pacific Mall has a good array of clothes, sport, and garment retail outlets from some of the best known brands. In addition, it has a great food court and a PVR movie complex to add to the overall experience....well designed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r331952419-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 1.0, "title": "Another Mall", "review": "Duh ...totally avoidable....I dont want to write here anything. Capitalism .. AS per dehradun standard it is good and if you want to watch movie then u can visit PVR there but screen was small.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r327175089-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Since when is a mall a place to visit!", "review": "Its a mall for gods sake. Nothing spectacular, good place to shop if you're into brands and decent food court. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r331984575-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Nice place", "review": "Had good time yet again, fortunately got the movie ticket, it was house full. Mall has great crowd and seems to doing well. We stayed in close by hotel and found this great place to hang around in evening.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r328000077-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Full of stock even during sale", "review": "Its a mall where you would find most of the stores full of stock even during sale unlike elsewhere in north india. The place has stores like CK, tommy, vero moda, russo brunalo, shoe tree and many others. If u r in a mood ti shop its the best place you can be.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r290795839-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "nice", "review": "this is nice place to visit and shop in deharadoon for few hours. this is well maintained and staff were also a bit couteous.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r287511641-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Medium sized but very good mall", "review": "So far as size is considered,this mall can't match those in tier 1 and tier 2 cities of India,or those huge malls in Delhi,Mumbai or Kolkata. But this is a nice mall,fairly medium in size but houses almost every brands and eating joints one can think of", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r286096393-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Small ,but the best place to shop around in Doon.", "review": "Obviously the best mall in Doon; though compared to the malls in Chennai or Delhi; the Pacific Dehradun is quite small. Several top brands have their stores in this mall. The food court on the top deck of the mall offers plenty of options to eat; ranging from Lucknowvi Avadh food to Idlis from Vaango. There's a specialist Chai shop in the corner; the tea out there is superb. Greta place to have casual meetings. The parking is adequate and organised. I've been visiting the mall for the past 8 months or so and I note that the mall has been maintained quite well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r286580085-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "The most visited mall", "review": "The pacific mall give doonites the real concept of mall.The minus point is the location and parking fee on weekends.Otherwise you can have garment outlets of all leading brands add to Lifestyle, Max and Pantaloons.Funky Kingdom for kids to 99 shops and food court with KFC, Domminnos, baskin ronbbins are added attraction. It has also a large parking place and you can enjoy movie at PVR also.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r293530455-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "#Awesome", "review": "Very nice mall with coverage of almost all brands national as well as international. This mall is heart throb of the city of valleys......a good source of outing and fun with family and friends.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r293177135-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Decent mall", "review": "Not too huge. Good layout. Multiplex. Like the brands n eating out-Lets. If looking at malling in Dehradun this is the place to go. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r297628332-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Movie and eating", "review": "Great mall for a small town", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r239938024-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Pacific Mall", "review": "The famed bazaars of Dehradun are gradually giving way to malls. Pacific mall, which is one of the most popular mall, has come up in the last couple of years. The mall has easy access, being located on Rajpur Road, it has a good layout, and is spread over multiple levels.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r240488350-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Must go", "review": "Weekly performances like dance, ramp walk, etc. keep happening. Saturday and Sunday performances are sure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r244910837-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "Woderfull", "review": "A great place to shop, dine and spend time with family and friends.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r295140789-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 5.0, "title": "As good as any in Gurgaon", "review": "Excellent worth a visit, nice food court and with lemon tree hotel attached great for a walkabout after dinner. All major brands represented.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r255189397-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Biggest mall in Dehradun gud Location at Jakhan Rajpur Road.", "review": "Till present day Pacific mall z the biggest mall in dehradun. U can shop clothes n accessories of all big brands here like van Heusen Louis Phillipe color plus polo Levis wrangler puma nike reebok etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r258154430-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "The best Mall of Dehradun", "review": "Easy parking , pretty clean,well organised and plenty of shops, almost all brands , lots of activity in weekends, The PVR , Funky Kingdom & Food Court are Good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r244972503-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Pacific-The biggest mall in Dehradun", "review": "Pacific Mall with Lifestyle as it's star store is the biggest mall in the city of Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r260251531-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "nice place", "review": "nice place to hang out with family and eat. kids enjoy at the game zone also. and v can shop there aswell", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r271305228-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "Excellent mall", "review": "The mall was located next to the hotel where I was staying. The mall has PVR and watched Mad Max in the evening once my meeting was over. The food court had decent choice of cuisines.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r275036375-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 4.0, "title": "quite a place for dehradun", "review": "Stayed a cpl of nights at the Lemon Tree Hotel Dehradun. Colocated to the hotel was the Pacific Mall - and truly - I did not expect Dejradun to have such a place. Though most of the outlets are the usual brands of apparels, footwear and boutiques - the foodcourt was interesting. It was well maintained. Clean. And smelt fresh. Seemed to be a happening place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r275231685-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Pacific Mall", "rating": 3.0, "title": "Its a western mall", "review": "For better or for worse its a western styled indoor mall. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297687-d7103794-r234866069-Pacific_Mall-Dehradun_Dehradun_District_Uttarakhand.html"}]