[{"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Soham heritage", "review": "Mesmerising experience for Artlovers . The work is very beautiful and also very beautifully done , as it reflects lot of perfection and patience . Actually the Artworks shows the inside out of the Artist which in this case is adorable . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r608741845-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Transcendence, Aesthetics, Philanthropy, Art, Story Telling, and Culture", "review": "First, when you stop at the top of the hill and you begin down the steep side road, go all the way to the bottom of the hill (100 + Yards), the museum will be on the right and it is clearly identified with signs, colors and art. If you think it's one of the other buildings, it it's not properly identified, keep walking down. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r600663579-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "This labour of love is a Must Go place in Mussoorie", "review": "If you can't experience all the beauty, mysteries, secrets and stories of the length and breadth of the Himalayas in one (or even several) short visit, this museum, a labour of love of the Shuklas, is a \"must go\" place. It is, kind of, the entire Himalayas preserved in one place, through beautiful paintings, artefacts and in stories lovingly told by this amazing couple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r592274484-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Good One", "review": "Very nice experience and fun, informative and innovative to explore such art. good for art lovers and culture", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r619909881-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Nice", "review": "Really nice place to view some quirky yet simple art. Its at a convenient location too so can pop in to view", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r625282829-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Awe in a small town ", "review": "Wonderful place and must visit in mussoorie    most locals don't know about it.  There is small trek to reach the location With lovely views on the way down    beautiful paintings and sculptures created by the owners", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r630206983-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A must visit in Mussorie", "review": "The location is a bit difficult to find and while you are on the way you think is this really worth the effort. However once you arrive at the place you utter a wow. Kudos to couple maintaining their culture and heritage so well. Don’t worry if you are not really an art loving person - you will still enjoy the experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r627466212-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Visit if you have time", "review": "Visit this place if you have time. I spent hardly 10 min in this place. Cannot tell much. We were more happy to enjoy the weather in Mussorie and do outdoor activities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r633532906-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Great place to visit!!", "review": "The owner herself gave us a guided tour of the gallery. The way she explained each and everything in detail made our tour. She is an excellent artist herself and her paintings form an important section in the gallery. I would recommend you to go in the evening as the sunset just looks beautiful from their porch. The ancient parts that they have used to decorate the gallery gives the place an ambience that makes you feel as if you have been teleported back in time and through various regions experiencing the local cultures on the way.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r633964737-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Visit to mussorie", "review": "I am not so fond of art and culture. The paintings I saw here was superb ,depicted the culture and mythology of Uttarakhand. Even the sculptures were well carved and the collection related to Himalaya and Uttarakhand were superb. Must place to visit . Kavita,owner of place is very polite and she will answer each question of yours in very polite way. Loved the place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r644554823-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "A new wonderful addtion to showcase the local heritage in a engeing way", "review": "This place is a perfect reflection of the local heritage and culture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r575117107-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "soham heritage", "review": "beautiful paintings", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r572332431-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Only for art/heritage lovers", "review": "The place is good, but very very hard to find and access, which is actually by design, as Mrs. Shukla informed us. Do not go here only to check the boxes of visiting the no. 1 rated attraction in Mussoorie. Go if you are a genuine art/heritage lover. They have also started charging a Rs. 100 per person entry fee (above 5 years of age), a bit steep in my opinion, especially if you do not spend too much time here. That said, Mrs. Shukla was very sweet, showed us around, took pictures, and kindly arranged a taxi for us for the return as we were simply exhausted finding this place. The souvenir shop is small but may have something you fancy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r569597366-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Beautiful", "review": "Full of artistic works everywhere, nice place to inspire one of their colourless life and refill the joy of life and its beauty here", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r575448357-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Soham Heritage & Art Centre is a Himalayan Museum in Mussoorie", "review": "SOHAM - An Himalayan Museum is a Heritage & Art Centre showcasing Himalayan art, culture and lifestyle is a very well designed hangout, perched amidst thick Oak forest overlooking Doon valley, offering one of the best sights of the Mussoorie Winterline. The management Sameer Shukl & Dr Kavita Shukla are doing a brilliant job at showcasing the culture and heritage of the Himalayas under one roof, through photographs, paintings, murals, sculptures, artefacts, etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r582185756-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "great place to know heritage", "review": "This is a must visit place in mussoorie. the taxi guys will try and avoid as this is a private place and parking is tough. use google maps to navigate it. the owner will take you things self and showcase things in person. generally takes 15-20 mins of visit time. great view from the place.  Ticket to the place in Rs. 100.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r581575369-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "A nice place to know about himalayan beauty", "review": "Full of himalayan heritage and art. Own by a family and very nicely maintained. Not only for art lovers but it attracts all travellers. Takes almost 15 mins to see, a treat for eyes. A must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r582778733-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "ENLIGHTENING", "review": "It is a must visit for all who wish to know the Himalayan spirit, commendable work done by an artist couple all on their own to preserve the Himalayan heritage. If you really wish to feel the himalayas you ought to land up in this place once. Also a dream house!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r587523575-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Awesome place - must visit", "review": "You will feel nostalgic about memories you will take from this place. Do make a point to visit - you won't regret. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r588958610-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A hidden gem", "review": "I and my husband visited during a long weekend and found ourselves desperately trying to get away from the crowded Mall Road. Thanks to TripAdvisor, we got to know about this place. It's a long walk from the main city, around 4km. We had to ask around a couple of times, it's away from the main road. It's a totally different world when you get there, peaceful and pretty place. A lot of hard-work put in by the couple. Owner herself walked around to give a tour of the place, despite having an ankle injury. Very interesting and informative commentary added to the visual treat. A must visit place!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r591478787-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "You wont regret visiting here....", "review": "I have been to Mussoorie for over 4 times, only in my last and recent visit I noticed this museum and heritage centre located in a serene, calm and peaceful spot. I gave it a second thought about visiting and for sure I loved it.. they have very rich and beautiful collectibles that portray the heritage of Himalayas. Excellent work by Sameer and Shruti Shukla. They are really inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r529321854-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Beautiful place", "review": "Heritage of himalayas with a focus on uttarakhand is displayed through different art forms.Only complete museum of the state.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r542587810-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "good museum", "review": "a must visit if you art lover. .collection of Indian culture and traditions. Worth visiting. a small but good place and peaceful.away from rush", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r535532584-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Beautiful Cultural Hub", "review": "Soham Heritage Art Centre situated  in serene Mussoorie is stunning and alluring place showcasing Heritage of Uttarakhand. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r519748851-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A Must visit", "review": "This place is full of positive vibes. A big salute to the couple who manages this place out of their own resources. They have a small temple there which is also nice. Small place but well maintained and good collection. They also help the local poor children with free education. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r548817032-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "nice museum", "review": "We have visited here and they have a huge collection of himalayas traditional caps or things so nice place .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r549222409-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A memorable visit!", "review": "Visited Soham for the first time during Diwali holidays (October 2017). Must say, the place is worth a visit.. this place will leave every nature lover awestruck.. me and my partner rejoiced our one of the best sunsets from here! We were amazed to see how beautifully Mr. and Mrs. Shukla have managed to preserve and enrich the Himalayan culture! and worth mentioning their efforts and initiatives toward child education and women empowerment! Long way to go @Soham Heritage & Art Centre! We wish you all the best for your future endeavours!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r549294227-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "\"A lifetime Visit to the best place in mussorie\"", "review": "Soham is 'one-of-a-kind' place to visit.The place is full of historical and cultural artifacts, and beautiful paintings made by Mr Sameer Shukla jii and Mrs Kavita Shukla jii. All the things at Soham make us remember the 20-year long journey started by Sameer jii with the support of his wife and children and the hardwork he has done to make his dream possible. Sameer jii and Kavita jii are a wonderful couple and they are so much talented. At Soham I learned how someone can live his dream and rather than living a normal life, one can choose to follow his passion. The Museum has numerous pre-independence photos of the Himalayas which are very rare to be found. There are also collections of herbs, musical instruments, agricultural equipments etc displayed there. Also there is a lovely temple in the premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r550783374-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must Visit place in Mussoorie ", "review": "Fortunately we went to Soham Heritage just before leaving Mussoorie. It is a very very interesting space that has been created by Mr. & Mrs. Shukla who have put on display the pieces that have been made by them or collected from tribes across India. The collection also gives a fair idea of history behind every article. Was specifically impressed by the Temple inside the centre and the Portraits of Himalayan peaks on display. Highly recommended for all travellers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r550404617-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A memorable trip", "review": "I must say you should visit this place if you are in mussoorie. The museum will give you good insights of himalayan culture and it is well maintained. The owner of the museum will narrate everything very beautifully. It's not an ordinary museum. Just go and feel it by yourself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r567048698-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Unique display of Himalayan Culture and Tradition", "review": "For those who loves Art, Culture and Traditions would love it with a unique display and collection of all those from the Himalayas. Several paintings, Murals, Sculptures and other artifacts are in display. You can also purchase original stone and other type  jewelry at a reasonable price which goes in for the maintenance of this museum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r490281687-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Amazing tribute to Himalayas", "review": "A must to visit place for every one who are in love with Kumau Garhwal and Himalayan range. Mr. Shukla an outstanding curator has amazing passion for the area, culture and nature. When you walk through His displays and exhibits it's like walking through every page of history of Himalayas and the region. We were lucky to find Mr. Shukl himself present at the centre. His jaw dropping narration about his explorations and excursion in the Himalayan range inspires you and ignites your passion as well. Do visit Soham Heritage and Art Centre when in Masoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r474105012-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "excellent", "review": "This is an excellent place for art lovers.  it is very well maintained and must visit place when you are here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r492915484-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A must visit place", "review": "This is a must visit place for anyone visiting Mussoorie. The place will introduce one with the culture and heritage. Manged by a wonderful couple. This place has a small but very beautiful and well maintained Museum, local art collections (original and reproduced). The best part about the place is almost all the reproduced arts were created with recycled materials. Situated at a very nice and quite corner of the city, this is a must see place for anyone interested in Arts, heritage and tradition.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r497582946-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Fantastic peek into history", "review": "For anyone making a trip to Mussoorie, this is a place you must visit. It has a small, but fantastic collection of artwork, a museum with local artifacts and some stunning sculptures.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r489503936-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "a must visit place", "review": "a must visit place if u r in mussorie and if u r art n heritage lover.. wont take much time. spend time with the owners to increase ur spirtuality... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r498503304-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A beautiful & a well kept museum. Surely a must visit in Mussoorie trip", "review": "Mr Sameer & Mrs Shukl are very inspiring couple. The walk upto their place from the Big Bend is interesting and also a kind of small trek. Its a very beautifully kept museum which keeps the spirit of Himalayas alive. One can have peek into the life in Himalayas - people, food, clothes, utensils, customs, religious beliefs, paintings etc. One can also check out the photographs of different places in Himalayas, which is very nice. One can visit this place being solo, with family or in a group. A prior call to them before visiting is appreciated. The couple also teaches young kids of the locality. Truly very nice & interesting place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r512993308-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A must Visit", "review": "Away from the rush of Mall Road, a peaceful place, showing beautiful artistic work, rich and untouched himalayan culture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r507760256-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "must visit place", "review": "if you are in mussoorie you should visit here.collection of Indian culture and traditions. Worth visiting. a small but good place.visit if you are art lover", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r516089461-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Worth visiting!!!", "review": "Soham Heritage exhibits a true and precise collection of Indian culture and traditions. Worth visiting!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r508403235-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Visual Treat & Must Visit:) :) :)", "review": "It's a place designed with passion and commitment. A delightful destination away from the noise of the main roads and market. The curators are artists themselves and have meticulously put together art works and exhibits. The Himalayan culture and customs esp.those of Uttarakhand, which are not very talked about or much in public space are so so well preserved. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r450150852-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "nice place", "review": " It is well maintained and working for poor children education too.If you are interested in explore things, that is the best place for you.For all the people who appreciate art and culture this place is a must visit. Great work by Mr & Mrs Shukla.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r428601068-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must Visit - A Unique Experience", "review": "Rare Art Gallery, historic Himalayas Images, Self made beautiful scriptures, traditional Collection of various Unique things related to Uttrakhand & Himalayas...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r416244373-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "THE HARD WORK OF A DEDICATED COUPLE", "review": "It was just a casual walk beyond mall road, after the great Siva Temple about half a kilometer downward we discovered this beautiful Temple and Museum. We are really surprised to see the dedication.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r429573608-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Nice art", "review": "It was a great place and thier are great piece of art in this heritage center it has a great atmosphere", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r447375756-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Fair tourism + unique experience", "review": "This private center can be devided in three branches:", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r451133094-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A hidden treasure, deserving to be Mussoorie's cynosure !", "review": "For all you travellers seeking something unique on a hill trip, Soham Heritage Centre deserves a must-visit ( spare at least 2 3 hours of your time ) ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r466671165-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Awesome Spiritual Experience", "review": "A must visit for anyone who aspires to take a detour from the stressful life and gain motivation knowledge and inspiration to live life freely and make the most of it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r465586687-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Dream destination", "review": "I visited mussoorie no. of times. But this time surfed TripAdvisor and came across some good reviews about Soham Museum. Its one km walk from mall road turned into one of the best place recommended for any art and heritage lover. What an ambience. Must visit place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r465969988-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "\"Mesmerizing\"", "review": "We went for a Office trip to Dehradun , Mussoorie. So we searched for places to be visited during the trip and we came across SOHAM Heritage and when we discussed with our team, should we visit this or not?, so everybody said \" What we will do there, this sounds like a Temple Visit, we are for fun, so we voted and after that 60% people said we should try it. so went for it and after visiting the place 100% people said we did good that we visit this place. The place is Very Well maintained by there Owners.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r467730261-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must visit", "review": "A must visit place at the beginning of the Mussorie trip. Exclusive collections of amenities of different cultures and paintings truly amazed us. Perfect for every age type to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r406430854-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Mesmerising!", "review": "To begin with I was never really a fan of museums, but then one afternoon I decided to take a walk around my hotel and thought of visiting this place, with a couple of other friends. So I walk in and I am completely spellbound with the work that has been done inside the premises. There is a combination of hard work, presence of mind and complete dedication in following one's passion. The owner took us around the entire place, what a charming lady! While she was giving us details of each and every painting and artifact placed in the museum, it sunk to me, how pretty Mussoorie actually is. Since I hail from Dehradun, nothing in Mussoorie has really amused me, and this place came as quite a surprise! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r409906599-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "must visit place", "review": "Very good place and views. these peoples are doing very good job. . For all the people who appreciate art and culture this place is a must visit. Great work by Mr & Mrs Shukla.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r406432839-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Feedback", "review": "It is a very nice place to visit to get a flavour of HImalaya and the people tradition.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r406469072-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Incredible place ... must visit..", "review": "It a incredible  place in valley of Mussoorie very innovated place  for artistic. well design work shop art gallery  they showing the verity of culture of Himalayas. very appreciate for the effort for these people..very thankful for these people ..for helping poor people..for there education. ones you visit..you impressed. really. just visit one ..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r410174352-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Cultural gem on the outskirts of an increasingly dirty Mussoorie", "review": "The efforts of a couple, who want to preserve and showcase the culture and traditions of the Indian Himalayas. Was very fun  and educational for our USA raised daughters (8 and 11 years) as it gave us the opportunity to tell them of various religious and cultural facts and stories. Anyone with an interest in history, culture and art must visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r407284221-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Artistic place - preserving history of Himalayas", "review": "It is an Art gallery privately maintained by a couple - Mr. Sameer Shukla & Mrs Kavita Shukla. They are preserving the things that are on the verge of extinction. They will guide you around & are really nice people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r412966007-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "#best_artistic_site...... #the_wonderful_people", "review": "IT is really a wonderful sight to see in lap of Himalayas.  They have brought all the traditional colors of Himalayas on one place. To make such a center needs a passion, courage to go out of the line and a touch genius artistry which i am able to see in Dr. Kavita and the work of her husband. They have done such a marvelous job that even the thought of the center gives me such a pleasant vibes and make me smile.Thanks for making such a wonderful and peaceful monument. And also to mention the social work they are doing to nurture the young minds, Keep it up dears.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r410671014-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Beautiful!", "review": "For a person who is least interested in visiting art galleries and museums to a person who started recommending people to not miss a chance to go visit this - This is the distance I have travelled after a half an hour walk around this place. There isn't a single corner in this art gallery which does not provide a person with relevant and overwhelming information. A must visit in Mussoorie..a place that will introduce you to heritage and art in the true sense. I would like to specially mention the people behind this beautiful gallery - Mr. Sameer Shukla & Mrs Kavita Shukla. Your visit will be incomplete without a meeting with them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r410385896-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 2.0, "title": "Not highly recommended", "review": "It is nothing unusual as one might think. The Tibetian market is a much better place for the choicest of shopping", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r415424398-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Amazing place among queen of hills", "review": "Being frm gadhwal it makes me proud to visit such an amazing place. The hosts are amazing ,they pay attention to each n every guest . Moreover the location is beautiful,the sculptures,paintings n photographs r worth watching . It is the bst place to visit in mussoorie .A must visit if for every tourist.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r366893483-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Lifetime Experience", "review": "I felt speechless as I was taking a stroll towards the main area of this place. I was simply awestruck to see such beauty that I was blanketed with.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r381017664-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Heaven On Earth", "review": "Speechless...means a lots of inspirations from just one place...After going there i mind has changed a lot...A peaceful place...lots of arts of ancient times..helped me to know how people survived how they lived...some of the pics were mindblowing...different cultural festivals, ancient gods...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r384536119-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A very good initiative by the hosts", "review": "The place was awesome ,no doubt .The building was very well designed and decorated .The antiques were rare and well assembled .The photo collection was one of a kind and the british map was the only one which had survived .The hosts were excellent .The idea ,design and execution were perfect .One of the best places to visit in mussoorie .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r384817195-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A short Himalayan journey", "review": "Soham centre is a good overview of the Himalayan region, its people and its culture right from Kashmir till the eastern end of India. The place preserves rare photographs from a few decades and regional diversity in daily use items.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r384477396-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "amazing place", "review": "It was really awesome to be there.As a student I learned so much about the place I belong to.The owners were very hospitable and paid attention to everything we asked.I was happy to see that they teach poor kids for free.Keep it up!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r380722290-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "MUST VISIT. ", "review": "This place is absolutely GREAT. It is the only place in the much-commercialized Mussoorie which is attempting to bring back the past history , the colourfull heritage and the blazing traditions of the Himalayas back to present day. Their depiction, art, sculptures and just even their interiors will pique your interest. Mr and Mrs Shukla are warm and intellectual, and will make your visit homely and enriching. They have made the place piece by piece and are still working on their expansion.  It's a place which is a MUST visit if in Mussoorie or Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r387124080-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "An absolute art lovers delight.", "review": "Kudos to Mr. and Mrs. Shukla for putting up such a fab place. For all the people who appreciate art and culture this place is a must visit. I was disappointed that many of the locals of mussoorie did not have much idea about the place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r386815644-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must Visit Place", "review": "The place is just before Mussoorie and not many locals are aware of this place. But thanks to signboards placed privately at strategic location helped us to reach there. Exceptionally warm welcome and individual attention was given. Amazing items like paintings, photographs, authentic himachali items and many more..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r387308932-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Impressed", "review": "Great Project showcasing Uttarakhand tradition ,heritage & culture which unfortunately like many others is dying . Great work by Mr & Mrs Shukla ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r385709205-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "True nature lovers", "review": "How much nature mountains are important to us..one cam relaize by visiting this place and by talking to the owner of the place..he is full of amazing experiences and the most inspiring thing the way they have preserved the heritage actually the true Indian heritage Himalayan people has to offer is clearly preserved in there museum..amazing paintings by Kavita aunty and Sameer uncle..one can actually go deep into there thoughts as if we are present in that picture ..must go place must visit..hoping to learn more of there Himalayan adventures very soon..:)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r344919542-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Hidden jewel ", "review": "Soham heritage & art center can safely be branded as the cultural hub of Uttarakhand. The museum and shiv shakti temple compliment each other. Every detail in temple has its own important believers and art lovers both will be delighted here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r349039180-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Holy and Lovely", "review": "Our family visiting from USA always wanted to be here at this spiritual and peaceful abode of Mr. Sameer and Mrs. Kavitha. Their hospitality and knowledge of Hinduism and rituals is beyond \"AWE\". Had a great time here. In life, one has to do things like these that can preserve Hindu culture and mysticisms of the Himalayas. The museum that the couple had created has pieces that you will not find anywhere else. Must see place in Mussoorie..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r354053019-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Hidden jewel ", "review": "Soham heritage & art centre can safely be branded as the cultural hub of uttarakhand. The museum and shiv shakti temple compliment each other. Every detail in temple has its own importance believers and art lovers both will be delighted here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r349052932-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "SOHAM ART & HERITAGE MUSEUM AT MUSSOORIE", "review": "I am lucky that my daughter has been studying at Wynberg Allen School at Mussoorie. It is because of this reason, that I am fortunate, to have come across and visited Soham Art & Heritage Museum located at Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r345737701-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Treasure of Motivation and Himalaya heritage", "review": "A place which is must visit if you really want to know the heritage of Himalayan culture, its tradition and traditional art and craft. The SOHAM is created by a motivated couple, Sameer and Kavita and truly they have created a wonder in the city with their hard work, motivation and exemplary creativity and mind it it is all without any organisational support. One must visit the place with open mind to admire the beauty. Artifacts are available to purchase and remember to park your vehicle on the main road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r350993786-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Awesome Collections", "review": "I am a professional photographer and the black an white pics of Uttarakhand, Ladakh and Tibet displayed in the museum just floored me.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r360542191-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "SOHAM - \"Treasure to Himalayan Culture\"", "review": "I visited Soham Heritage & Art Culture on the auspicious day of Shivratri and the moment I entered this place I felt as if i am in the Heaven, everything their has left me speechless the beautiful Chamunda Peeth Temple the most vibrant place ;Art Gallery the paintings on wall , canvasses, sculptures ; Museum where the Himalayan culture is perfectly portrayed and the most impressing part was Shakti where Mrs. Shukla imparts free education to poor children, She said \"Her objective is to empower girls via education\".", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r354567563-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Heart wrenching ride through our diverse culture", "review": "Displays the spiritual aspect of Himalayas dominating the art forms and visualize the religion and culture of the tribal communities,  their folklore n traditions thru various artifacts. The only one of its kind Centre z a must visit if you are a history buff or keen knowledge gainer of our willfully bygone culture abandoned under the desperate need of modernization.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r364776843-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A very valueable and important place.", "review": "This place is a wonderful and a majestic place. The fragrence of nature is the best parts. Love the museum. I insist everyone to visit the little temple as well....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r316814274-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A JEWEL IN THE FOREST", "review": "Amazing collection of artifact. A journey full of passion to create a world of art, craft and creativity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r361986765-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 3.0, "title": "Only for art lovers", "review": "Only recommended for avid art lovers. Mussorrie has many good scenic points like company garden and lal tibba", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r317251598-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "MUST experience n see!", "review": "welcomed by the owners we marvelled through the private tour of this amazing place, learning so much! The organisation works to keep the soon perishing traditions of the himalayas alive and helping those in need through social empowerment. The owners knowledge vast on the Himalayas art n cultural heritage while being super nice people who´s aura you can feel...positive vibrations of love n light! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r325216048-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Inspiringly wonderful", "review": "We visited the Heritage and Art Center during our Visit to mussoorie in Oct'15. The hard work, research, creativity, knowledge and more than everything, hospitality by Sameer Ji and Kavita Ji was simply wonderful. We came back as enriched souls and rejuvenated for the next chapter of our lives.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r324588610-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 3.0, "title": "Uttarkhand's art and culture", "review": "Its a nice place to visit to review uttrakhands culture and art. To see mussoriee from inside one should not miss this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r328914842-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Very Special for Art Lovers .", "review": "It show cases Himalayan Culture & traditions through paintings, Murals, Sculptures, Artifacts &  other Art forms.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r329927711-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Art work at its best", "review": "After seeing so much recommendations on Trip Advisor, we visited Soham Arts and it was really nice. Its difficult to locate the place and dont venture it at late evenings at it tends to be really dark. We needed to walk down a narrow lane to reach this place.Please do call the owners before you visit them. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r332058949-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "GREAT PLACE FOR ART LOVERS", "review": "This gives me a great pleasure to introduce “SOHAM Heritage & Art Centre” for the Art Lovers and the people who are interested to know the ancient culture of villages of Himalayas through paintings, sculptures, valuable collection from the interiors of villages of Himalayas. Very precious collection of rare photographs. Both Mr. and Mrs. Shukla are doing marvelous job, they are also teaching under privileged girls. May GOD Bless them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r344292471-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Feel of Himalayas ", "review": "Visiting this museum made our visit to Mussoorie complete .One can see the effort and dedication in ever corner of the premise .Whole place is dotted with art work in stone , frescoes and sculptures .Taking home some very good memories  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r343947576-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "amazing place", "review": "my visit to mussoorie remained incomplete had i not been to soham museum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r343233578-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "osm place to visit", "review": "it is osm place to visit .... love to be there ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r299044086-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A hidden treasure", "review": "We have been thinking to write this post for long and finally got to do so. Soham was one of the attractions which we had in our list of attractions in Mussoorie and we are glad we made it. Its truly amazing to see how self made the couple is .The heritage center is really refreshing, the whole atmosphere is calm and serene. They have a small museum unit where they have collected various musical instruments , jewelry , wardrobe, vessels and many more things of the local culture. The painting exhibition was really beautiful and the wall paintings depicting various ceremonies were also amazing . We got to learn and understand a lot , also we were amazed to see how this couple was so dedicated to their dream.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r312112514-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A labour of love", "review": "It's so refreshing to see someone walk on the path they really feel pulled to. Mr. Soham - the owner of this establishment - is one such daring entrepreneur. He's figured a way to build this ashram of the arts in the middle of the hills and put in so much love into making it what it is. The love and labour but into this place shows. In fact it is overflowing with it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r302346526-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must visit place", "review": "One of the place one should visit in Mussoorie. Unexplored on this hill stations map. Our chauffeur suggested us to visit this place and it was worth it", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r307542855-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Truly inspiring!", "review": "We visited SOHAM, and it was truly a beautiful experience. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r307000909-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Serene views and good tea", "review": "It takes a while to find the SOHAM Heritage and Art Centre. We followed Google Maps but we weren't quite sure until we reached the gate that we were there. It is a long walk, downhill from the Picture Palace Bus Stand and then further down past a sign indicating the museum. Since it is a private residence, it may be difficult to ask locals. The slight difficulty in locating the place was more than made up for the gorgeous scenes from the house - it is surrounded by a protected forest area and the terrace offers views to Doon Valley. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r306197047-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Different Experience ", "review": "Visited the place,  rather this not so conventional museum only due to trip advisor.  Never regretted the decision.  A great place to be. Different experience.  Kudos to the couple who runs it.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r315374168-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Dedicated love", "review": "SOHAM heritage and art centre is kocated near picturepalace mussoorie.this centre have beautiful collections of the himalayas , which is being maintained by nice couple for the nice cause.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r315530462-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Visit to the SOHAM Heritage and Art Center", "review": "This museum was small, but incredible with a super tour from the owners.  It was incredibly difficult to find but well worth the effort. It is located down the mountain from Mussorie center and should not be confused with the Mussorie museum \"next to the old clock tower.\"   Wonderful artwork, photos, and other native items.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r315937720-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "MUST VISIT", "review": "Sameer & Kavita the owners of the centre are highly passionate about preserving Himalayan art & culture and have done incredible work and continue to do so relentlessly. We had gone there for 30 mins but spent more than 120 mins. The paintings, photographs, artefacts, creations of Sameer, etc are all unique. Like their work, their commitment and sincerity towards the cause of art and cultureis highly infectious, and so was the ginger & lemon tea which they offered us. God bless them. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r315755669-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Must See", "review": "I think everybody should visit this place and meet the Shukla couple......... awesome people they both are and the work they are doing for the students there is so inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r282285730-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Eternal Peace", "review": "The efforts of Mr. Sameer and  Dr. kavita is highly recommendable. Truly a lifetime experience, must visit place. surely will visit again n again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r282516250-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A New Experience", "review": "This place adds all the beauty that may be lacking in your trip. The couple is too dedicated I must say. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r283040659-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Great place", "review": "This is one of the great places to visit in Mussoorie. There is beauty, creativity, and spirituality in that place. All aspects are delightfully explained by the wonderful couple who live and breathe art.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r283587392-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "A beautiful insight", "review": "It is a very famous place there and indeed a great center of art in all true sense. Where other then Mussoorie can art be more valued and heritage be more significant !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r285351069-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Deep Experience", "review": "If you are even slightly spiritually inclined then visiting SOHAM and spending some time there is a must. Spending time with the people who run the place is even better. This is a special place with a deep vibe of its own. You can feel the nurturing care that has gone in its creation. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r284627807-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "A great effort by owners, a unique experience for visitors", "review": "We walked around 4km from the mall road to reach Soham. While walking in Mussoorie's awesome weather is a treat in itself, we were delighted with the experience at Soham.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r292908128-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Wonderland in Mussoorie .", "review": "Soham heritage and art is the  place for people who are fond of art, keen to know about the cultures and want to experience adventure related to art. In other words, its a perfectly designed Himalayan  museum. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r253612917-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A must visit place", "review": "Nestled in the thick woods, SOHAM art gallery is a star attraction and a must visit place in Mussoorie. The gallery is situated about 3 kms. down the hill from Picture Palace. Dedication and hard work of  \"Kailashi\" Sameer and his wife, the owners of the gallery, who have built this gallery brick by brick is visible everywhere. It has great collection of paintings, photographs, jewelry and household articles. Each painting depicts the tradition, art, culture and the lesser known rituals of Uttrakhand . The photographic collection is nearly 70 years old and has beautifully captured the Kailash Mansarover, silk route and life of Tibetans at that time. Everything there is a visual treat and a sort of spiritual journey.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r294719420-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A unique must visit place in mussoorie", "review": "Enjoyed viewing the old photographs, paintings and artefacts, all of which are related to Himalayas. Detailed information of the same provided by the owner adds to the charm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r296029331-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Excellent Arts Display in Mussoorie", "review": "Soham Heritage Centre is the commendable single-handed effort of the care-takers, Mr. & Mrs. Shukla, and hats off to this wonderful couple for what they have done. People interested in Indian arts and culture should not miss this place. Very impressive collection of Indian heritage and arts on display here,personally collected and painted/sculpted by the philanthropic husband-wife duo. This is one of the most impressive and interesting tourist attractions in Mussoorie, and all should be done to promote this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r263422148-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must visit. Bit away. Ask for Chandi Devi Temple", "review": "It was really a task reaching to that place But all the pains worth a visit. Mr and Mrs Shukla themselves are pleasing and inviting to there meuseum, Temple and their Nice premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r263983020-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Culturally and Artistically Enriching", "review": "The SOHAM heritage & art center was easily the most interesting place that we visited in Mussoorie. If you do plan to visit, please do spend some time talking to Mr. & Mrs. Shukla (two very hospitable people) who have left their previously average lives to pursue something far more interesting. The art was enchanting and the place overall gave off a very peaceful and good vibe. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r246030222-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A must visit", "review": "- This is a private heritage and art center maintained by Mrs and Mr Shukla. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r273913934-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Himalayan Heritage!", "review": "Great place to see and learn about Himalayan artefacts and culture. This is definitely a must see place. We visited Soham in May 2015. Mr & Mrs Shukla were excellent hosts and showed us around their property explaining all of their work over the past 17 odd years! Listening to Mr Shukla talk about his adventures is indeed thrilling. They have been collecting artefacts from around the Himalayas - most of which are either close to being lost or probably lost already. They also have paintings that are a must see! They have collected valuable items as well as turned scrap into beautiful works of art! The property is located a little below the main road, so if you use Google, go farther than actually located and then you'll have to walk downwards for about 10 mins. Ask direction to the Sai baba temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r269917856-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Incredible Mussoorie..", "review": "Art galleries and museums have their own glamour. But what makes them more attractive depends upon the efforts of its care taker. Soham is one of the best examples of highly maintained art and culture museum. The credit goes to Mr sameer shukla and Mrs kavita shukla. The museum has a collection of beautiful paintings , statues and traditional things, made by Mr and Mrs shukla. This is worth a visit not only for the artwork but also for fabulous view you'll get of beautiful hills of Musssoorie. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r254809600-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "That one sole reason that is enough to visit Mussoorie", "review": "This visit was an official trip to Mussoorie but I had a chance to club my family along, which made my trip to this place even more special. The magnificent yet simple artistic paintings depicting Himalayan cultures and traditions, truly marvels one's eyes. The art is so beautifully captured through canvas paintings, sculptures that one may be inspired to pay a visit to the Himalayas at that instant! This heritage site has been developed and maintained away from hustle-bustle city of Mussoorie by Mr. Sameer Shukl and Mrs. (Dr.) Kavita Shukl. It is an ideal place to spend an entire afternoon gawking at the wonders of art. The couple is warm-hearted and invited us over for tea and gave us an insight as to why have they have even built this place. There was passion as well as calm in the manner they spoke. The best part is that all the paintings are hand crafted by the couple. Collections are humble and gives a feel and insight to the Himalayan culture. Also, close by, the couple maintains a devi temple and the devotees are free to offer their prayers in their own way. It has now begun to gain popularity but they wish to maintain their ultimate reminiscent, sanctum sanctorum inspiring more visitors like me.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r275187281-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Peace of mind is more than everything!", "review": "All of us have a busy and hectic life these days and yes we all need sometime to relax sometime to let go sometime for ourselves and all we basically need is peace of mind. This place gives you that in abundance. The art and culture is spread all over. Calm place to sit, relax and have a cup of tea. True significance of culture. A must visit place in the queen of forest Mussoorie. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r213450724-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 3.0, "title": "ok mueseum", "review": "not a must visit. but yes would do. owned and managed by a couple. the place is serene and beautiful. the paintings that are on sale seem to be exorbitant. other nick knacks can be bought as a memento. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r277424839-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Spiritual and serene place, MUST VISIT!!", "review": "If you are looking for some quiet moments with yourself or your loved ones, a break taking view of the Doon valley, within the woods with an inspiring art centre, an amalgam of all that and a love filled family who has created this with their own hands... if you are missing those sparks of vitality and creativity in your life .....think again... this life has so much to offer and this place is a must visit in your life. I felt as if I had entered a dream land when I visited this place... :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r213258013-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "An experience like never before - Journey through Himalayas", "review": "Amazingly created and managed place by Mr and Mrs Himalayan Sameer. The gallery was a bit difficult to locate initially but we reached the place in time to view the sunset and the Himalayan history. Every artifact is a unique creation by the couple themselves and is enough to amaze you. The thing which we liked most is the enthusiasm by which they explain everything and never get tired. Will visit the place again and hope to find more masterpieces.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r277176954-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Must Visit place...", "review": "A couple has opened this art center. when we visited this place, it was closed but some how, we met their mother, and she had shown us that place with so much interest. each and every painting was made by the couple themselves. they are teaching some of the poor children also. all of the paintings are depicting garhwal culture. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r214503159-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Peace! Nature! Life! :D", "review": "Amazing place!!! beautiful ,stunning!totally out of the world place!!! beautifully made!!! A divine place!!! words fail to express the beauty of this place!! located a lil away from the busy hectic city somewhere really close to nature! This place is nothing less than a Treat for all the city people who want some peaceful moments to spend with their family or friends!! Beautiful handcut sculptures take away your breath! Started by a couple this place takes us close to nature within a few minutes!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r215121648-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A Place Worth Visiting", "review": "If u r interested in a variety of historically significant local artefacts and tales with wooden cravings all around, this place is a gold mine and well worth a visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r215502484-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Very special!", "review": "What a beautiful place!  Our family recently visited Soham Heritage Centre from the United States.  We appreciated the beauty, hospitality and unique special quality of the centre.  Congratulations to Mr. and Mrs. Shukla for envisioning and creating such a divine home in the Himalayas!  My daughter particularly liked the paintings and my ten-year-old son thought the whole place was \"great and interesting\".  We learned a lot about local Garhwali culture as well as Hinduism in general.  We were given a personal tour and so appreciated what we experienced.  We hope to go back again!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r220379932-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A divine place", "review": "Soham heritage and art centre is an inspirational project showcasing Uttarakhand's traditions, culture, and heritage which is unfortunately slowly dying even in the remotest areas of the state. Mrs. & Mr. Shukla have been collecting and preserving for years whatever little that has been left in the name of art and culture in Uttarakhand. Besides the art gallery which has a collection of paintings depicting Uttarakhand's rich heritage and spiritualism, the couple conducts remedial classes for the underprivileged catering to 50-60 students of age groups 6-17 years and also counseling/funding some of their higher education dreams. There is definitely a divine intervention which has led to foundation of Shakti peeth ( Chamunda devi mandir ) within the same complex by Mr. Sameer Shukla several years ago and is also fueling all these charitable  ventures. Tourism department of Uttarakhand and other states should take a clue from this and help/assist/promote 100 such Soham's across India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r217917854-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Good Stay", "review": "What a beautiful place! Our family recently visited Soham Heritage Centre from the United States. We appreciated the beauty, hospitality and unique special quality of the centre. Congratulations to Mr. and Mrs. Shukla for envisioning and creating such a divine home in the Himalayas! My daughter particularly liked the paintings and my ten-year-old son thought the whole place was \"great and interesting\". We learned a lot about local Garhwali culture as well as Hinduism in general. We were given a personal tour and so appreciated what we experienced. We hope to go back again!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r237249977-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Divine experience", "review": "My trip to mussoourie was not only satisfying but also memorable and the one which made it so special was a place named Soham Heritage & art centre. There are things which are seen to be believed, soham heritage & art centre is one of them. 10 feet tall ganapati greets you at the entrance followed by an awesome view, you not only treat your eyes with beautiful sculptures & pictures but also you get some great knowledge about art and spirituality. Natural beauty enhanced by spiritual ambiance makes it a divine experience. A must see place in mussoourie. 5 stars and two thumbs up. Big thanks to the owners.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205920554-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A Great Experience", "review": "SOHAM heritage and art center blends Spirituality and Art in a sublime way. Weather it be the sun chariot high up or it be those beautiful mosaic artwork on the wall. I liked the way the pieces were arranged in a Rhythmic manner and show easy transitioning throughout the whole centre. I feel the paintings really capture the very essence of Himalayan Culture. The museum plays an active role in promoting cultural and art developments, exploring new patterns for art museums in the context of the contemporary society. You also can be intellectually stimulated by these amazing works of art. They even have some awesome murals and statues. I have never gained so much of insight to Himalayan Art and Culture. I have been to many art museums around the world and this one particularly stood out as its style and themes were different then others. The pieces that stood out for me were the Mystic Collection pieces which just soothes your mind when you look at it and the creation which is and oil painting. This place a definitely a must visit and I recommend it. Kudos to the great artist Mr.Sameer Shukl for promoting Himalayan Culture in such a unique way.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205638584-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "Good place to spend some time", "review": "Overall good place to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r239826801-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Mecca for the artists!", "review": "Mr. & Mrs. Shukla is an inspiration for any artist who plans to give up the glamorous life in the big city for an austere but a meaningful one. I visited the place a few months back and was spellbound by the beauty oozing out of every nook and corner. Mr. Shukla showed around the whole place and told us the story behind every article beautifully conserved and created there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r242377701-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "abode of peace", "review": "on a recent visit to mussorrie i learnt about this place from a local.i decided to visit the place &", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205987637-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "An enchanting experience", "review": "My visit to Kashi Devasthanam and Soham Art & Heritage Centre was truly an amazing experience. Though I have visited Mussoorie many times and always loved its divine natural beauty but visiting this place gave me an opportunity to explore the cultural heritage of Himalayan region. Since it is located away from the hustle bustle of city life, one can find here the perfect confluence of natural and aesthetic beauty  of Himalayas.The Art Gallery and the Chamunda temple were my favorites. Its a great effort to preserve  and  promote the uniqueness of the culture of this area. Its a must go destination for art lovers and tourists. Looking forward to visit it again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r208127657-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Art centre worth a visit ...", "review": "Hi friends ! Incase you are planning to visit mussoorie, then you ought to visit Soham Art Centre especially it younare an art enthusiast and having an inclination towards seeing centuries old himalayan culture and tradition, mediation, yoga etc then Soham Art centre is a place not to miss at mussoorie. As an amateur artist, i learnt a lot visiting Soham Art Centre repeatedly and interacting with Dr. Kavita Shukla, an inspiration behind the centre. Viewing paintings one feels as if he is actually interacting with them. The whole ambience and panoramic view of the Doon valley from Soham Heritage & Art Centre is bewitching.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r206473867-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Very interesting setup", "review": "Nice place with great local art..showcasing himalayan culture and traditions..1km before mall road..we visited in the evening slot and the overall experience was nice", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r209351290-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Amazing place", "review": "This place is owned by a couple who dared to get out of corporate rut to pursue their love for arts.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r210246311-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Peaceful and unique place", "review": "Soham Heritage & Art Centre is a great place. It could even be called local museum. You should really have to visit it to get some insight into the local Himalayan culture. It shows you a collection of local art, paintings with Himalayan motives, handicraft, musical instrumentes throughout the history, and there is even a temple, which the couple built by their own. All is made by a couple, with a lot of commitment...So really a must. It can be accessed via the Karma Vilas Resort, about 1 km down from Mall Road", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r211598238-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "A rare glimpse of himalayan art and culture", "review": "Close to the crowded mall-road in Mussoorie, there is this peaceful place with one of the best views of the Doon valley and a rare collection of himalayan paintings and art work. It felt like a different world when we went to this place of traditional himalayan aesthetics. It felt like I got an insight to the age-old himalayan-culture. It gave me a spiritual uplift to visit this art gallery and a temple with a peaceful place for meditation among the oak and deodar trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205059248-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 4.0, "title": "A must visit for every art and culture enthusiast.", "review": "We stumbled upon this gem of a place in terms of art and culture on our last visit to Mussoorie. It has terrific location, away from the humdrum of the mall road at the same time at a walking distance from it. It has a wonderful display of paintings, artifacts, sculptures etc. The owners are great hosts and can guide you around the place. This place is a beautiful insight into the history and art forms of the mountains and the local people there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205141444-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "SOHAM Heritage & Art Centre", "rating": 5.0, "title": "Amazing Art Amazing People", "review": "The place is just wonderful with the best view ever and the people are more than friendly, the beautiful different cultural  paintings and art work they have are so good , there is a hotel there which I really recommend it .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d6582665-r205215713-SOHAM_Heritage_Art_Centre-Mussoorie_Dehradun_District_Uttarakhand.html"}]