[{"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "SPIRITUAL", "review": "Temple of Lord Shiva inside a cave where there is a drop of water falling on Shivling continuously. It is believed to have never stopped. People who have back spasms or spinal issues should avoid visiting here as one has to bend and walk a bit through the cave also to reach the temple you have to descend a few flight of stairs . There is also a Vaishno Devi Temple accross a shallow stream of water and a huge statue of Lord Hanuman. One can typically spend an hour here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r631498210-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Serene and Spiritual", "review": "Takeshwar Mahadev Mandir is a Temple of Lord Shiva who is also known as Mahadev. Tapkeshwar is a Hindi word and this temple is so called because water is falling on Shivalinga continuosly. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r633577803-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "A complete package!", "review": "This Temple is built in caves & cavities under the hills. Beautifully structured, the hugely expanded temple is a place to spare some time. The river, the bridge, the caves....almost everything is fascinating & soothing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r645814736-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Jai Mahakaal", "review": "This is a nice temple in an ancient cave. There are other small temples adjacent to it. Very popular place and is crowded on holidays. Ample parking available. Stairs might not be comfortable for physically challenged and elderly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r651635017-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lord Shiva's Temple and a beautiful Place", "review": "Tapkeshwar maharaj is one of the most peaceful place to visit in Dehradun. We were amazed to visit the cave it has a small entrance and its a bit narrow cave. There is a waterbody as well inside the temple premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r651635921-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Blissful", "review": "Temple is set up in a brilliant landscape. Please pay visit to the sadhus who meditate inside the temple and seek their blessings. Must visit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r658000642-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Delightful Temple Must visit", "review": "Amazing. It is a temple spread over a long stretch. Is very beautiful There is a huge statue of Hanuman ji, which seems very attractive to see. The atmosphere of the temple is quite peaceful which gives peace to the person's spirit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r659406609-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Tapkeshwar Annual fair", "review": "So here it is, the much awaited spring fair at tapkeshwar temple in the occasion of Mahashivratri. This annual fair lasts for around 10-12 days to mark the importance of Mahadev. The fun fair has many exciting things attracting all the age groups and people from all walk of life. For me the most exciting part is different jumbo rides. Apart from rides there are numerous stalls for garments and other merchandise, there are food stalls and other shops. If anyone happens to be in dehradun during this period of the year then you should definitely march to this spring wonderland. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r658359357-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A good place to Visit", "review": "Tapkeshwar Mahadev Temple, is one of the most famous temples dedicated to Lord Shiva. Situated by the forest side, the main Shivaling at the temple is inside a natural cave. Water drops from the ceiling of the cave trickle down over the Shivaling", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r635137804-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Clean temple", "review": "The temple is around 50-60 stairs down the road. Lift facility created however found no way to access it.  Constant water is dripping on the Shivlinga.  There is another Shivlinga totally covered with Rudraksh. There is also a small River passing in between temple however the water level was low and also dirty.  There  is huge Hanuman Statue also two caves are created one for Mata ji and other for Shiva ji.  Temple Premises is divided into two parts by River,  connected by an iron bridge.  The temple premises is clean and well maintained", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r661019943-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Good place", "review": "Good place to visit. Nice and calm place. The best way to reach is taking an auto, as cab may cost double. Located around 5-6 kms from central city area. Recommended for families travelling to Dehradun", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r592699876-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "old temple", "review": "temple in a natural cave,unlike some other famous temples, this is well maintained .good to visit .on a rainy day take precautions as steps may turn slipery", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r594690357-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Ancient Temple", "review": "A temple doesn't require ratings but it is good to know about the facts.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r606998776-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Water dripping at Sivling.", "review": "Visit to Tapkeshwar (cave temple) is a unique experience. Thousands of pilgrims visit this temple round the year to pay homage where they can see water dripping at Sivling. Though to visit this Shiva temple, you have to negotiate narrow roads, but it is worth.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r613745191-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice visit", "review": "When we were in dehradun, it was just a one day stay, so we decided to do a handful of places. After visiting Guchhu Paani, we went to Tapkeshwar Mandir. Dedicated to Lord Shiva. It was a beautiful Temple. Lots of smaller temples. Only negative was the water flowing in front of the temple was stagnant, so it had become very dirty, thus giving a very dirty feeling. If they could clear it, it would be such a picturesque Temple. All in all a good visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r616208366-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "A spiritual yet worldly place for all kind of persons!!!", "review": "Unlike a traditional temple with one single building with one sanctum sanctorum, surrounded by Antarala, and chandra shala, this place is build around rocky caves and its a unique experience to go with a different path and set of small temples located in and around the caves. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r616396093-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Jai Shri Tapkeshwar Mahadev", "review": "First thing to know that, its a Hindu Worship Place and one of the most famous temples dedicated to God Shiv. The beauty of this temple is that Shiv Linga is situated naturally inside a natural cave.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r620678134-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Har har Mahadev", "review": "Must visit Shiv temple for its beauty, uniqueness and natural beauty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r627143397-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice Temple", "review": "Simple & good place", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r622049922-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Good place", "review": "Shiva Temple, Tamsa River water flowing, Good Ambience and very clean place. you have a good time there", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r627622405-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Natural cave temple", "review": "It is a natural cave temple where water drops on the Shivling naturally. Though inside the temple you will find peace outside temple it has been commercialized. There is a lift which take senior citizens and small kids in it and if any other person wants to go they charge Rs 50. This is insane asking money in such a holy place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r573728486-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Natural Place", "review": "The Temple is located within a cave which is characterized by naturally dripping water over the Shiva lingam placed here. The cave is also the site to the shivratri festival that happens every year.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r578750347-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Nice temple", "review": "Had a heard a lot about this temple and d mata vaishno Devi cave here. Finally wen in Dehradun we went here. It's a big temple with various sections and a water body in d centre. I wish they cleaned and water, it would make d temple much more beautiful. Anyways, spend 45mins here. Visit every shrine, sink in d spirituality. Around 6km from Dehradun,it isn't too far so don't miss it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r579164244-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful place", "review": "Its a beautiful place. Legend has it that rishi Dronacharya did tapasya at this place, this place is also the birth place of Ashwatthama and he also got the boon of being Amar at this very place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r581629961-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice Temple", "review": "It is nice temple to visit on the Dehradun visit. It is a big temple and various sections in the cave part. There is a small river also flowing along side.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r581897057-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Awesome cave temple ", "review": "The approach to the temple may not be so convenient and clean, but once you enter the temple, you can feel positive vibes. There are a number of steps. However, if you approach from the side of the main gate, you will find a way with slope and less number of steps.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r584118849-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Tapkeshwar ", "review": "Can visit anytime in the day and afternoon. very quite but it's too hot to travel. very far", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r585594098-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Temple in calm place", "review": "Tapkeshwar temple in dehradun is a must visit if you are in dehradun. Temple  at calm place with picturesque location makes it a perfect destination for natures lover. Parking os available here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r588540319-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A unique historical  cave temple in Dehradun", "review": "In Dehradun, visit to cave temple is a unique exhilarating experience. Recommended for tourists to find time to visit. Although the approach road to cave temple is not that convenient, but one you are there the Lord Shiva temple located in narrow beautiful cave with water dripping from top is a soothing experience to relieve your stress and fatigue. The temple is open whole day with no entry fee. Parking is available. Better to carry your own water and snacks, avoid eatables sold there. Maximum an hour is sufficient for visit in around cave temple. The journey time to and fro Dehradun city may take another one to two hours.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r591146069-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Soothing view", "review": "Well unlike many i go to temples just to visit it and to see the structural engineering. to my amazement i really enjoyed this place. It is under a cave where you have to go on foot, everywhere it slippery as the water was flowing inside the cave. i do not have any idea where it was all coming from but surely it was one breathtaking moment and an experience altogether. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r591643147-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Very Spiritual and Great Feeling at Temple we experienced", "review": "Visited Tapkeshwar in the noon. Really Great place to visit Spiritually and Travelling purpose too, this place holding more than 5000 years of history. I was so imaged to meet few people with the unexpected experience they met on this place and felt blessed and so much in peace of there life. Loved it and went twice when I was traveled last month.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r543078996-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Different", "review": "The temple is a cave. But the walkway is cleanly laid out in marble. This I found quite convenient. There is a fresh feeling once you enter, though restoration and construction work is going out outside. Clean stairs or steps go down to the river, which, alas, had scanty water as it was winter and slightly unclean. There is a nice Hall or open mandap next to the river, which should be very interesting in monsoons, when the river would be more turbulent.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r547281921-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Popular Destination", "review": "I went to Tapkeshwar Temple. One of the popular destinations in Dehradun, Tapkeshwar Temple is one of the most visited temples in the region. Residing in the lap of gentle green mountains, this destination is thronged by young travellers as an unlikely but ideal picnic spot as well. It is great place to go.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r549486684-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "PURIFIED SOUL ", "review": "Best place to get divine and picnic it's both. Before coming to it you have to cross Doon School & Garhi cantt . Place where Tapkeshwar Mahadev Temple is situated it's really awesome. A must to visit it's only 13km away from Dehradun Railway Station and you can get Auto at very reasonable rate. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r551706123-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Religious and exciting", "review": "It is one of the best-located temples I have come across. It is wide and authentic. It has real based story and you can relate. It is on both the sides of the small river and makes you feel excited and calm. I would definitely recommend this to everyone to got and visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r560654022-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Temple to Lord Shiva", "review": "Visited this place last time with friends. It is a pretty place, but it used to be prettier still before all the construction work happened. A lot of the natural beauty has been lost. Overall, a good place to visit and pray. It is a \"swayambhu\", i.e., the sivalingam is a natural one, and is fed water by the mountain streams. During Sivaratri, earlier there used to be a major rural fair. Not sure if it still happens.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r557877449-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "A temple of ancient significance", "review": "Supposed to be the place where Dronacharya meditated, this temple can be dated thousands of years back in history. Located near the banks of river, one can well imagine how this place would have looked like thousands of years back and thats the reason perhaps Dronacharya chose this as place to meditate.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r561637805-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Genuine cave temple", "review": "This really looks like a genuine ancient cave temple where you need to bend to enter. There is natural water dropping on the Shivling constantly which is nature's way of 24/7 abhishek. It has a lot of steps so the elderly may find it difficult but it is a different temple than any that i have visited so far. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r570062512-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Jai bholenath", "review": "Visiting tapkeshwar ji temple is another must do in dehradun. So magnificent is the Swayambhu idol that one can keep watching for hours together. A divine feeling. The approach road us narrow so better take a small car. Parking is available. One has to walk 50 to 80 steps  so be prepared. Do visit dronacharya s temple also. Relive mahabharat times. A great experience. Jai baba bholenath ki. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r570624516-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Darshan Tapkeshwar Mahadev", "review": "Such a blissful and sacred place of beautiful natural cave near a water stream which is said to be there from eras. Inside the cave there is a shivling on which water droplets fall naturally..u won't see any leakage of water in whole cave except the place above shivling...which creates devotion among people...and it got the name Tapkeshwar Mandir in Hindi means eeshwar par paani ka tapakna...it is believed that God Shiv taught dhanurvidya (archery) to Guru Dronacharya..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r571402048-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Peaceful!", "review": "Nice temple within the caves with a natural shivling. Just right outside is the river flowing. One can just soak his/her feet in the water and sit for a while! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r526984496-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Awesome experience ", "review": "When you will reach this place then you will find that the temple is different from other Hindu temples, there is no fancy looks but it is beneath a mountain and water drops from mountain bottom makes it really different experience. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r529047875-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Nice Place to visit with family", "review": "We went to this temple during our visit to Dehdradun. It's a nice temple and must visit if you are in the city for a tour. It would be advisable to take a hired auto/car as getting it from the temple (while returning) might be difficult at times. The place is excellent with the actual temple located in a cave. There is a small river just beside the temple. It might be crowded at times but we were lucky to be in a time when there was no crowd. Keep 30 to 60 mins time for this location depending on the crowd.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r530418557-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Amazing temple ", "review": "Saw this place on Trip Advisor and so we went to see it.  It was amazing a hidden temple in Dehradun very close to our hotel.  So glad we went very peaceful place of worship. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r534923265-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Lord Shiva's temple in a natural cave with water trickling from the top on Shivling", "review": "A popular temple inside a natural cave that can be reached after descending 200 steps, desicated to Lord Sbhiva. The water keeps trickling continuously from the ceiling on the Shivling, hence the name Tapkeshwar. Temples of Vaishnomata & other Goddesses in the vicinity. A rivulet adjacent to the temple is worth visiting. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r535092076-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Har har mahadev", "review": "i have been going from my childhood to this temple.. the compound has been growing eversince. , nice peaceful divine feeling.. with the river flowing by..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r535266843-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Positivity in the air", "review": "Reached the temple in the evening and the atmosphere around the temple was so soothing and full of positive energy that we spent whole our evening exploring the temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r536181683-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautiful & divine - the place of the Shiva", "review": "This is one unique place near to the city of Dehradun. the temple is located on the banks of the river asana, a fast flowing river. The temple is very unique with the statues located inside the cave from where drops of water keep dripping thereby giving it the name > temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r540718981-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Unique temple under a cave", "review": "This old unique temple is under a cave. The water from the cave continues to drip over the Shiv Ling... the belief is that once the water dripping stops a major catrosphy will happen in the world. One has to walk down many many steps to reach the temple and after Darshana climb up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r541986072-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must", "review": "Not advised to go during rains.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r499976627-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Temple visit.", "review": "Tapkeshwar is unique temple of Shiva under the cage. All the time water is coming in the temple drop by drop. The temple is quite peaceful and river is flowing along with makes this temple more beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r501469636-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Faith and beauty", "review": "A beautiful temple near Garhi Cantt. You have to bend before entering a spacious cave. The insides are large and spacious and the sight of the Shivlinga with water dropping naturally is beautiful and easily accessible. Be careful of the slippery tiles, though. The cave is situated slightly lower in the river valley hence people finding climbing stairs difficult should consider that. Area around is being developed and would be a nice pilgrimage point once completed. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r501763434-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Oldest Shiva temple in Dehradun", "review": "Tapkeshwar temple in Dehradun is devoted to Lord Shiva, it is one of the oldest temple in Dehradun, it got it's name Tapkeshwar from word Tapke which means drop in Hindi, so temple is inside caves which use to have said that in earlier days drop of water use to continuously pour over Shivalingum from the caves, even today you will find it. It is also believed Guru Dhronacharya also lived there and did meditation during his early days, thats why dehradun is also called Drone City.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r503769404-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Tapkeshwar temple", "review": "Is inside a cave like structure and the water seepage from the cave roof falls on the Shivaling and hence the name.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r506362852-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Subdued Holiness", "review": "Tapkeshwar temple is by the side of a river and a very old temple. Powerful Shivalinga is there, A cave like formation is there. The linga is Suyambu. A must visit Holy place in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r510074323-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Religious place", "review": "It is an aweome place to vist.The best part is the bridge over the river and the flow of the water stream was very fast so be carefull.The temple on the otherside of the bridge was very beautiful and the view when you stand at the middle of the bridge was very good.A must visited place in the dalhousie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r514142214-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lovely temple with vaishnodevi tunnel.", "review": "This is a religious place where you will find all the gods at one place. The infrastructure is old and under renovation. The best thing I liked about the place is Vaishnodevi tunnel where you need to scroll from one point to another.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r518385771-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Om Namah Shivaya - Nature and spirituality entangled", "review": "A place to see how nature and spirituality are entangled. Dripping water on Lord Shiva inside this cave Temple is a testimony for spirituality. Clear water flow under the bridge is a sight to capture. Vaishno Devi cave and Hanuman Temples are the attractions in this beautiful location.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r520734675-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Superb temple  ", "review": "This temple is one of the good temple to visit in dehradun! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r525903496-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Religious and full of harmony ", "review": "If u want really want to meet God must visit this place... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r472416861-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Cool and Serene ", "review": "This Tapkeshwar Temple is a very nice place to attain peace of mind and spend some quality time with family members", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r472441666-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "The temple under the rocks", "review": "This is very very old temple situated in dehradun.all the temple made under the rocks.you got completely piece of mind there.here guru Dronacharya son Ashwathama tap here for siddi.you can feel the relation of soul and god here.prey with clean heary will be fullfill.must see if you are in dehradun", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r473657166-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Ancient temple of Lord Shiva", "review": "One of the very famous temple in Dehradun, dedicated to Lord Shiva. The main feature of the temple is the dripping of water from the seepages of the hill in the temple is located, and thats why the name Tapkeswar. Plan to visit in the Aarti time at after 6PM inthe evening while the lord is decorated with flowers etc. Worth visit while in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r474491533-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "*** Well That Was Quite Different! ***", "review": "I had been here before but decided a return visit was in order.  This time I was not swayed by Lord Hanuman and set off to locate lord Shiva n the Shiva Ling underground.  Wow  what  a unique location that is.  You cannot miss the river and bridge, et cetera.  Some construction and / or restoration work underway but not of disruptive type.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r475752005-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "HOLY PLACE WORTH VISIT", "review": "Very nice place place with historical background", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r481120195-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Religious Place on the Way of Robbers Cave", "review": "If you are going to visit Robbers Cave then you must visit this temple. It has very religious importance. This temple is inside a cave in which shivling is located. There is continuous drops of water which flows on shivling from cave's mountain. We found this place to be really peaceful for mind and soul.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r487636302-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Amazing and sacred place of visit", "review": "We were surprised how the drops are falling from the cave and abhishek done to Lord mahadev. There is this temple surrounded by many small temples.... Santhoshi ma,hanumanji,etc..To have darshan of the Lord, we have to go into the cave where droplets of water are falling on shiv ling.we can give our offerings to the Lord directly. There is no restriction of photography.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r492121970-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Holy place with a different experience", "review": "This temple is set up in quite a peculiar fashion with charm of its own...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r488989941-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A Cave Temple", "review": "Quite near to FRI in Dehradun. Not much frequented but worth a visit. Some ten meters down the parking area the stairs take you to the Tapkeshwra Temple. The dripping rocks and the lord Shiva Shrine enthrall the devout. The Temple is on Asan/Tons river, this makes the location a bit picturesque. A no of ashrams and idols of gods have come up with growing number of visitors.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r498108422-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Spiritual place with scenic view", "review": "Tapkeshwar temple is a cave temple dedicated to Lord Shiva .The temple is located in Garhi cantoment area and it is a very famous temple .It is about5.5 kilometer from the city center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r467094910-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tap Tap Temple", "review": "It's a large and a very beautiful temple. As the name, there is one Shivling on which water dropping continuously - tap, tap, tap... :) There is also a small Vaishno Devi temple, where you have to go from a very narrow and small passage.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r467143042-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Spiritual feeling", "review": "It's Adobe ... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r467249030-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Amazing", "review": "it was amazing to be there, very natural place actually realized the wonder of nature, so cool and silent...  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r468760381-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Dehradun's classic favourite", "review": "Being an atheist dosen't mean I let go of any chance to explore temples which provide a sense of self in life's scheme of things.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r467420861-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Holy place", "review": "Lord Shiva, Vaishnodevi Caves, Water falls from mountain on the Shiv Linga, Well maintained good to place to visit. 5-10Kms away from Main Market/Railway Station. Walk down 100+ steps & have to come back.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r468314363-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Sacred place ", "review": "Sacred and holy place to visit in dehradun. One can find peace and solace there . Situated by the forest side, the main shivalinga at the temple is inside a natural cave. Water drops from the ceiling of the cave trickle down over the shivalinga in a continuous downpour, making for an interesting spectacle. Every year there is a fair too on the occasion of mahashivratri which has many rides and shops and are a source of joy for the people of all ages ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r469029255-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "old and renowned", "review": "At first, you' ve to climb down a lot of stairs to reach the temple . It's not that big but the importance is high. It's bulit in a cave which you'll come to know after entering inside. There's a narrow stream of river flowing near the temple. Just loved visiting there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r470865209-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "amazing place", "review": "amazing place in dehradun district, it showing ling very buetyfull place.enviroment here is very natural.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r469606626-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Spritual ", "review": "The best time to visit this temple is on Shivratri. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r471646713-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar Temple", "review": "Temple of Lord Shiva. Calm and quite. It is in a cave, different type of temple. Near from Dehradun city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r457350805-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Peace of Mind, Jai Tapkeshwar Mahadev", "review": "Temple located near Garhi Cantt.... it is famous for Shiv Temple. Guru Dronacharya also did his tapsaya over here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r455147051-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Holy and Peaceful Place", "review": "I am frequently visiting this place, it is a peaceful holy place. Apart of any special occasion, other time you will it a peaceful place. Recommend this place for visit.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r458009995-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Ancient caves and water salute Loard Shiva here", "review": "An amazing walk and crawl through caves, divinity and the flow of water makes the visit exciting for the devout", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r458248083-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "historical place too", "review": "this is a very nice place during shivratri  a big celebration can be experienced, this is a historical place too ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r459475269-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Natural cave next to a river.", "review": "The temple gets its name from the phenomenon of water dripping from solid rock onto the \"shivl ling\".", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r462617666-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautifully relaxing", "review": "The environment will give you goosebumps. River, cave and beautiful surrounding is a pleasant sight. Its a must visit place if you travel to Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r459480698-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful Historical Temple", "review": "Hello Travellers", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r462943373-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must Visit Temple in Dehradun", "review": "This temple is very unique in itself, shiv ling is inside the cave and water is continuously dropping in it. And adjacent to the temple is a river. All together its make a beautiful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r462655623-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Temple Visit - Bum Bum Bhole", "review": "Its the very old temple situated in Garhi Katt Area of Dehradun. The famous temple got its name Tapkeshwar, because in the cave the Shiv Ling is continuously getting the dripping of water droplets from the top. Earlier it was natural, but now they have made artificial though looks pretty decent as they have not disturbed much natural things.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r445454846-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Shiva temple", "review": "This temple atop a hill has a natural Shiv ling inside a cave, through which water flows continuously. Nearby there is a small river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r463949866-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar Temple trip is a holy trip", "review": "It is situated very near to CP. Once you enter you will be able to see the holy story behind temple. You will get a divine peace. Be careful of shopkeepers in and around the temple. Don't miss the aarti in evening. Also nice place...In mid of hillocks and running river canal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r447408130-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "picture-perfect destination in dehradun city...", "review": "great place for an outing....the cave temple, the huge idols, the river-side bath....an interesting picnic spot for tourists and holy pilgrims alike...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r442432132-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Gr8 Place", "review": "Tall people be cautious as the cave is small. Also the river level can rise unexpectedly so be extra cautious.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r448220815-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great place", "review": "Awesome....Om Namah Shivay location is beautiful. Management is great.........Must Visit for everyone visiting Dehradun", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r450042801-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Devine Forever", "review": "The Tapkeshwar Mahadev temple homes two shivlingas. each these shivlingas aren't man-made and feature come into life naturally. A competition is held right here every 12 months. This competition is called Tapkeshwar honest. It takes place at Shivratri and has tremendous religious significance. The pageant is widely known with extraordinary fervour and revelry.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r451243782-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Divine Forever. Must visit for all Lord Shiva Devotes.", "review": "Natural and beautiful forever. Must visit for People travelling to Dehradun. Beautiful and divine place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r449427108-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Temple Visit", "review": "Located in Garhi Cantonment of Dehradun is famous for Shiv Temple. The festival of Mahashivratri is celebrated with glitz and gaiety. Very popular amongst the locals and the tourists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r453312366-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Very good modernized traditional temple", "review": "Good natural cave temple with modernized touch of human interface...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r454463618-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Ancient Shiva temple", "review": "On the bank of river Tamasa the ancient shiv temple is located amidst caves. Be", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r454606093-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Mahabharata significant Temple by River ", "review": "A very popular temple located some 6km from Dehradun.  It is dedicated to Lord Shiva and a key portion of the site consist of a natural Cave wherein we find a shivalinga continuously soaked by dripping water.  It is said that eons ago it was milk that the gods soured down onto the shivalinga. The temple is entered via a winding marble set of very wide stairs, in need of some soap and water on my visit. At the base as you approach the river, there before you across the river is Lord Hanuman.  A bridge borders the river and makes for a nice vantage point for up and down river views.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r428729647-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Excellent place with divinity", "review": "Very good place with great divinity. We can have \"Sarva Devata Darshan\" here including Lord Bramha. Nice water flow beside the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r430193809-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautiful Place to visit with worship", "review": "Here are unique to see water fall natural from anyway to Shivling and one river cross from near so natural", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r433852519-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Holy place", "review": "Usually a Temple of Lord shiva situated in Ghari cantt.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r430816018-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice place to Visit !", "review": "Its peaceful place ,where Tamsa river is flowing in between temples constructed.There is Lord Shiva temple  .", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r434965371-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Good Place to visit", "review": "Tapkeshwar temple is a cave temple dedicated to Lord Shiva.This place is very beautiful and attractive by nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r440523372-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "The dripping water over the Ling", "review": "There are many small temples around the river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r434597528-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Topkeswar temple & Dacoits Cave.", "review": "Tapkeswar Mahadeb Temple is about 08 kms from the cetre of Dehra Dum (Clock Tower/Rajpur Rd). Deity of Lord Mahadeb is worshiped here. Dakate Gufa or Dacoits cave is also nearby & worth visiting. It was an eerie place earlier when I visited in 1985& again in 2015.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r433969984-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "A Holy place with a differance. ", "review": "I with my wife visited this Holy temple Tapkeswar Mahadev temple on 23-11-2017 at about 3.30pm.This is Lord Mahadev temple in a natural cave where drops of water naturally come down on a natural lingam called tapkeswar Mahadev. There is also a lingam made from Rudrakha. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r440527730-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Temple in peace", "review": "Lord Shiva drinking water is the miracle of this location. It is serene and peaceful and also has a mini vaishneodevi temple along with a small radha Krishna temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r442365451-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice shiva temple", "review": "This religious place is very famous attraction of Dehradun and hundreds of devotees go there to pray and seek blessings of the Tapkeshwar Maharaj.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r410276788-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Har Har Mahadev", "review": "Good, clean place for devotees, nicely maintained, A little bit hepatic in old age, but if you reached garva-griha, pdont forget to meet Assawathama, son of Guru Dronacharya....", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r411288344-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "MUST VISIT PLACE FOR RELIGIOUS PEOPLE", "review": "Though a little away from town as well as from roadhead but a must visit place for all visiters to Dehradun.a picnic spot as well for whole family.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r415767924-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Iike a home", "review": "Just besides my college a temple that is related with the mythology and that Maha Shivratri fair completely nostalgic to be here the time spent with friends...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r412216506-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Ancient shiv temple", "review": "Tapkeshwar temple is situated near garhi cantt.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r420020355-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Lovely Place | Caution: Don't fall in babas trap.", "review": "One time visiting place if you come here with family. Few stairs to be climbed to reach this temple. Dont go if any of your family members have knee problems or back problems. The temple is a beautiful place and a natural spring of water falls on shivlinga from unknown resources drop by drop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r420187353-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Unique in its own way", "review": "People coming to dehradun must visit this temple which is in the heart of the city itself. Temple premise is clean, green and natural which makes it a really good place to spend some time close to nature. From the taxi stand one needs to walk 200 mtrs downstairs (beware of monkeys on the way) to reach the temple. The walls of the temple is the main attraction as it is always dripping naturally and slowly (therefore the name tapkeshwar). One has to be careful while walking as the roof is low and might hurt. Must visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r420704219-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "its a god thing so varies on person to person", "review": "i did not like it much. there is hardly anything there to be enjoyed or watch. if you a god fearing person unlike me, go there just to get the blessings, otherwise no point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r421368527-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Famous for CaCO3 cave , Sulpher spring & Not for Water Sporting", "review": "Its mainly famous for Shiva cave (100 meters approx) which is made of CaCO3 (calcium carbonate or limestone). sulpher spring & I suggest not to be play in that river because shamshaan ghat (cremation ground) is just 1 km above of that spring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r423524396-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Unique cave type temple", "review": "This is in a cave like structure where there is Shiva's lingam and other deities. The walls of the temple is the main attraction as it is always dripping naturally and slowly. You should be very careful while walking inside the temple since the floors are wet and skidy. Will be difficult for senior citizens. There is a temple similar to Vaishno devi temple and has a small cave to enter it. Would be challenging if you have a big personality. One has to be careful while walking as the roof is low and might hurt your head. Must visit if you are in Dehradun and if you are a spiritual person", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r427205035-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice Temple and must visit", "review": "Temple is nice. it has a small river flowing. Lots of statues and dieties. its carved in the small mountain... there is a bridge as well. u can get a feel of vaishnavdevi when u crawl thru to get to one temple.  has mythological importance as well from mahabharatha. liked it a lot. dont go during peak sunny hrs like 12 noon to 5 pm and marble is too hot ...u will burn ur feet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r384544648-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice temple by a stream !!", "review": "A must visit place in Dehradun. Its a nice temple located next to a stream. The premise houses temples dedicated to many deities. There is a huge statue of Lord Hanuman which is the first sight one gets to see as we reach the temple through a passage of stairs. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r384912892-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Little more cleanliness", "review": "It was pretty  nice and beautiful as it was near the stream. I have been to Tapkeshwar many times by now. There were many gods situated over there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r385972843-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Morning visit to lord shiva temple ", "review": "Me,wife and my 2 year old Daughter paid a visit to this holy temple on one of the Sunday morning. This is holy place situated near cantonment area. Lord Shiva lignum is situated in a cave where drop by drop water falls on him from cave roof.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r389940936-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice and clean temple, no rush not crowdy", "review": "It's another well maintained and clean temple near Dehradun. Lord Shiva's temple is inside a natural cave. The cave is clean and marble floored. When we went it was less rush. There are two other temples nearer to it. The River water is clean so is the surrounding. Beware of the monkey while visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r391575827-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "shiva is great", "review": " a great place for shiva worshippers....public transportation could be a problem but can be arranged easily........", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r392548046-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "God in his almighty avatar", "review": "In Shravan Month, I got an opportunity to visit this divine place in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r396177558-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Great temple..", "review": "This is a beautiful temple of lord Shiva..this is a clean place and place for worship of lord Shiva...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r397338548-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Neat clean no pandit hassle", "review": "Ample amount of parking place. Neat and clean place to visit , temple's are made in cave style and river tapka flows with temple's on both side of it.  Replica of mata vaishnodevi temple has been created with goofa etc. Basically temple is shivji temple which is again in a cave.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r399782412-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Excellent place to go", "review": "visit to tapkeshwar mahadev mandir was very good,from outside it does not pretend very good,there were lots of stairs which were not cleaned but when we reached temole premis it was very good,specially cave temple of vaishno devi mata was good", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r373723808-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Family Picnic", "review": "Awesome place for view of different temples with nice view of river. Temples of Lord Shiva, Santoshi Ma. Visit at evening for to see the experience of Arti.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r407699555-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Pleasant and peaceful ", "review": "Very pleasant and peaceful place with small river flowing around .. also famous for mela that is organized here every year during maha shivratri..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r374357663-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "unique temple, must visit", "review": "The temple is unique and peaceful and have several statues and idols of Gods and a small river flowing adds to the serenity", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r377873776-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Old and uniuqe temple", "review": "Said that there is continuous water fall on the SHIV LINGA from mountain but source not know. Place is very peaceful & relaxing. Big statue of lord HANUMAN attracts very much. ready to go down stairs more than 100 steps", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r376967607-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Ancient and spiritual", "review": "Very beautiful spiritual Hindu worship place where Great Shivalinga gets nonstop abhishekam naturally by  \"Tapak\" of water from above hence called tapakeshwar  is  highly vibrating spiritual place  where Rishis did years of penance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r378215689-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Holy place", "review": "visit the holy shiva temple here , its calm ,the shivalinga is in a cave, a flowing river nearby, other temples too, quite nature friendly and  beautiful place ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r383724275-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Ancient Temple out of city crowd", "review": "Visited 8 year back  , that time there was only a single Temple ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r363299626-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tranquile Temple", "review": "The temple is situated in the cave where the Shivalinga is situated and water droplets trickle down the cave upon the linga. There are various other temples of lord Hanumaan, Kaali ji, Vaishnu Devi etc. The Tones river can be seen gushing down and it hosts numerous fingerlings, water snakes and kingfisher", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r383586093-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Good place.. Must visit ", "review": "We went there in second week of June. It off from the main city about 10km from Rajpur Road, Dehradun. You can easily hire an auto for Rs 150 and get there. It is built in a very big areas.  All the idols are housed in different caves of various sizes. Mostly big enough to walk but you need to bend down. There is huge hanuman idol viewable from entrance and a bridge leading to that.  There is water below but in June the spring seems to have dried out.  Most amazing is Vaishno mata cave in which you need to crawl on your knees to get to the other end and it's quiet dark. As a religious place you must visit this one. There is a shivling made purely out of rudrakash. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r384480668-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice place for serenity", "review": "This is actually temple complex where apart from main Shivlinga, there are other temples - Santoshi mata, Vaisnodevi.......The name Tapkeshwar is due to water dripping from mountain on Shivlinga....River is flowing between 2 temples and you can cross the river using small bridge. When we went there, place was quiet without much noise so you can relax, do darshan. You will have to walk down several steps to reach temple but there are benches / seats on the way.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r380436512-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "nice place", "review": "This temple has one good thing. The pundits leave you alone and not keep pestering you to do various pujas. The Shiv temple in the cave is good and so is Vaishno Devi temple, Near the entrance, before stepping down the steps are the nau grahs including Shani, Ketu and Rahu. Overall there is a deity for every devotee.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r384507459-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Ancient root", "review": "This temple is inside a cave and it has some connection with the Mahabharata times. Water from some unknown source always drops at the main shivling, and hence the name tapkeshwar is derived", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r364410973-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Jai Shiv Shankar ", "review": "The place is good enough. Rudraksh shivling,  Vaishno devi gufa,  Bhawani Shankar gufa and And so many other places.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r364749486-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "a panoramic view", "review": "a great place to worship wiht a grand statue of hanuman ji a msut for all the religious lovers and also nice location for temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r366047210-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Cave temple", "review": "The main temple is inside a cave and is quite fascinating.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r364291219-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Very intresting place ", "review": "Good spiritual place but tough to go down.. You need to go Around 200 steps down to reach temple but once you reach there it's very pleasant... Natural shivling in cave on the river bank... Many other god and goddess... Vaishno devi cave is very interesting... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r366872772-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Nice temple on river banks..", "review": "This is a very old temple situated in the Cantonment area on the banks of a river in a gorge. There are 3 to 4 temples within the premises. The main diety is a Shiva lingam, but we have Vaishnodevi mata temple, Hanuman temple, Santoshimata temple and Durga temple. Its a very peaceful place and you get immense satisfaction after the darshan and prayers. The Vaishnodevi temple is located inside a cave and you need to crawl to reach there and it is very similar to the original Vaishnodevi idols that are there in Jammu. Its a must visit place when you are in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r371093144-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Most amazing shiva temple peaceful ..", "review": "My second home this temple... near to house located along side river tamsa.. Its peaceful with all amusement of nautre.. Dronacharya (DEhradun is also known as Drona nagari/city) the guru of pandavs and kurawas did penance here for asking for milk for his son ashwasthama so the Dear lord shiva camin fornt of him and granted him the boon that milk will drop on my linga from the cave wall and you can use it.. this is why the name Tapkeshwar (Tap mean dripping) .. Its a self originated linga now a days water drops falls on linga ... i suggest to come in the evening aarti because these is decoration of linga each day differently.. of course you can see the original linga because of decoration but its beautiful.. to see the original linga morning time..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r350796712-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar temple", "review": "This is a nice and old temple of lord shiva and associated with guru dronacharya. Must visit for every one to. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r372571211-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Choose the right time to visit", "review": "I had heard really great thing about this place, but to tell you the truth did not really find what was promised. The most annoying thing of all was those big hoarding rite in at the entrance. The river was also almost dry so probably should have visited somewhere near monsoons. Overall a very average experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r368077488-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "One of the oldest temples in India", "review": "Its a very old temple dedicated to Lord shiva where you still have a trickle of water falling on the shivling by itself .. No one knows the source .. a very popular temple which draws huge crowds", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r368634482-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "An average place", "review": "It is built on a nice theme but isn't maintained that well. I cold have been better. A lot of stairs to climb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r354345700-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "unusual shivalinga", "review": "This temple is considered amongst the oldest temples in the Dun Valley with many myths,legends and stories attatched to it,the most popular one being  that Dronacharya once resided here,and later on his son Aswatthama  came here to do penance.Unfortunately everything now is man made including the cave which incidentally houses wash rooms too.Not a place for the faint hearted though faith can move mountains so do stop to offer prayers if you are a true believer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r357245183-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "very very peaceful place ....visit again for this place", "review": "i have two times visit this place very very peaceful place ..near to dehardun city about 15 to 20 mintues travel  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r359574833-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Also call Mata Vaishno Devi Gupha(cave) Mandir.", "review": "If you're a nature lover and devotee of Mata Vaishno Devi & Lord Shiva than you should visit this place. can go by taxi or auto risckshaw and spend 2-3 hours walking around or praying. It's a big compound made up by big and small gupha (caves) and shrines and with God and Goddeses statues aand Shivlings. A powerful place for devotion. Worth visiting. It was said that one of the cave used to produced milk & the villagers used it to make kheel (dessert) but one day it just stop pouring milk,", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r355491742-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Shivjis temple", "review": "Tapkeshwar temple is very peaceful and vey quite area around 6kms away from dehradun, mainly it is a shiva temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r355413889-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautiful temple", "review": "Temple that is carved inside the mountain. located near water body.  Significant for hindu mythology followers", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r360266582-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "The ancient root of the city", "review": "This temple of Lord Shiva is situated on the bank of Tons river. The history of city is originated from this temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r361670056-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great Shiva temple", "review": "One must visit the ancient temple to worship Lord Shiva. Amazing temple at the bank of Tons River. Peaceful!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r361451987-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Family Vacation", "review": "We were on a family vacation and as this place is on regular tourist trails had to visit it. The place has a large SHIVLINGA of Lord Shiva with a small Spring dropping droplets of water on the linga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r338114014-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "River-side Shiva temple", "review": "Cave temple with water dripping naturally onto a Shiv Linga, the newly laid bridge between the two banks are helpful", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r361194587-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Marvelous experience", "review": "Recently visited this temple and felt blessed. It is surrounded by river and the best is to see the rudraksh shivling and the shivling where one drop continuously come without knowing the source of it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r338812123-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Very Peaceful location", "review": "It is one of the famous temple dedicated to lord Shiva. The beauty of the temple is that the Shiv Lingais situated inside a natural cave which has a natural water dripping mechanism over it. This makes the view more beautiful. We had food there in the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r338912870-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Divine Destination", "review": "The first temple were i saw the idol of Guru Dronacharya, Ashvathama and and Shiv ling made of rudhraksh with the third eye open. A very good experience and must visit if you are at dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r339960647-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "shiva temple", "review": "we were here for darshan of Shiva -ling which is inside a cave and during rainy season natural water falls on the Shiva -ling..an average place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r339084161-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Impressive", "review": "Impressive and historic temple very close and within the city limits of Dehradun. Temple was clam and soothing ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r340672410-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "A divine place...", "review": "While the water droplets no longer fall on the Shivlinga like before (historically speaking), it is still a wonderful place to visit inside a cave - experience the calmness and its beauty!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r343914589-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "SERENE PLACE", "review": "I very recently visited this temple (February 2016). The Lord Shiva Temple is situated at cave alongside a gorge. One has to step down around 50 steps to reach the place. The Swyambhu Shiva Linga is situated inside a cave with natural water dripping on it. It is quite serene place very close to the city of Dehradun a must visit for all.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r348721045-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Quite and amazing Temple", "review": "I visited this temple in February and it was quite an amazing experience. The deep gorge has temples on either side which are in caves. Within the caves are many shrines where prayer or meditation are possible. The statues of the Hindu religion are very colourful and ornate. Beware that some of the \"holy men\" in the shrines will chat with you or for you but want money.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r347729296-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar temple", "review": "Its a beautiful temple, well maintained, Its a natural cave made very acssessable. The Shivling is swyambhu there is natural drippinp of water on the shivling. It captivates you ,Then there is ashivling made of rudraksh which is amazing .The darshan was amazing.Milk and water are available outside shops.Would love to visit again .There are other temples dedicated to Durga and other devis . It wae here that guru Drona charya Did Penance and his son Ashwathama was born here", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r328606923-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautiful temple", "review": "The mahadev temple is located in a natural cave where you can see tiny water droplets coming from rocks. Felt blessed by darshan of mahadev.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r329641381-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Divine place", "review": "It is one of the famous temple dedicated to lord Shiva. The shiv lings is located inside a natural cave with a small Spring dropping droplets of water on the linga. very clean and beautiful temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r349902649-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful Place but lacks cleanliness", "review": "Tapkeshwar Temple is quite a popular place in Dehradun. It is situated in Garhi Cant. The temple has a river flowing in between the path, that is the beauty of the place. Issue remains about the cleanliness.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r331155229-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tranquil abode of lord Shva", "review": "This naturally built abode of lord shiva is worth visiting by every devotee. Vibrations inside the temple are very pure & religious.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r331553748-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great temple", "review": "Tapkeshwar Temple a very old temple of Lord Shiva shivling, in garhi cantt dehradoon, very famous and popular temple. Every year mela is there in which lots of people participate and enjoy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r331774894-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lord Shiva of Dehradun", "review": "Basically very old religious place of Dehradun. As usual it was peaceful place near stream and under natural cave. As Dehradun had lost its environmental originality like other Indian cities due to unbalanced growth and so called infrastructural development , Tapakeshwar Mahadev temple also lost its originality and natural phenomenon. Still it's worth to see and people must ask how it was originally? It will give you more pleasure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r332179539-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful Temple!!!", "review": "good to be here .. very clean and pleasant in the evening hours . well maintained . easily connected .", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r333425371-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "ALL IN ONE TEMPLE", "review": "Tapkeshwar because- The droplets from mountains directly fall over Shivling. The Shivalinga here is very old, some say 6 thousand years old. Other temples are recent constructions. Must visit is- Vaishno mata temple here. You need to crawl to reach the temple. Very short crawl.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r333809611-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful", "review": "It is a beautiful Shiv temple on Dehradun- mussoorie high way. Well maintained with tea and puri lunger service. I", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r323386091-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Part & parcel of Dehradun", "review": "A very ancient temple, lord Shiva's Stupa in a Cave . Neat & Clean , not much of a rush.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r334723990-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lord shiva abode", "review": "Very beautiful temple situated in garhi cantt !!! Its a natural cave temple where there is a continous drops falling on a shivalinga !!!! Its on the banks of one of the streams of tons river !! Must see !! Aum namah shivayy!!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r317216653-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Good One to visit ", "review": "I visited Temple in Dec 14 I heard that is a temple in cave and all so I visited in order to explore.  You need to move down from steps much below the ground level to have the darshan.  All safety majors are Taken to safe guard the tourist and visitors. It's fun to walk without shoes or slippers that to in winters on ice chilled concrete stairs. Worth visiting. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r334502787-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "beautiful temple", "review": "Peacefull &  beautiful temple made by digging caves inside the rocky Mountain.  Sometimes you have to literally crawl especially the goddess shrine as ceiling is too low in most of the area", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r322399307-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar Mahadev ki Jai Ho !!!!", "review": "Finest place to visit if believe in God then must visit this place. Good place to worship Lord Mahadev , neat and clean place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r324253069-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A magic temple with anciet history", "review": "located on the calmer side of dehradun, this temple is amazing, even after 100 temples in india. The Babas n yogis are calm n genuine, no tourist babas. The gods n divinity aspects genuine and powerful. At first was abit hesistant to go there but very happy we did go! A Genuine experience!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r325207518-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "divine place", "review": "Not a must visit but divine place in dehradun. If you have ample time and nothing to do, then can visit this place", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r325663786-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Serene temple ", "review": "Very old shiva temple. You will see varieties of shiva-Lingas there. Adjacent to it, one or two small cave temples, quietly flowing river are there. A beautiful place in Dehradun. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r326932451-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "religious place", "review": "This is not a sight-seeing place, but has religious importance. It is a place of faith. The caves are worth exploring. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r327049676-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Blessed", "review": "Located at the cantonment area, the temple is beautiful having temples of all god n goddess and an artificial cave of maa vaishno devi too. Felt blessed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r328346404-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Good spot to visit", "review": "Has some steep stairs hence please follow due diligence while visiting with kids and elderly people. Otherwise a nice little temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r308941642-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must go...", "review": "For people who are claustrophobic this place is quite something. I visited with my brother and had literally no idea there is a small cave inside the hill wgich ends up in a mandir. As we started crawling I was so famn tgrilled and super excited. And at the end of it I was so relieved. Discovered my brother is claustrophobic too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r308816091-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice place to visit during Dehradun trip", "review": "The temple is located inside a hill with dripping water. The steps are narrow and steep. The place is highly in-accessible & Narrow.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r305596081-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Sagar", "review": "Nice Temple to visit in Dehradun its a cave Temple and in the same Temple there are 7to8 different Gods small small temple's and the most interesting is Rudraksh shiv ling to see in the cave Temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r327177479-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapak n tapak ", "review": "Literally water trickles: tapak on to the Shiva lingam. Amazing experience, a must see for believers with family. In addition there are other temples too around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r313735636-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "\"TAPKESHWAR MAHADEV DHAAM KI JAI\"", "review": "RAlly  you will  found one of the best,scenic,natural tepmple in Dehradun location right on the neat/clean/cool flowing river.the shiva lingam is in natural cave(wide enough not so narrow and beautiful.it is slippery at some places so be careful specially with kids/old age persons.enjoy the place and stay safe....", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r309716929-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Peaceful", "review": "A beautiful religious place on the bank of a river. The sound of flowing water and the sight of the current makes it worth visiting. The main temple is very small but you feel at peace when you are there. Every pradosh (13th day of lunar calendar) the temple is decorated beautifully, an album of those decorations is available with the Pujari ji)  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r314231467-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must visit place for Dehradun trip", "review": "Its a holy place to visit in Dehradun, its a Shiv Mandir with Shivlinga inside the cave, the cave having natural water dripping from the cave walls, gives a natural divine environment, One of the oldest Shiva lings is in the cave nearby where the river enters and water drops drip down on the Shiva ling. The small cave with this splendid scenery is said to be once resided by Dronacharya- the teacher of Pandavas and Kauravas in Hindu holy epic Mahabharata written by Ved Vyas. The cave is named Drona Cave after his name.Its a divine holy place to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r309628558-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "You will enjoy it.", "review": "It's an old temple of Lord Shiva. A sacred place for Hindu devotees. Inside an old cave the water drops fall from the ceiling continuously on the sacred stone (shivaling). Outside scenery is also very good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r313017378-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A nice temple in a beautiful location", "review": "An ideal place for spiritual visit...Shivlinga made of 5151 beads of rudrakash is worth seeing...the main Shiva temple in a natural cave ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r315516494-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Peacful & lovely religious place", "review": "Viisted August 2014.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r314710407-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beauty near the river", "review": "From Garhi cant chowk you can have access to Tapkeshwar temple through small lanes.At the main gate you can’t imagine that a beautiful river is flowing below 60 stairs.Outside there are many shops selling Prasad,take from there as below inside the temple there is no shop.There are two ways to go inside.If you go by main gate you have to cover approx 60 steps down to reach the temple,but if you go on by parking side(on the left side) y]the stairs reduced to approx.30.The temple is not so crowded except on Monday or on festival days.In rainy season the whole complex is wet and slippery as water constantly drop from stones atop.The shiva lingam is naturally formed and water from top of it from stones constantly drop one by one on the lingam even in hot summer days.Thats why the name is Tapkeshwar.At places you have to bend your head as caves are a little down.If possible, visit the temple at 7 pm as aarti is done at 7.30 pm and they decorate the lingam beautifully,even photography is allowed here.Watch the rudrakash shiva lingam there.Outside the shiv temple there are Santoshi ma mandir, kali mandir and replica of Vaishnodevi gufa mandir on the other side of the river, which have to cross by small bridge.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r293530191-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "An Interesting Spectacle", "review": "Its is most famous temple in dehradun dedicated to Lord Shiva and the main shivalinga is inside natural cave. Approx.6 km from main city and is situated on the bank of a river which adds stunning view to this holy place.People say river water drops drip down on shivaling, that is how this temple got its name Tapkeshwar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r293554473-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "A peaceful place (Inner Peace)", "review": "This is a very interesting place to visit .All religious things around when u will enter the shiv cave u will feel the good vibes in you .a peace in mind .The river which flows beneath it its awesome..The peace which we find can not be explained in words it has to personally experienced by the visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r292454396-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Cave Temple", "review": "A temple situated in a natural limestone cave situated on the bank of a small stream.... You go down a series of steps and then you enter the cave where Shivlingam is situated...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r301046588-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Devotee of Shiva, Must visit in Dehradun location natural,scenic,pious and beautiful", "review": "I visit Dehradun for studies and last month I got free at 2pm and was having train at 5pm from Dehradun to New Delhi.What to do in these 3 good hours? I checked tripadvisor and it detailed about \"Tapakeswar Temple\". I hired autorickshaw to and fro in Rs200/= and to my surprise I found one of the best,scenic,natural tepmple in Dehradun location right on the neat/clean/cool flowing river.the shiva lingam is in natural cave(wide enough not so narrow and beautiful.it is slippery at some places so be careful specially with kids/old age persons.enjoy the place and stay safe.it is around 6 kms from Dehradun Railway station and better book an autorickshaw otherwise you may need to walk 2-3 kms as rickshaw availability at temple site is low.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r295862456-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Divine & Picturesque ", "review": "Must visit. So much to see, feel & look. Easy to spend long hours strolling around in serenity & divinity of the place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r297627521-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Close to my heart", "review": "Five star rating because of my personal religious belief, however, one cannot rate something very close to heart. But, still i would say that Tapkeshwar (Shiva) temple is a must visit for all the persons going to dehradun, for all the good spiritual vibes it generates surrounding you, also the riverine flowing near the temple gives one a unique chance to sit silently with ones feet within the flowing water. I would say a nice place for deep contemplation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r295020432-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Divine", "review": "Its a most famous temple in dehradun , dedicated to lord shiva and  the main shivalinga is inside Natura cave, must visit for all the persons going to dehradun, natural caves with a temple inside, peaceful and vry beautiful. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r302022235-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "spiritual place to mental peace", "review": "we start our morning with firstly going to this temple , we find this temple with full of positive energy . the time we spent here is very good. we feel completely spiritual and positive after visiting  this.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r276120046-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "for the religiously inclined", "review": "Water drips in the cave from the roof, where the darshan is and hence the name. Its a climb down and climb up ( ofcourse) back ..so plan for it ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r304914905-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Very old temple", "review": "The temple is very old and visited by a lot of people from across religions. Even the army cadets from IMA visit it, ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r281773906-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great!", "review": "Many things to see here. Few caves are there. The temple is dedicated to Lord Shiva. You must visit during your stay in Dehradoon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r302805329-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Tranquil Abode", "review": "It is located down a small hillock,accessed via steps,The surroundings are very calm and quite,with a number of other temples within walking distance.A small river flows beside the temple.Beware of monkeys and keep care of your belongings.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r282024151-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "My reason to visit dehradun", "review": "Somehow i came to know about Tapkeshwar Mahadev temple and wishes to be here since then.Visited now and i could hardly belive the amazing place this temple is situated co-existing with the nature. Ofcourse we were here to see Bhole natg ji but felt elated when we saw all other gods been worshipped here as well. I was to write what i saw there but it would be an insult to give that amazing experience with some words. Its beyond...way beyond. Better seen than tell. If you happen to go pass dehradun...take my word for coming here and you will feel the contentment you have had never thought of.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r282503325-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Tapkeshwar Temple.... a holy place...", "review": "Tapkeshwar temple is an ancient temple of Lord Shiva, situated approximately 8 km from Dehradun, on the banks of a stream, in Garhi Cant. This place holds a lot of reverence amongst the devotees of Lord Shiva. The deity has been naturally formed in the cave. There are also Santoshi mata & Vaishno devi mandirs across a small stream. One of the oldest Shiva lings is in the cave nearby where the river enters and water drops drip down on the Shiva ling. Here in a small cave Dronacharya- the teacher of Pandavas and Kauravas in Hindu holy epic Mahabharata was resided. The cave is named Drona Cave after his name.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r284246653-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Holy place of Dehradun", "review": "This is apparently the holiest place of Dehradun,and a major sightseeing spot.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r285551118-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Bam bam bhole", "review": "Temple in a single stone at the bank of river. You will really love it. I can't express all here but I felt great after reaching here. Great destination.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r287653910-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "nyc", "review": "it is a temple...a very old temple..nyc architecture..visit if u have time...else one leave it...lot of temples are dere in dehradun", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r284633497-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Beautiful cave temple", "review": "Natural caves with a temple inside, peaceful and very beautiful. Stream near the temple & a few steps to climb down", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r289448218-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "A real temple feel", "review": "A beautiful location, next to a stream - this temple is worth a visit if only for the great atmosphere. The deity is a shiv lingam formed naturally with water dripping on it from the roof of the cave. It is also claimed that Ashwatamma (son of Vishwamitra) was born here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r266174731-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Shiva Temple", "review": "Excellent Located for long long time. one kind of different experience with lots of God temples inside the premises. enjoy the water fall with in premises of Temple place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r288419225-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "spritiual", "review": "Tapkeshwar Mahadev Temple, around 6.5Km from the main city of Dehradun, is situated on the bank of a river that adds to the beauty of the holy place. One of the oldest Shiva lings is in the cave nearby where the river enters and water drops drip down on the Shiva ling. The small cave with this splendid scenery is said to be once resided by Dronacharya- the teacher of Pandavas and Kauravas in Hindu holy epic Mahabharata written by Ved Vyas. The cave is named Drona Cave after his name.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r267676394-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Mahadev", "review": "this is mahadev's temple at good location.  you can get it non crowded. you can feed to fish. a small river is going through the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r267398926-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Great", "review": "The place is brilliant weather you want to have some fun or you want to indulge in religious thoughts. The geography and scenec beauty is magnificient.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r268315697-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great Shiva Temple", "review": "Newly renovated and very clean. Had a very deep meditation there. Very quiet area out of town, best to hire a taxi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r269015247-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Om namah Shivaya", "review": "Hello, this is a nice temple to visit where one needs inside cave like mountain. There are also Maa Vaishno Devi temple in ghufa and also Maa Kali and Maa Santoshi ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r270746125-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A temple in a serene locality", "review": "The Tapkeshwar temple is approx 15 mins drive from clock tower through the cantonment area. The place is little far off and hence less crowded. The temple is dedicated to Lord Shiva. The deity has been naturally formed in the cave. Now the cave has been turned into a temple with many other Hindu Gods & Goddesses. There are also Santoshi mata & Vaishno devi mandirs across a small stream. While almost all temples in India are heavily commercialised, this one appears relatively clean, well maintained and less crowded. There around 50-60 steps (downhill) one needs to cover before reaching the temple. Worth the visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r270117710-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lord Shiva Temple.", "review": "go in the early morning and stand in cues and wait till your no. come to see and receive blessings. the beautiful architecture work in the foot hills.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r273232673-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Review of tapkeshwar mahadeo dehradun", "review": "Close to the hotel, very ancient temple. Parking place is available. there is a statue of Shivji made of Rudraksha which is unique.Pooja can be performed if anybody wants as Purohits are present all the time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r255151599-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Wonderful Shiva Temple", "review": "This temple of Lord Shiva is worth visiting as it is located in a cave like mountain. You have to climb few stairs(60-65) to reach the temple, though access into the cave is easy and convenient. The beauty of the temple is that the Shiv Linga was naturally formed with water dripping onto it from some invisible mountain source, hence the name Tapkeshwar. Definitely worth a visit. Idols of other deities are also worth seeing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r273912751-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice shiva temple near the cantonment road", "review": "This shiva temple is around 6 km from city and has some steps to climb so old people should be prepared for a climb. Peaceful and calm location. All shiva devotees should not miss this temple if visiting Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r274112687-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "OK if you are religious, avoid if you are not", "review": "Location is good. On has to climb down steps to reach the temple. A small river flows by. Peculiar to religious places, I found this place dirty. The water was dirtied by people and one would not dare step in to it. If you wish to enjoy the feel of water and mountains, I would suggest you to go to Robber's cave (Gucchupani) instead. If you are not overtly religious, you can avoid the place. If you ain't time constrained, you can make a quick visit. Personal/ hired car is best. If you don't have that option, hire a rickshaw which would take you back from Tapkeshwar. If you don't hire, you will have to compulsorily walk for about a kilometer and half.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r258169450-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Beautiful Cave", "review": "We went 3-4 times in this temple, not only of love in god, actually we went there to see the scenic beauty, which I cann't express properly, still it is in my eyes. It is my highly recommendation, must go and enjoy everyone ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r259738884-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Dev ke Dev maha Dev", "review": "God house , here a player and make a wish to god and enjoy a small fiver and even you can play in this river as enjoy small fishes in the water.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r260645300-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great Temple", "review": "It is a famous temple of Lord SHIVA , nice location . Whatever you wish from god from heart , it is always fulfill.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r260828182-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "excellent cave temples", "review": "This is another hidden gem of Dehra Dun. Back behind the cantonment area, these caves are all nestled around the Tons River tributary. The temples to Tapkeshwar and Santoshi Mata and Vaishno Devi (replica) are fascinating and well maintained. Well worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r263188963-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lovely", "review": "Temple is lovely.. Built in a quiet and nice place.. easy to reach.. no one is pushing you to move ahead.. just sit there and feel the blessing of lord Tapkeshwar coming to you.. Bajrangbali statue is really nice.. Jai Shri Ram", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r263840273-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Temple visits cannot be rated as a business trip.", "review": "However the road to this place is horrible, Dehradun city should take care of it , if it is serious about tourists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r262378097-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Tapkeshwar Temple- A Divine Experience", "review": "Beauty of Dehradun.. a divine place to visit. Tremendous Positive vibes. Peaceful place to meditate.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r264184761-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "PLACE FOR DEVOTEES", "review": "This is a place which may be visited by religious persons. Place is not very clean and also view is not great. Incase someone has time to go around in Dehradun, he may take a round of the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r265583492-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "A place for worship", "review": "I always enjoy visiting the religious places and the hills are always full of such places. One should visit it atleast once.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r246284031-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "a place of peace and introspection", "review": "a lovely place where flow of water is pure and it is not deep. you can relish this place as a picnic spot. but I suggest you should go alone in day time. spend two three hours and you will find an amazing peace. you can introspect and can purify your soul too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r244969397-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Tapkeshwar", "review": "Good Experience, Feeling of Vaishno Devi... Reach there in afternoon as evening it is pretty deserted", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r245241831-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Epic", "review": "Well managed... it is natural spring which falls on Mahadev.... it is said that in earlier time it was milk which use to drip in these caves....as ashwathama had demanded milk from Mahadev. A huge fair is prganised on shivratri where you see large number of snakes..!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r245454625-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "science behind the tapakeshwar temple", "review": "this temple is  underneath the limestone caves in Dehradun , where the water seeps in through the caves to water  the shivlinga .", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r248222133-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "a must visit place in dehradun", "review": "Histroical Tapkeshwar temple is not far from dehradun. it is a cave of Limestone  in which temple is present. Rudraksh shivling z a attraction here. water keeps on dripping in cave.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r252604510-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Best Temple in Dehradun", "review": "While going to mussoorie from hardwar,we visited this holy place. Away from city life so lonely and peaceful place. Very less option for devotee in Deharadun city. You have to stepdown and climb stairs. Must visit place in deharadun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r249372655-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "it is best..", "review": "basically it is lime stone cave.in monsoon nature will be at its best..u can see drops of water falling from every where...must see place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r249818480-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 1.0, "title": "Risky Temple", "review": "Very Narrow bridge to reach the temple. High risk during crowded festival/auspicious days.Old age people should avoid this temple ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r251376046-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Soothing place", "review": "Most likeable thing for me was the flowing water in between two temples.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r254283026-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "harmony between religion and nature", "review": "This is a Shiva Temple with a lovely campus. The temple is situated in a cave from which water seeps. Supposedly Dronacharya had stayed in this cave. There is a river flowing below the cliff which is very beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r234184128-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Tapkeshwar Temple", "review": "its a nice temple of Lord Shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r230213690-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Good Temple", "review": "What I liked about the temple is it is inside Caves with Water dripping inside. There is river by the side. There is Duplicate Vaishno Devi Temple created there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r236034567-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Shivling in cave", "review": "Do visit to take blessing of Shivji. The temple is cave is really nice. Just opposite to it is mata rani mandir which is made similar to vaishno devi. You need to cross the little cave to see the three pindis.. Really nice experience. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r235363074-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Lord Shiva temple", "review": "Though many other gods and goddesses temples were also  present I felt that most preference is given to Lord shiva temple. Water through the rock falls on shiv idol", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r238262293-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Must visit", "review": "(+)ves", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r236885774-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Memories!", "review": "Up and down the  steps we went every morning during boxing season at school. A great place, really makes you feel good. Enjoy the sounds of the water & the holy cave where the idols are. You may really need to bend in a few areas in the cave which makes it even more fun!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r237674256-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Great Place to visit", "review": "The temple is cave is really nice. Just opposite to it is mata rani mandir which is made similar to vaishno devi. You need to cross the little cave to see the three pindis.. Really nice experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r242948797-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Good Place", "review": "Good place to find some solitude.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r244479144-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Enchanted", "review": "Be here for God! And you will get a beautiful scenic view as a blessing. temple with its own world. Not more than 1-2 hrs place but if you are from a plain area you should be here", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r241500655-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "nice", "review": "there is an a/c chamber in the temple, u have to go deep inside the cave. Just in the banks of a flow, very good place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r194521305-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Lord Shiva in caves", "review": "A place to offer salutations to Lord Shiva.  Well maintained holy place.  Specially old age people would like it very well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r202503575-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "For a different feeling !!", "review": "This is a beautiful temple for everyone. Just be careful with the location as it gets scary at nights.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r206367916-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Amazing Lord Shiva's Tample", "review": "It is really a nice Temple. Shiv Ling was founded inside a cave and its natural. Every one should visit this Temple in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r193121566-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 2.0, "title": "not so holy", "review": "I was expecting a old temple, felt very made up. I would avoid it unless I am a religious person and any temple would do.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r211305092-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "relaxing", "review": "You get rejuvenated when you enter the caves. I visited during the afternoon, and there was barely any crowd. Very clean, though the river is pretty dirty with the garbage from he offerings strewn around. Even the offerings to the water makes the river look Yuck!", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r213689107-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "An Hindu Temple", "review": "U will find lots of sadhu beggars. Temple is inside a cave. Not kept clean but a very good hindu temple.  The temple is of lord Shiva. Surrounded by beautiful Alaknanda river on the banks of the temple. Very old temple. Any Hindu will definately like it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r217694621-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Har Har Mahadev", "review": "one of the best temples ever been. clean surrounding no greedy sadhus, just go with a true heart and you wish will be accomplished shortly. very well maintained lots of place for parking couple of food joints and do visit in FEB or March During Mahashivratri.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r213491023-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must see temple in Dehra Dun", "review": "This was a very interesting temple dedicated to Shiva.  It is set up inside a cave and another site across the river. The marble floors are very slippery, so if you are not sure footed, it may not be the place for you.  Very beautiful and peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r215695923-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Locals have a lot of faith in this temple....", "review": "This temple is a must visit... It has some small natural caves with water dripping on the floor. The water also drips directly over the shiv lingam in the temple naturally. Agreed the temple has marble floors etc. and must have been modified and constructed, but isn't that true for most of the temples in india. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r227432793-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Find your Tranquility", "review": "This temple is located inside a cave. One must try to visit this place when in Dehradun.  The place is well maintained by the temple management. One can pay obescience  to Lord Shiva", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r190150717-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Nice temple, which doesn't take any money but gives Prasad throughout the day", "review": "Very nice Shiva Temple. They don't take any money/donations. But, they serve Prasad and Tea throughout the day. One of the rare temples, which doesn't take any money. On the highway between Mussoorie and Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r189214504-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Okie types temple", "review": "This is the old shiva temple. When i was growing  up this was a nice picnic spot as it was not spoilt of the commercialization. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r186801609-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "most interesting temple in Dehra Dun", "review": "Dehra Dun is not known for it's temples, but this cave temple complex is worth a visit, if you are a Hindu. The river in front is said to be part of the Tons River, so it is considered inauspicious to bathe here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r187344664-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Old shiva temple", "review": "This is an old shiva temple on the banks of the seasonal river. This place has certainly lost its rustic charm to commericialization. Overall  okie place but beaware of the sadhus who hipnotize ..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r186875737-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Must visit", "review": "Its a place worth seeing especially for religious people. This temple is very old dedicated to Lord Shiva. Natural water falls on Shivalinga which is quite amazing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r191331339-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "a beautiful cave temple in nature's lap", "review": "approach road was good from rajpur road till tapkeshwar and there are other newly built temples at walking distances around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r192564496-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 2.0, "title": "god, god", "review": "like they say god is present every where, you must definately bisit this temple to feel the fact. when i closed my eyes and chanted, om namo shivay, it gave me a feeling as though i'm feeling myself above the ground.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r190961141-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "jai mahadev", "review": "a very nice religious place to visit. rudraksh shivling was amazing, river flowing along the temple looks very calm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r192564650-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Auspicious Tapkeshwar temple at Dehradun", "review": "This Lord Shiva temple is located very near to Dehradun City and  inside a big cave. Everybody should  visit this place when in Dehradun. The place is well maintained by the temple management committee and one can pay obescience to Lord Shiva. Way to this temple is beautiful and souuroundimng to this temple some other temples are also nice to see. The river in front is said to be part of the Tons River, so it is considered inauspicious to bathe here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r192438935-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Amazing Cave", "review": "We planned for an overnight we have to move tepkeshwar mahadev temple. There are not many choices. Was lucky to get accomodation in the GMVN guest house. Though the amenities were basic, no heating, tap running cold water, felt almost like sleeping in the open cold at night etc...If you consider the altitude and the fact that any material, even for construction has to be carried all the way up on horse backs, in the absence of roads, you will appreciate the amenities and the servie rendered. Hats off to the staff who are serving with a smile in the harsh weather. The food was excellent and was surprised to find even 'room service' was available. Most conveneiently located, close to the temple & the helipad ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r164276249-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Ancient temple in cave....", "review": "Mainly temple of Lord Shiva, with other god and goddesses  too. Good cave temple having some MAHABHARATA background. It is said that this is the place of birt of Ashwatthama and for him lord shiva created the source of milk hear. Milk stared dropping which is said in local language as 'Tapak'  and therefore it is named as Tapkeshwar mandir, some thing like that. Once again dirty background and no great facilities for tourists. But no entry fee. Overall Good place to visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r158866105-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Average Location", "review": "Average location. May be good to see once. There is lot of dirt and garbage littered around the place. It may be good had the place been little for clean. Do not encourage beggars in this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r159336648-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Good place to visit", "review": "Ancient Temple of lord Shiva in a cave. It is an old temple of Mahabharata Time. Must visit Place. It is said that Ashvatthama ( Son of Dronacharya) was born there and for him lord shiva created a source of Milk in this cave. Milk stared coming out drop by drop. Which is called TAPAK in local language and therefore named as Tapkeshwar temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r158866900-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Har Har Mahadev", "review": "It is a temple of Lord Shiva, with other god and goddesses too.It is said that this is the place of birthof Ashwathama and for him lord shiva created the source of milk hear.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r163977568-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "JAI TAPKESHWAR", "review": "temple with lord shiva have a very unique LINGAM on which water is continually dropping all the time. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r166484954-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 2.0, "title": "The ambience of the Tapkeshwar destroyed", "review": "I had visited Tapkeshwar about 15 years back. It was a natural cave at that time which had a special aura since one had to go through a cool stretch of water to reach the main sanctum sanctorum. They have cut open (literally spoilt) the cave and rebuilt it in marble and marbonite tiling turning into a run-of-the-mill hindu temple. The old feel of reverence is no longer there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r164855498-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Religious & Deep throat feeling", "review": "Visiting the place since 1992 regularly, a beautiful place beside a river with awesome religious aura..One who wants to visit the place must carry something to eat, some drinking water in summers, a camera and ofcourse lots of friends or family member for the wonderful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r150471291-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Cave temples", "review": "It's a group of cave temples with Shiv ling made of rudraksh with a stream flowing between the temples with a vaishnodevi temple on", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r185834628-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "just okay...can visit if you are very religious", "review": "although tapkeshwar mandir is very beautiful.. you can see the natural caves where this temple is built... natural beauty has been destroyed.. lots of beggars will be on the stairs... who will comment on your back when you don't give any elms to them :)... moreover lot of other small temples you can see which is just across the river(nala) full of polybags and sweet bags flowing along with it... hardly any maintenance.... just okay...to visit..", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r186697855-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "If u love nature build temple than here is ur destiny", "review": " the main attraction of this temple is that it is purely natural the way inside the temple is beautiful and the mountain and rocks covered upon the shivling are breathtaking it is a must visit place as there is also a sacred river flowing alongside the temple shivratri is the best day to visit this temple as many people come here on that day ", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r169607092-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "For Spirituality and serenity its awesome", "review": "the natural abishekam for siva in the form of linga for centuries, this temple is in the cave where the echoes of the water flowing nearby. Must Visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r152012870-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Shiv Temple", "review": "This is a unique cave temple dedicated to Lord Shiva, located in a natural surroundings and  having a river flowing through the temple complex. With water dripping from the cave roof, at times, it’s difficult to find a firm footing. But that’s a minor challenge compared to wading through the surging crowd of devotees that throng the temple for Darshan. Visiting this temple and having Darshan was an overwhelming experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r151945354-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "serene experience", "review": "i always used to visit Tapkeshwar temple since childhood. It is located in Garhi cantt area. The temple is very different from other temples as the temple is in a cave and from the roof natural water keeps dropping. Someplaces in the temple, you cannot keep straight as the roof is very low and it gives a very natural and serene feeling. theres a river beneath the temple and the water is really chilly. you can cross the river through a bridge and go to the other side of temple which again is in a cave and you can go to the natural tunnel cave (not advised for people on a little larger side). the temple has a lot of stairs and there are few small shops around. The only thing to take care is transport as public transport is not common in that area, it is better to arrange to and fro conveyance before going.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r151438232-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Quite Silent place with combination of temples...", "review": "Come to this place in early morning, before eight and you can feel the freshness and clam this place has in itself...", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r153862510-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Pristine Cluster of Pilgrimage", "review": "The pristine beauty of the cluster of temples deep in the valley is beyond compare and a visit to the place leaves an indelible mark not only on the devotees but also the uninitiated. Tupkeshwar sounded rather a riddle till it was explained to us that the temple was named so as the water keeps dripping from the overhanging rock and as a result the Shivalinga is always the center of offerings without a break. The visit to the temple makes one wonder at the ways God can manifest Himself. The entire area is seeped with a divine inspiration and there is something for every for every palate. There are many temples dedicated to many more divinities and one can spend a lot of time in the area without bothering about the travails of life. The experience is really relaxing and rejuvenating. I would love to go there again simply to get a feeling of divinity, divine presence, fantastic natural beauty and serenity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r154722450-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 3.0, "title": "Good place to visit", "review": "It's a normal temple. You will not find a wow factor there. Natural water drops out from hill stone. That's way it's popular", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r156780830-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 4.0, "title": "Must Visit", "review": "Tapkeshwar mahadev temple has folklores associated with it. Believed to be meditation ground of sage Drona and milk drops used to fall on the natural shivling. With river flowing next to it, it forms a beautiful and serene atmosphere. Place where kilometer long queue forms from early morning on the day of mahashivratri. Overall it's a must visit place in Dehradun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r148056041-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Good Religious Place", "review": "Its a very good Hindu Good Religious Place. Temple of God Shiva. Named Tapakeshwar as Drops of Water keeps on pouring on Shiva Linga. From the word Tapakana, named as Lord Tapakeshwara.  Very religious and nice place amid rocks. People keep Enchanting Mantras and religious divine songs. Its a very good atmosphere. Not much far from city. you need to book an auto as no direct bus service.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r158011844-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Tapkeshwar Temple", "rating": 5.0, "title": "Must go place for temple lovers", "review": "A very beautiful place and very different for a shivling to occur, amazingly shivling appears in most awkward places, mostly in caves as is this one, very old and must go place for hindu devotees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g12106125-d3705430-r158805553-Tapkeshwar_Temple-Dehradun_District_Uttarakhand.html"}]