[{"point_of_interest": "The Mall", "rating": 4.0, "title": "Shopping At reasonable Cost", "review": "As compared to Shimla Mall Road it is very Big with many shops and restaurants. And all of them are at very good cost.[not high]. Only draw back I found people can drive cars and two wheelers on that.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r627617029-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Pulse of Mussoorie", "review": "Took a stroll through mall road,in cycle rickshaw,geared cycle and by feet.its a special feel when you are there", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r630075185-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "All mussourie", "review": "The main part of mussourie . All.the restaurants and shopping is there. Lot of interewting placee on .mall road. Check out the churches. Donsome randon shopping. Go to the cambridge book store. Stop and listen to locals discussing their daily talk. Its a hilly version of a busy ny street. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r630981227-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Evenings and nights", "review": "All tourists spend the night on the Mall road - eating momos, chats and much more. The chilly night went to zero and then to sub-zero temperatures as we enjoyed every bit of it with spicy and hot foods. And loads of shopping is always possible.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r642996608-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Lovely place.", "review": "One of the best place to walk around and pick up lovely stuff for all your dear ones. Very friendly and warm people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r639052774-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "The Main attraction and shopping/ eating point in Mussorie", "review": "Guess this is the bang in the Middle and the main area for Tourists,  for shopping and eating. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r641807964-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Great experience", "review": "Great experience and nothing else it's awesome day fully enjoyed in musorrie I like that and my family.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r651674350-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "A nice stretch to enjoy the beauty of mussoorie", "review": "Beautiful place with lots  of shopping, food and hangout place. You will enjoy walking on mall road ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r648641315-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Touristy!", "review": "Main part of the town for eating, shopping and chilling. Full of tourists at any time of the year, this place is heart of Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r652995469-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Excellent", "review": "This is the most beautiful cafe located  in Mussorrie. loved the ambiance and the decor!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r659164474-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "No options", "review": "Cannot skip mall road here with lots of tit bit to have and lots of shoping options. Very long road and I wonder why there is always mall road in every hill station ;). Nice place to time pass and hang out with friends", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r587081600-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Summer Break with Friends in 2018", "review": "This is an average Hill Walk or Market as it was crowded and the shopping or dining experience have not been upgraded with time. However, if one has to take a Walk then it would be good to go for a Walk of the Camel Back, which is parallel to the Mall Road and offers beautiful views of the Valley. If you can get a Guide - like Deepak Joshi then the experience can be enhanced. Total time of the Camel Back Walk can be around 2-hours. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r588718220-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "The Mall Road - Shopping and Eating Lane in Mussoorie", "review": "If you are in Mussoorie, you can't skip the mall road. The main attraction of the mussoorie is this road. There is long stretch from The Library Chowk to Pic Palace which can be covered by walking or riding a Rickshaw as per the convenience. There are so many shops selling the stuff; however, these are not specific to Mussoorie or Uttarakhand. You can find these stuffs in your city too. Lot's for eating options are available on the road and one can stroll down the mall while eating.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r588730866-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Spine of Mussuoorie", "review": "Just a few meters ascend from Mussorie bus stands takes one to equally busy Picture Palace. No vehicles are allowd till night after this point. After the vehicle barrier you can walk on a semi-circular road which further ascends and takes you to jhoola ghar or point of ropeway to gunhill. Later you find Aquarium, Ritz cinema and then Mall ends near Library. Picture Palace and Library are two main happening places. You can find several old buildings, eateries and souvenir shops on Mall. Famous book shop is also located on this road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r600672361-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Crowded, No Vehicles allowed walk or take a Cycle Rickshaw Ride!", "review": "Lot of shops selling Toys , Clothes , Footwear , Shawls , Show Pieces etc , just like any other Mall Road in India!!! Lot of Momo Stalls , Corn both Boiled and Roasted , Pop Corn , Chicken and Mutton Sheek , Aloo Tickki , Vada Pav and Softy Ice Cream Cones etc , also a lot of Restaurants with wide variety of Food Indian , Chinese etc. Tried a few stalls nothing to boast about , didn't bother trying any restaurants but good reviews about a few in that location! The only place that Sells Liquor , Both Desi Sharab and English Liquor as they call it is here , Beer shop is located at a  different location about 400 to 500 meters apart! Has a Cable car at the end but since we were late didn't bother checking", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r590252854-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Great walking street.", "review": "The place is perfect for shopping, walking, spending great time with your loved once. There are many restaurants and shopping choice stores. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r608085232-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "the main road", "review": "the mall road in mussorie is such a bliss when it is not crowded....in the evenings it starts getting secluded and becomes all misty...lined with places to shop for souvenirs and lots of famous eating joints....walking delight", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r610523962-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Excellent mall road", "review": "This is one of the best mall road. This road is approx. 2km long. There are some good shopping shop, Cinema hall and Restaurant.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r610750862-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Shopping area with lots of places to eat and shop", "review": "Mall is good with lots of places to eat and shop. You can get rickshaws to go to zero point, company garden, jhoola gharh. Cabs are also available. A bit of walk will take you to GMVN tour office where you can book bus tours to Kempty falls. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r569419368-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Vibrant place", "review": "It's one of the best places in mussoorie. Though it's just a 2.2 km long road with shops, restaurants etc yet it's the most vibrant place. You can try different types of foods here. Kulhad milk is also available. One should go after sunset when lights are lit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r621830907-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "heart of Mussoorie", "review": "The pleasure of a long walk (approx 2 km) on the mall road shall be a delightful experience. The Mall Road, is the heart of Mussoorie, with the food stalls, markets and filled with tourist attractions, is a place one can't miss while visiting the hill station. Lovely place to shop stroll and relax. Nice paintings and sculptured walls across the mall. Lot of activities and gaming zones for kids. The scenic views are ones that can't be missed, of course. Some of the colonial architecture stands. There are peddlers pedaling auto-rickshaws (50 rupees for one side) that can take you right to the entrance of Mall Road from the deeper within of the Road. We walk on Mall road on each day of my stay with eating corns and momos. Really a cool and scenic view of Dehradoon valley and amazing nature views", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r567802561-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Canadian Tourist", "review": "We found the mall road to be a much safer walk than some other places we visited in India. Vehicular traffic is limited by a toll booth and only to certain vehicles. This cuts down on the chance of being run down and allows one with small children to enjoy the shops and stalls along through the Mall road without too much worry. It is also much cleaner and organized than some other areas with excellent choice of restaurants, shops and entertainment which are reasonably priced. Definitely a nice place to visit in March.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r569918891-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Spend your evenings here", "review": "where ever you are in mussoorie you must spend your evenings on the Mall", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r573265429-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "This is Mussoorie", "review": "This is the road that you should walk up - down - up - down . Have a cup of tea and momos or  corn if you are hungry . Excellent exercise for the leg muscles , lots of shopping options .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r577642537-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "The mall Road Mussoorie,", "review": "The Mall road leading out from the Library Chowk is the best place to spend a leisurely time in Mussoorie. Rows of shops selling all sorts of things from woolens,clothes, jewellery and what-not beckon you as you walk through this Road which does not have vehicular traffic excepting cycle-rickshaws.You also get cycles and prams for babies on hire. There are view points in between where you can rest or put your camera to best use.The Tourist Information Centre, the Cable car and Cinema Hall are all placed in this area.There are many hotels and restaurants here.Strolling in the mild afternoons or during sunset is a nice experience though week-ends can become really congested. There are long traffic snarls on roads leading to the Library Chowk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r576652570-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 2.0, "title": "pretty average", "review": "ALL hillstations have a 'Mall Road'. This is no different. I'm saying this because my idea of a trip is to see a place- views, architecture, etc;not visit a market. If you enjoy shopping , you'll have plenty of choice. Locals shops, brand shops and street vendors offer various things for sale ranging from clothes, woolens, shoes, bags to food, toys and souvenirs. Do checkout omelette, chole-bhature and momo shacks Safe to walk, hardly any traffic allowed on the road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r574844871-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "It’s busy but good", "review": "Mall road in mussoorie is one of the biggest which I have seen in other hilly areas. It has all the shopping and eating options. The area is crowded all the time but it is a happening place. Parking is available but it’s bit far.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r581188438-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Mall roads can not be skipped!", "review": "Shops selling all sorts of stuff line the Mall road. We accessed it from the library chowk side. It's a long stretch which can also be covered on foot but we took a cycle Riksha ride half way as we had a 7 year old with us. Lined with places to eat and shop. Entry to Gun Hill is also on the way. This can not be compared to the Mall road at Shimla as that has no vehicles and is much more romantic and picturesque in nature. Here you would see scooters and other small vehicles moving around on the road and it's not secluded. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r581633290-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Average place and average shopping options", "review": "This is the most famous place in Mussoorie. You can go there by walk or take a Rickshaw from Labrary Chowk, which will charge Rs. 50. Its a long road and there are many shopping options there, and you have to walk up and down. You can definitely spend some time there and you can get all sort of stuff there. Only issue with this place is that the stuff available there is nothing specific to Mussoorie or Utrakhand. Its pretty basic stuff that you can get anywhere, So keep that in mind. There are many eateries also there. Overall, one can definitely visit this place but don't expect to find anything out of normal to buy there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r583778747-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Shopping place!!! ", "review": "It's a perfect shopping destination in Missourie. Lots of apparels, accessories, things, books are there to buy. The view was super. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r550387458-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Sizeable amount of Shops", "review": "Great place for shopping and eateries. Though somewhat costly but offers variety of options. Have many options and perhaps largest Mall amongst all Hill Stations.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r553945651-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 2.0, "title": "Overpriced", "review": "The shopkeepers have increased the prices of very ordinary products..  Most of the shops sell similar products..  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r553789539-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Good for shopping and stroll!! ", "review": "The Mall Road in Mussoorie is the main shopping area of this delightful hill station. Explore the shops ranging from big to small, selling everything from colorful fabrics to electronic goods. Shop for souvenirs and gifts which will be much appreciated back home. Wrap yourself in jamawar shawls, famous all over the country for their fine quality. Intricate designs and vivid colors make these much-loved items in your wardrobe. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r554880843-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "British Feel", "review": "Nicely maintained place with old British feel. Clean. Crowdy. Chaotic. Doesn't feel like you are in mountains, but like a regular market in a city. Mussorie is simply the opposite of what I had heard, read and came with a mind for. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r561674925-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Nice place", "review": "It was nice cool evening, had a great time with sister and husband. Roaming around the mall, discovered nice food joints. There was one chole kulche stall found it very tasty. Had pani puri too. There are many options for food. Also there's CCD for good coffee and view as well of the hills.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r555369613-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Good, but a little overrated", "review": "Visited Mussoorie during the summer months of 2017. The Mall Road, is the heart of Mussoorie, with the food stalls, markets and filled with tourist attractions, is a place one can't miss while visiting the hill station.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r557869974-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "A small town Market", "review": "This is Mussoorie s Main Market. On one end is the Library Chowk. It is overall about a 2 kms walk from one end to another. There are small shops selling local handicrafts and clothes and a few famous eating places like the omlette wala.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r563079141-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Neat place of mussoorie ", "review": "Mall is the best and neat place of mussoorie, mussoorie  comprising only 122 number of hand rikshaws to fetch the comuters from one place to another,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r566496815-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Chaos... The worst part of Mussoorie", "review": "Mall Road is the main market / shopping area of Mussoorie.  It has Library Chowk at one end and Picture Palace 2 km away which is the other end.  In between there are shops and shops and shops, hotels, restaurants and hotels, coffee shops.  Cars are restricted and have to pay a fee if they want to go through.  Rickshaws are plenty to take you around if the need arises.  this is not what you expect when you think of coming to a hill station.  To feel like you are in a hill station go a few kms away to landour and you will love it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r563369041-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Nice Stroll", "review": "I considered Mall of Mussoorie the best mall of any hill station in India. It became crowded during weekends. There are many good hotels and restaurants on the Mall road. A stroll on the Mall road is must.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r526147618-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "just like any other", "review": "just like the mall of any other hill station.. crowded with tons of mountain shopping you didnt have to do.. umbrellas and knick knacks and clothes and swweaters and shawls and eateries and joyrides and the likes. but its a good walk nonetheless. had i not walked on the mall i would not have stopped to eat samosa jalebi or hot chocolate...so go", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r519206812-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "The Mall —What is it, Where is it ?", "review": "The Mall is that piece of road which runs from the East appropriately named The Library over across the top of the ridge that makes up a portion of Mussooire to the West side named Crystal Palace.  The latter is below Sisters Bazzar and Landour.  The Mall faces South looking out over the ‘plains of India ‘.  At one time motorized vehicles was restricted to those living along that stretch but today the barriers at either end seem to allow any and all.  The stretch of road known as the Mall is not to,be confused with the corresponding road to the North which is called The Camelback Road .. never quite sure if that should be one word or two, as the road derives it name from a piece of erosion representing a Camel and its back. Along the Mall you will find an assortment of ‘street shops/stalls’ selling a variety of items..superb chance to purchase beautiful shawls.  In addition near the west side of the Mall where the road splits (either will take you to the same location) you will find a large group of rickshaws and just below it access to the Gun Hill chair life.  Albeit the Mall and the Camelback road make for a great walk when you combine the two.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r530926184-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Amazing", "review": "The prime attractions of the area include 1980s style video game parlours,the methodist church and skating rinks.Dotted with benches and lampposts lined up at the sides of roads,the mall offers architectural styles of colonial period.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r528195227-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "much crowed", "review": "every hill station has mall road. it is 3km long walk. you can shop anything here and many restaurants and bakers on road. you can take a cycle on rent 100 rs per hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r536047573-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "good mall road", "review": "the view of Mussorie and Dehradhun ( which is enclosed by mountains on three sides) is breath taking.There are many small shops but it is easier to bargain on the footpath stalls... wide variety of winter wear at very reasonable rates", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r542428886-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Hill Stations’ regular feature!", "review": "Albeit profoundly quaint with rinks, eateries, varied shops, gaming parlours: the Mall overlooking the panoramic views is almost a three Kms walk. The colonial charm, the serenity, the freezes  the ambience inwardly making it a memorable leisurely pastime.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r542342894-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Good scenic view", "review": "This Mall Road which is about 4 km long gives scenic views of both the slopes of Mussoorie and Dehradun . There are shops all along the road including many pavement shops. There are quite a variety of restaurants and one can travel in a vehicle on the Mall Road after paying a toll of Rs.150", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r541987345-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Shopping destination", "review": "This road in Mussoorie is a perfect destination for shopping. There are several outlets selling apparels, accessories, books etc. There are good restaurants too. You get both Indian and Western Clothing stores. Book stores near Moti Mahal has very large and good collection of books. The Mall road is always crowded as people love to hang out and shop here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r544243201-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "The tourist attraction!", "review": "This is the ultimate shopping destination of the town. The views of the mountains and Dehradun is just wonderful. The shops have a variety of collection for the ethnic clothes, some woolen clothing, and other craft items.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r545294682-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Centre place of the Town", "review": "The mall road  is in the central place of the Mussorie. There are many shops , where you can  buy clothes from cheap  quality to branded and also souvenir and handicraft items", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r497347085-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Big opportunity", "review": "Awesome place I've ever seen . These are MY brother pics with his frnds . We have our school trip to mussorie so from their we visited kempty fall , mall . Company garden from ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r493896417-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Happening part of the town", "review": "The mall is a long stretch of road between Picture Palace and The Library. Almost all the shops and restaurants are lined up on this road. You get to eat various types of food both in the restaurants and on the street. You will find kulcha chole, aloo tikki, soups and momos to name few street food which are delicious in the cold weather.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r498562482-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Mall Road, MUssoorie", "review": "A very average place and non happening compared to Mall Road of Shimla and Nainital. It is not a must do place in case you are staying away from Mall Road. The only ood shops are chicks Chocolate and one emporium.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r503740653-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Good for along walk", "review": "Mall road is good for a long walk with lot of restaurants and Hotels lining up. There are benches provided to take rest. There are lot of view points to stop by and enjoy. Enjoy your bread omlette in Lovely Ommlette centre. Or take the rope way to Gun Hill. Relax and enjoy the scene in the bench.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r510059716-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Family Outing", "review": "good for long walks on the road and can also catch up the movie on the Ritz or else i would not recommend for any shopping", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r512589808-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "BEST HANG OUT PLACE", "review": "Walking down the mall road in Mussorie is so blissful and entertaining.The place is simply amazing dotted with many shops,restaurants and food joints.The place was brimming with the holiday crowd lazily strolling around and most of them seen crowding the  shops along selling local souvenir and craftrs items.Vendors selling the fancy stuff are seen wooing the tourists add to glamour of the ever lively Mall Road.It is the best place to hang around peacefully as the tourist vehicles are prohibited to enter the Mall Road during a fixed time of the day.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r515420116-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Old world charm", "review": "Of all the hill station I have visited, the Mall of Mussoorie has the most scenic view. Although charging for vehicle for entry here is also unique.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r518633303-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "crowed but good", "review": "a 3k long market with much crowd. you can get everything from this market. restaurants, cloths, jewelry, everything available here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r516879065-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "vist once just because you are there", "review": "I visited Mussoorie in 1982 as a kid.....then smelt of popcorns and candy,......there was picture palace,.....it was clean .....skating rinks....etc etc....not anymore ......its dirty .....no picture palace....no popcorn", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r484006632-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Lifeline of Mussoorie ", "review": "You can spend hours walking on the road and enjoying the side shops. If u get tired, u can hire a cycle rickshaw too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r484163603-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Mall road", "review": "Our trip to mussorie was a bit hurry thing. So we missed a few things. Mall road is very conjusted. Ok experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r484350778-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Downtown Mussoorie", "review": "The Mall Road is the Main Street of the hill station.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r488142601-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "The summary of beauty, stay tips.", "review": "This place is iconic, which will be remain in your mind ever after, whenever you think about mussoorie. The view point situated here is the extreme point, where you can see, lots of things...in the daylight,you see the ultimate beauty of the dehradun (may be,yeah! it is) and mussoorie. something you realize top of the world type feeling, that feel cant compare any everest, because these mountains does not have Human activities, this point has both. on the other hand The View of Night from here....take my words, you cant forget lifetime, any camera can not capture this,unless your eyes...so now it is enough convincing to visit this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r485058595-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "All in one street The Mall Road", "review": "The mall road extending from the Library end to the Picture Palace end is around 3kms. It probably is the heart of Mussoorie the busiest place with all what you can think off - Shops small and big, Hotels, restaurants, way to Camel back road, cable car to Gunn Hill etc. The mall road is closed for vehicles from 4:30pm to 10:30pm making it convenient for tourist to stroll around free. There are enough cycle rickshaws for those who do not want to walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r489500713-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Another place to shop.", "review": "Nothing regional to buy or see, apart from a few shops. Abuzz with activity all through the day, you'll most probably pass through mall rd en route to a tourist attraction.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r492366800-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Heart of the Town", "review": "The mall is the heart of mussoorie. There are many shops, restaurants and hotels situated on the mall road. It is around 3Km road stretched from Picture palce to Library end. You can take cable car for gun hill from here only. It is over crowded in every season.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r492690927-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Average shopping location", "review": "The place is pretty ordinary. Already crowded and narrow, on top of which it is frequented by motorists and occasionally cars, which makes it very congested. Good for a casual stroll, nothing more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r458613313-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Average Shopping location", "review": "Compared to mall roads in Shimla and other hill stations the mall road in in Mussoorie is one big let down.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r460590160-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "nice summer break", "review": "relaxing and moving for evening walk , gives a break to routine daily ncr tired life ..its really a great feeling while being in mussorie", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r489791512-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Small but Crowded Mall", "review": "Small but Crowded Mall", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r469539811-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Avoid if you can", "review": "This is the worst part of Mussoorie. Avoid. There are several other better places to go and enjoy. However if the Mall is on your bucket list then visit the Jawahar aquarium to see some nice marine and fresh water fishes including the dreaded Pirhanas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r489275198-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "u can be here all day", "review": "well if you go to mussoorie,walking on  the mall, is the main thing you do and if weather is good that probably is all that you need to do ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r471282829-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Iconic Mall Road", "review": "The Mall Road is the pride and most visited place in Musoorie, the queen of hill stations.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r475740422-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Yes ....the very best of the lot .....", "review": "The Mall Road is the iconic place in the Mussoorie . On one end  Picture Palace and on another end Library Chowk encompasses the shops, restaurants to satisfy one's need of daily needs and food. The walk down the mall road gives a picturesque view of the valley and hills around it. A must and the best of the lot must visit places in Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r479657614-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "The Mall- The Best", "review": "Really its an iconic place of this Hill Queen. You will see here the mini India....You will see here peoples from other countries also.  all are enjoying the misty nature of Mussoorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r480841579-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Same as all Mall Roads", "review": "Similar to any other Mall Road of any hill station here also you will find attraction points for every member of the family.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r481785392-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "its good", "review": "the mall road is good for shopping. there are varieties in shopping for all age groups. it is very very long . we have to walk very much.a must visit for shopping peoples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r482853927-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Lifeline of Mussoorie", "review": "This road can be practically called the lifeline of Mussorie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r427239919-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "The Tarmac ligament that binds", "review": "This ligament of tarmac stretches from East to West across the southern facing portion of Mussooire.  From the Library building on the West side to the Eastern edge known as Picture Palace, this stretch of road is a very popular amongst the visitor to this Hill Station.  Where actual structures cannot be built on the north edge of the road, you will find tarp shops and when not possible, then you find the daily erected sites.  To the south, there are yet more hotels.  I was always led to believe the Mall zone was closed to motorised traffic but the two and four wheelers are ever present and warning, do Not walk with your elbows sticking out! Albeit, for this I have never failed to enjoy my stroll across the Mall.  Of course for myself the north side of this mountain presents a more tranquil walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r429616871-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Taxi not allowed use cycle ricshaw", "review": "The Good:", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r436555809-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Stroll down the mall road for relaxation", "review": "Its amazing and a must do activity for every visitor going to mussoorie. If by chance it rains, then it becomes even more romantic and enjoyable!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r431108009-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "TOO Crowded and its little better in evening only", "review": "Too Crowded and is better in evening only, can find lots of places for eating out, items avl for sale are overpriced,  therefore bargaining is required", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r430557426-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Ok okay", "review": "I think it needs lot of work to be done. During the day between 10-4 they allow bikes cars etc I think it shd be done away with like Mall in Shimla. May there are 2-3 places who have bar licence on Mall Road. There is huge Huge traffic jam at library point. Some thing shd be done. Ppl here are honest. Cant see much fashion on Mall ppl are simple. ️", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r437246496-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Nothing so Great", "review": "Average Shopping street which people might find in almost all hill stations. The worst part is the cars being charged Rs 150 just for entry inside the road, and that too when there is no parking slots available is to high. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r441757323-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Enjoy a day with heavy snowfall ", "review": "Waoooo... Nice place yr....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r450417709-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "A great place", "review": "The mall is all what mussorie is about most visited place and a well known market in mussurie everyone likes this place most", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r447377500-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Nothing in comparison with its siblings Shimla and Darjeeling", "review": "The mall is the mist happening place in any hill station. I find Mall Road in Mussoorie pretty ordinary in comparison with its peer group like Shimla or Darjeeling. There are good view of the Doon Valley. The place is clean and you have good range of shops. You need to visit this place if you are in Mussoorie in any case.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r454444171-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Beauty all around", "review": "Depends on the weather, the mall offers many scenic views. Just click your camera away and when you feel hungry, there are many options to eat from. Some good places to shop as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r384146030-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Full of variety and scenic views", "review": "Lovely place to shop stroll and relax.  Lot of hustle bustle with many good shops from low to high price tags with good eating joints on both end- picture palace and librawry chowk.  Nice paintings and sculputured walls across the mall.  Lot of activities and gaming zones for kids.  Overall a good experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r385210864-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "The best place to be", "review": "This is the best place to be, people walking along side safe for couple and girls, i enjoyed my shopping there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r223043230-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "tourist friendly", "review": "a nice place for a walk around to see a variety of shops. big brand shops have very high price tags and are only worth a visit to say you've been there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r384741480-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Very crowded but affordable", "review": "There are many restaurants for various budgets at the mall area. The Tavern is the best of them all. It is easy to find cycle rickshaws  to go to places nearby. A little further down, there's a bus stand that takes you out of Mussourie to Dehradun / Himachal Pradesh / J & K. There are many stores that sell artefacts and warm clothes here. The roadside sellers have some really nice boiled and roasted corn for just 10 or 20 bucks. Try their tikkis too!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r238291592-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "Keep walking", "review": "Keep Walking and enjoy the beauty....nothing more to say... click as much photos you want...but if you are travelling with sr.citizen make sure you are aware how much they can walk", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r234074162-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 3.0, "title": "A decent experience, if not crowded", "review": "The whole mall road is a nice walk in itself except the crowd, which brings noise and makes the place less clean that it deserves to be. There are many opportunities for nice scenic views across the road, and I enjoyed the walk itself. There are numerous shopping and eating options typical for such hill stations. It starts from library bazaar but the interesting eating options are on the other end. Inspite of the crowd, I would recommend this to everyone..... There is little to do in mussoorie but skip the kempty falls for this.........", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r388591249-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 5.0, "title": "Must  visit place", "review": "The  entire  area is  a  good   place  to do shopping with much bargaining.  Should not miss  this lovely place apart from your sight seeing. We  could meet the famous author-Ruskin Bond in one of the book shops here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r395000015-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Walk on and on.......look on .....and have pop-corn.....", "review": "The pleasure of along walk on the mall shall be a delightful experience......it streches from the the christ church well beyond the camels back road inter-section.....small teeny -weeny shops sell local fare from wallets,hats to sticks and such items of use ....the old buildings hold a special charm and the railway booking office looks like a railway station though there is none at Mussoorie.....at a way side joint we taste momos and they are heavenly.....there are other joints also where on e can sit by the window sipping tea....... te old railings still hold them selves .......the days have gone by but the memories remain......", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r397582707-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "The Mall", "rating": 4.0, "title": "Nice Place for hang out in Mussoorie", "review": "Were there with my husband and really enjoyed the foods , shops, street foods specially, cycle rickshaw riding , and many more love this place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297689-d3705031-r418739005-The_Mall-Mussoorie_Dehradun_District_Uttarakhand.html"}]