[{"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "My memories", "review": "I visited this place just after 40 years. It was an excellent place for meditation. I feel that some efforts are required to revitalize this excellent place for world center for meditation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r546874094-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Amazing- History and Art", "review": "The ashram itself is crumbling away, but it is fun to explore, you could spend hours walking about and finding new and interesting things.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r551044479-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "GREAT PLACE TO VISIT AND REMIND HOW IT ALL STARTED", "review": "Spend half day here, walking around and remembering how the Beattles were all here and the songs that came out of their visits. As of now it has been taken over by the UK government and making it in wild Tiger preserve. It is expensive entrance at 600 res, they say that will change and be lower, but doubtful. When they can get the monies ,they will keep it high. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r562040925-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles ashram", "review": "excellent place to just sit around, listen to yourself, managed by the forest department is not a good idea, there should be a spokesperson who actually know about the Beatles band & Maharishi Mahesh Yogi association, beautiful place though", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r564760102-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Chaurasy Kutian/Beatles' Ashram", "review": "It is the same Ashram which is covered under Beatles' Ashram. It was established by the Maharishi Mahesh Yogi in 1960 with all the facilities like big kitchen, a Post office, a Printing Press with research facilities and excellent design of accommodation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r578819453-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles Fans Pilgrimage", "review": "Are you a Beatles Fan? ….. Happen to be in Rishikesh? ….. Then a visit to the Maharishi Ashram is a must. I visited in 2012. Was the first and only person on the grounds that morning. Walked around singing songs from the 'White Album' that were written on these hallowed grounds. 'Back in the USSR', 'Dear Prudence', Ob-La-Di, Ob-La-Da!!! ….and so many more. Even Donovan's Hurdy Gurdy Man was written on these grounds in Rishikesh. So... once more …. If you are A BEATLES FAN..... you gotta go see this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r616580067-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles Ashram", "review": "Also known as Swath Ashram or Beatles Ashram, this is where the Beatles landed in 1984. Loads of graffiti to be explored in the green. It is under the care of the Rajaji National Park and an entrance fee is to be paid.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r623766453-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Maharishi Mahesh Yogi Ashram", "review": "For the millions of people around the world who are practicing Maharishi's T.M. technique, or for Beatles fans, this is the real deal! Built on leased government land in the 1960's, the forestry department has finally shown some interest in the abandoned site. Maharishi left in the mid-90's and the forest reclaimed the property. Now the place is being reborn as The Beatles Ashram. Lovely setting above the Ganga, the buildings are under repair, the property is fenced and protected, and it's being fixed up. There is already a nice Beatles photo exhibit in one of the repaired buildings. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r641656041-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Took some amazing photos here!", "review": "Took some amazing photos here of both stunning scenery, views of the Ganga, trees and graffiti art in the Beatles Ashram (and home of Transendental Meditation).", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r657292059-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Yogi Ashram", "review": "Maharishi Mahesh Yogi was an Indian guru, known for developing the Transcendental ..... The Beatles' visit to the Maharishi's ashram coincided with a thirty-participant Transcendental Meditation teacher training course that was ongoing when ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r649292713-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "BEATTLES ashram", "review": "Go back in time with the \" Beatles\" and take amazing yoga pose shots that you will impress your students with. AMAZING OPEN ART GALLERY", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r486245503-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "Must Do Stop for Beatles Fans", "review": "For a casual traveller, this is a generally interesting stop if he/she has extra time.  Only a \"must do\" location for Beatles fans or 1960s history buffs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r481822590-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "the old beatles ashram", "review": "This is where they came to get enlightened and to lean from Maharishi, what an amazing place, be sure to have some one walk you around that knows the place there is a lot you could miss if you don't know where to go or what to look for.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r488066005-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Transcendental Meditation inside the Rajaji Tiger Reserve", "review": "At the outset let me clarify that the Maharishi 's ashram is inside the Rajaji Tiger Reserves- the place is in a dilapidated condition and there are various caves where I guess the meditation used to take place. Cave Number 9 is apparently the cave where The Beatles meditated. Currently it is deserted but some beautiful wall graffiti has been done on the walls. Other than this there is a building which in my view is a more recent construction, but even that building is deserted. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r490876349-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles ashram", "review": "Ashram is a trip back in time. It is where much of the Beatles White Album was written. The artwork throughout much of the ashram is amazing. A must see for all Beatle fans.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r509185147-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 2.0, "title": "Can give this one a miss ...", "review": "The Maharishi Mahesh Yogi Ashram is located in a beautiful spot within the Rajaji National Park with the river Ganga flowing quietly behind it. It got the world’s attention when it briefly housed the band members of the legendary English rock band The Beatles in 1968. After being ignored for years, Uttarakhand’s Forest Department has reportedly converted the Ashram into an eco-friendly tourism destination.  There is an entry fee of Rs 150 for Indian nationals, and Rs 600 for foreigners. Note that  you need to walk quite a long distance from Lakshman  Jhula to get there .", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r533004915-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "amazing", "review": "This is an amazing place for beatles lovers.  we really loved getting here and exploring this place.  very peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r535331601-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "nice and peaceful", "review": "good ashram in rishikesh. very peaceful and enjoyable. location of this ashram was great. it is in jungle. must visit here if you are fan of beatles.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r536757459-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Simply Fab!", "review": "If you’ve heard of the Beatles and you’re in Rishikesh you simply must visit this tranquil place where the Beatles came in 1968 to stay as guests of the Maharishi. Recently opened to the public there is a surprising amount to see but it is what happened here, rather than what remains, which is of real significance. Whilst the Beatles were here they wrote at least 35 songs (some writers put it as high as 48) and it was their most prolific period of songwriting ever. Two thirds of the White album and two songs from Abbey Road were written here as was John Lennon’s Jealous Guy, although originally he called the song Child of Nature. It was to be the last time all four Beatles were together outside the UK. Entry is 600 baht.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r539216463-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Excellent Day trip", "review": "A wonderful way to while away a few hours. Yes it's a bit expensive but worth it to enjoy wandering through the slightly eery grounds, imagining what it would have been like 50 odd years ago when the Beatles were here. It's searching for and appreciating the amazing artworks which really make it a memorable trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r397312552-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Deserted ashram still fab!", "review": "Though the Maharishi and his celebrated guests are long gone, their spirits linger on as testament to the weird and wonderful 1960s. You can feel the presence of the Beatles here in the desolation that now reigns. Admission is a steep 600 rupees for foreigners but worth the price. You can wander at will and check out the murals drawn in memory of this interesting time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r541397125-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "History eaten by Nature", "review": "In Rishikesh, this is known as the Beatles Ashram, and I have left a review on that page.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r415729358-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 2.0, "title": "Very badly maintained", "review": "They charged a high fee for entry I.e. 150 rupees. One just has to walk through and think of the Beatles riding here. The goverenment could  easily make this a boutique hotel by renovating the. Each of these 84 stone huts has a bathroom and bedroom with a small closed terrace, will attract a lot of visitors  living in the rajaji sanctuary. What a waste of opportunity. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r432887150-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Beatles Ashram", "review": "Being a Beatles fan, this place was right on top of my to-do list in Rishikesh. I happened to reach Rishikesh yesterday. This place is quite isolated in the woods (very peaceful and calm :\") ) They have an entry fee and it differs based on if one is a student, foreigner or adult. This place is heaven for graffiti lovers from around the world and beatles lovers. Its right on the banks of the river Ganga and its crystal clear blue waters. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r433989478-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "also known as the beatles ashram", "review": "this is also known as the beatles ashram. it's 600 rupees for foreign tourists to enter but it's worth checking out. the ashram is quite large and not used anymore so a lot of the buildings are overrun with plants which makes it look cool. there's plenty of wonderful artwork over the walls in many of the buildings. there's also signage with facts around the place. we went later in the afternoon about an hour before closing which was good as we were the only people there. there's beautiful sunset views at that time too. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r448464945-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "Interesting because the Beatles and Dionovan stayed there", "review": "The local is destroyed, but is still interesting because its history, = beatles, Mia Farrow, Donovan, where the music Dear Prudence was composed, etc, etc, and etc. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r445537116-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Really interesting", "review": "Firstly the entrance to this is not signed. You need to go down the road for the Tiger Sanctuary that turns off the main road (don't worry, it's tiger free). It's a SUPER interesting site, think Hindu spirituality meets 60s Mod. The entrance fee is extortionate. 600 rupees for an abandoned ruin. Not clear where that money is going either as there seems to be no restoration underway. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r456824605-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "Nothing Out Of The Ordinary", "review": "The place is also known as the beatles ashram. Its just a regular place with nothing out of the ordinary to offer. Can be given a miss.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r463675526-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Breathtaking Graffiti and Haunted Ruins", "review": "I absolutely loved this place, soulful, haunted and mysterious. The aftermath of a very busy spiritual center it invariably inspires curiosity about Maharishi and his retinue of illustrious followers. A must visit if you're around Rishikesh. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r477341582-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "beatles Ashram, nice place to visit", "review": "This place is not very well indicated. It is an abandoned ashram which is now part of the indian government tiger park reserve. For this reason, the entrance fee is 600 ruppees for foreigners and 150 for indian citizens. It is very peacefull and huge. Very nice architecture of the buidings and cottages and there is a nice art projet going on. Unfortunately there is not really any explanation or manu signs so you got to wonder in the Ashram by yourself and discover. You can also spot black monkeys and we even saw a wild cat.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r472298868-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "The magic of Tempi Passati", "review": "The \"Beatles' Ashram\". Long since deserted and half way overgrown by the reconquering jungle. Like Maya Temples in Mexico. Amazing architectur still visible. Amazing location for walking, lingering and meditation. Entrance fee obligatory. Half hour walk downriver, leftside, from Ram Jhula bridge. On the way you pass a group of wild looking sadhus (Holy and not so holy men). They offer themselves as guides. Take one! (100 IR). Finally, take a dip in the Ganges, nice sandy beach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r325852501-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Famosu Once - Now a History", "review": "Maharishi Mahesh yogi Ashram is also known as Beatles Ashram in Rishikesh as in the winters of 1968 Beatle group with their wife's & Girlfriends came here for meditation session for more then a month. They get inspiration to write some of the most popular songs here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r328149308-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beautiful. Just one word!", "review": "This place is a must visit if you are looking to explore the entire Rishikesh with the same love! This is a little far off from Rishikesh auto-drop facility, but truly a worthy place to feel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r332394764-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 1.0, "title": "Awefully maintained, just cashing on Yogi & Beatles' name", "review": "Spread in about 5 Hectares of land, it is a place where Maharishi Mahesh Yogi founded an Ashram in early 60s and The Beatles visited for learning & practising Meditation from Yogi. In addition to a ailing building of Meditation Hall & 84 concrete huts, there are a few more remains of buildings. It sure may have been a great place in wonder years of past. Now, it is property of Rajaji National Park, Department of Forests. Absolutely no maintenance except for re creating the graffiti as the only value addition. Architecture of huts may be appealing for once but just for a view of these relics & part debris, this much of entry fee is certainly not justified. Nature has regained almost 80% of the habitat. So what if once Yogi lived here and The Beatles & others visited it? Visiting active Ashrams would be a better proposition.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r342936973-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Tastefully cleaned and landscaped remnants", "review": "Surprisingly, the forest service has done a good job of making Maharishi's ashram accessible, since Maharishi donated the property back to the national forest. The buildings are mostly in ruins, but signs show where meditation caves and lecture halls and cottages provided peace and unleashed a tremendous wave of creativity for the Beatles and many other great artists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r349918335-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Old is Gold", "review": "I visit Maharishi abandoned ashram last year while participating in Meditation Teacher Training Course at Shree Mahesh Heritage in Rishikesh. They had taken us for a day tour to Maharshi Ashram which was no longer active meditation place. I am surprized to see 84 small hut shape (tomb single room ) which is called Chaurasi Kutia. Which inspired me to go deep to learn Transcedental Meditation. My heartfelt thanks to the Great Meditation Guru who showed us path of TM.I am sure it would be very nice and peaceful place to get guru gyan.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r351109136-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "A sad place going back to nature.", "review": "I have learned Maharishi's meditation technique and knew the ashram was abandoned, given over to monkeys but was unsure what to expect.  You can see how magnificent the whole place must have been in such a glorious setting but the derelict buildings just bring up words like discarded, forlorn, bereft, achingly empty.  It would be a travesty to restore the buildings unless it became a fully fledged ashram again and to maintain them as they are feels pointless.  It feels right for nature to take over completely and return the place to its wild state. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r352937023-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Historical place", "review": "If you want to see everything in Rishkesh you can not miss this place. It is a great place where Beatles spent a little time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r358928437-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 1.0, "title": "sad , bad vibes", "review": "I was so looking forward to standing where Maharishi had once taught his TM meditations and where the Beatles had been and brought the awareness of the meditations to the western world .  My friend Paul was there when the Beatles were there .  He spent two years there and I wanted to revisit it for him .  I didn't realise it cost 600Rs. to get in !  The young and rebellious \" guard \" took no sympathy when I told him I didn't have 600Rs. and came half way around the world to be here now .  He was angry and militant and harsh .  He was so young I don't think he even knew who the maharishi or the Beatles were !  No respect is all I can say .  Much to my disappointment he turned me away .", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r364500104-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "A must see in Rishikesh", "review": "I loved every part of this place, the art, the ruins, even the graffiti provides interesting quotes and quirks to ponder. SOme say its a shame that this place is not put to good use anymore however I personally love the beauty that comes with seeing the ruins being claimed back by the jungle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r392129828-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Search for peace", "review": "Due to my hectic day schedule it was a blissful time to spend my few hours in the serenity of this ashram found my peace of mind and soul.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r256182653-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "aka Beatles Ashram... could well be an Indiana Jones film set", "review": "The Maharishi Mahesh Yogi Ashram... might have remained a secret had the Beatles not gone there... but they did and they put not only the Ashram on the map, but quite possibly Rishikesh. If you love to explore, you'll love this place. This is our 3rd visit and we always find something new.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r257510281-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Maharishi Mahesh Yogi Ashram – Give A Spiritual Boost to Your Existence", "review": "I visited this place with my family members a few weeks ago for meditation and some pooja rituals. It is a very old ashram and we loved its location. There was not much hustle and bustle and this gave us a chance to connect ourselves with God easily. I would really like the concerned authorities to pay attention towards this important site.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r261382630-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 2.0, "title": "Poorly maintained", "review": "Extremely poorly maintained place. Visit only if you are curious enough. There are better places to see in Rishikesh.You got to walk to reach there and then walk around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r283180056-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "amazing", "review": "murals by artists in the main meditation hall… this place had been abandoned for years but walking around you can observe the architecture and get a feeling of the community living here in the sixties. Do not walk alone beware of the wild elephants and fake babas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r289449777-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Spooky", "review": "Nice walk from Rishikesh to visit one of the first Ashram in town.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r293781810-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "amazing yogi in rishikesh", "review": "Yogi Mahesh is great teacher full of wishdom and amazing teacher of meditation and Hatha yoga. leading AYM Yoga Ashram in rishikesh. i have completed my 500 hour yoga teacher training with   yogi Mahesh in rishikesh and it was a life changing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r294826396-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "84 Kuti", "review": "This place has 84 small huts, concrete cottages. Beetles stayed here, but now only wild elephants stay here. But anyway, a good place to trek n enjoy the nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r299561858-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "So called Beatles Ashram", "review": "Well, the main reason of our visit was to see the famous place, where The Beatles stayed for some time and lived there. Now it's totally desolated, and jungles are coming inside more and more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r316486015-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "ashram mvm", "review": "mahrishi mahesh yogi is also one of great contributors in  the field of mediation and is now having ashrams abroad as well", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r323341192-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Fascinating", "review": "This is the ashram which celebrities attended in the 60s and I and many friends in 1970.  It was incredible to see how it expanded and then is being recaptured by the jungle.  Some of the magic is still there. There is talk that India may restore it as a historic site.  That would be worthy. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r199901226-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "beatles ashram- so very worth it!", "review": "see also \"the beatles ashram.\"", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r230328137-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Historical Spirituality for Cradle of Musical Creativity", "review": "An awesome place to see, my mind flashing back and forth with present images of decay and some natural destruction from the elephants, monkeys, and human actions, and images of it populated by men in dhotis and pajamas, walking about their chores, and also women devotees elegant in  their sarees. The architecture is amazing, a Vedic style, I am sure, but it seems softened to me, inviting, warm, gentle. I am curious as to the arrangement of rooms in the large Meditation Hall, and the many single meditation cones on the hillside overlooking the Ganga, what was Maharishi's intent for the arrangement of buildings and the designs? While here, the Beatles were inspired to write beautiful songs, that inspiration staying with them and impacting the world with their universal love presentations. I've been twice, and long to return. Ann G.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r233908320-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 3.0, "title": "Cool but creepy", "review": "Don't go by yourself & reconsider if you've got a fear of huge spiders.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r242746990-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Dilapidated Beauty", "review": "I love this place, it is a relic of days gone by, when the Beatles visited India in the 1960s and inspired hundreds and then thousands to visit mystical India.  It is larger than you would imagine, with interesting living pods and buildings full of interesting graffiti.  Be warned it is only supposed to be 50 rupees in, but the greedy guard will try to sting you for 100.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r245435733-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "My memories", "review": "I visited this place just after 40 years. It was an excellent place for meditation. I feel that some efforts are required to revitalize this excellent place for world center for meditation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r546874094-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "GREAT PLACE TO VISIT AND REMIND HOW IT ALL STARTED", "review": "Spend half day here, walking around and remembering how the Beattles were all here and the songs that came out of their visits. As of now it has been taken over by the UK government and making it in wild Tiger preserve. It is expensive entrance at 600 res, they say that will change and be lower, but doubtful. When they can get the monies ,they will keep it high. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r562040925-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Amazing- History and Art", "review": "The ashram itself is crumbling away, but it is fun to explore, you could spend hours walking about and finding new and interesting things.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r551044479-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles ashram", "review": "excellent place to just sit around, listen to yourself, managed by the forest department is not a good idea, there should be a spokesperson who actually know about the Beatles band & Maharishi Mahesh Yogi association, beautiful place though", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r564760102-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 4.0, "title": "Chaurasy Kutian/Beatles' Ashram", "review": "It is the same Ashram which is covered under Beatles' Ashram. It was established by the Maharishi Mahesh Yogi in 1960 with all the facilities like big kitchen, a Post office, a Printing Press with research facilities and excellent design of accommodation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r578819453-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles Ashram", "review": "Also known as Swath Ashram or Beatles Ashram, this is where the Beatles landed in 1984. Loads of graffiti to be explored in the green. It is under the care of the Rajaji National Park and an entrance fee is to be paid.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r623766453-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Beatles Fans Pilgrimage", "review": "Are you a Beatles Fan? ….. Happen to be in Rishikesh? ….. Then a visit to the Maharishi Ashram is a must. I visited in 2012. Was the first and only person on the grounds that morning. Walked around singing songs from the 'White Album' that were written on these hallowed grounds. 'Back in the USSR', 'Dear Prudence', Ob-La-Di, Ob-La-Da!!! ….and so many more. Even Donovan's Hurdy Gurdy Man was written on these grounds in Rishikesh. So... once more …. If you are A BEATLES FAN..... you gotta go see this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r616580067-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Maharishi Mahesh Yogi Ashram", "review": "For the millions of people around the world who are practicing Maharishi's T.M. technique, or for Beatles fans, this is the real deal! Built on leased government land in the 1960's, the forestry department has finally shown some interest in the abandoned site. Maharishi left in the mid-90's and the forest reclaimed the property. Now the place is being reborn as The Beatles Ashram. Lovely setting above the Ganga, the buildings are under repair, the property is fenced and protected, and it's being fixed up. There is already a nice Beatles photo exhibit in one of the repaired buildings. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r641656041-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Yogi Ashram", "review": "Maharishi Mahesh Yogi was an Indian guru, known for developing the Transcendental ..... The Beatles' visit to the Maharishi's ashram coincided with a thirty-participant Transcendental Meditation teacher training course that was ongoing when ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r649292713-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Maharishi Mahesh Yogi Ashram", "rating": 5.0, "title": "Took some amazing photos here!", "review": "Took some amazing photos here of both stunning scenery, views of the Ganga, trees and graffiti art in the Beatles Ashram (and home of Transendental Meditation).", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d3913364-r657292059-Maharishi_Mahesh_Yogi_Ashram-Rishikesh_Dehradun_District_Uttarakhand.html"}]