[{"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "I like cave", "review": "I have have in Hong Kong but this very better with temple and walking down into cave. Pictures are ver good to click beautiful cave to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r609079634-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful and Soothing", "review": "Its located around 20kms out of rishikesh and you have to use your own transport to reach there. The ganga river flows right through the ashram and just sitting on its banks will give you so much peace that you won't want to return. There are very few tourists there so you can have sometime to yourself sitting by the river. Its one of the most peaceful places in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r617335100-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must visit if you are on spiritual journey", "review": "Great place to visit if you are on spiritual tour/journey. The cave itself is not beautiful. It is located next to a Ganges beach. The cave is used for meditation. It's a dark small cave with thin cushions and you can sit down for a (short) meditation. You feel a special energy (spiritual or not). The entrance is free. And you can reach the cave after a 100 meter walk down (stairs). You can also visit the nearby beach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r620001761-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditative location", "review": "The time we went (just about closing time at 6 AM), there were not many people to guide and inform what exactly was there to see here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621247831-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful meditation on the banks of Ma Ganga", "review": "I travel here every year to meditate in this sacred place.  Authentic, peaceful, real.  You can take a taxi from Rishikesh easily.   There are stairs to walk down and there is a handrail.   It is dark in the cave with a subtle candle light.  Enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621312504-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silence and stillness at Vashisth Gufa", "review": "The entry into the holy cave is undertaken in groups or if you are lucky to have just one or two more people with you, that is possible too. Meditation inside the cave is usually in time slots of about 20 minutes, though you can stay longer if you wish. There are a lot of stairs going down and also a slope, so you need to be physically fit in order to visit this place. The elderly or those with physical restrictions may find it difficult. Decorum must be maintained since it is a spiritual space, recommended to wear modest clothing and to be in silence.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r634385851-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Worth visit", "review": "A bit far place but worth. Peaceful, calm and serene. Small gufa where you should sit in silence for 10 min and feel the vibes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r639072549-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Awesome place..", "review": "we went there and then reached the Ganga ji ka kinara and had holy bath there. it was very refreshing and quite there, and no concrete ghat really made the experience.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r633491219-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must see thi", "review": "Peaceful, and away from the town and noise. Spectacular scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r643455259-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silent Meditation Point", "review": "Away from the horde of the people, Vashishta Gufa is located on the banks of the River Ganga covered by the Himalayas in a peaceful and archaic location. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r578980145-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Spiritual reincarnation", "review": "You need to visit this place for spiritual cleansing and reincarnation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r583429611-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Religious Site near Ganga", "review": "The cave is atmospheric and for those who meditate a chance to join the many who have sat quietly here over the centuries- it’s more about the history and the Epic devotion than what to see- then take the steps down to the river for beautiful vista and quiet contemplation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r659027856-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "Not very special", "review": "I heard a lot about this place from the locals but this was not as great as I expected. There is a lot of walking and it is very far from the city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r587084950-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "Nothing special ", "review": "There was nothing special about this gufa just I think some spiritual reason. Waste of time and money ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r589384098-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Quaint location !", "review": "We were staying at the glasshouse on ganges and with absolutely no interest in venturing in the insane Rishikesh traffic we walked down here. It is about a good 20-25 minute walk but its extremely scenic and lovely experience. The gufa per se has nothing much to do but its intriguing to visit and explore. But once you step on the river bed from the gufa there is another small gufa which you ca go all the way inside and its a peaceful experience to sit and enjoy the river ganga and views of rafters passing by. Worth the walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r590430170-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Peace and peace", "review": "Sat by the banks of the ganges for several minutes amidst complete silence and nature all around you. However, some workers there ask for money in the name of 'cow service', good thing is they dont pester too much. Great place to spend a few hours when the weather is nice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r593906530-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "enthralling spot, MUST SEE", "review": "Going down the staircase (quite long) was a bit tedious but absolutely worth it. This is one of our best spots in the entire trip to Rishikesh. The silent , energetic gufa, the chantings and the ever fascinating Ganges flowing by the side. MUST SEE", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r600036244-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "Not very interesting place to me. ", "review": "As per my experience, solo travellers be careful while visiting this place. While I was there I realised Very few visitor visit this place. Authorities ? ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r594904429-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "Visit to Vashista Gufa", "review": "I visited the Vashishta Gufa during my recent stay at the Glasshouse on the Ganges. While this place has historical and religious significance and provides a unique meditation experience in the cave, directions to the place and general accessibility was an issue. Such places of worship and spiritual significance must be maintained better with an emphasis on cleanliness.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r603176175-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "A unique historical temple inside a cave", "review": "This temple is built inside a cave and has its connection with history since the times of Mahabharata i.e. thousands of years back. Its not very beautiful but still a unique experience for someone who loves meditating.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r561640446-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Interesting place", "review": "This place is 30 to 50 minutes away from Rishikesh and has an interesting history. The cave itself is rather small, it cannot accommodate a lot of people. It was an enlightening experience meditating inside the cave even though it was a bit challening as people were rushing in and out all the time making noises. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r564268128-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peace and tranquility ", "review": "This place is very special.  I didn't know much of the history of this place but the husband wanted to go.  The inside of the cave is beautifully dimly lit and has a Shiva lingum.  The energy, peace, and tranquility is wonderful.  Apparently a few people came in and out and shuffled around and disturbed my husband who was trying to meditate.  However I barely noticed them, I was in meditation bliss.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r565875266-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Wonderful place for the spiritually inclined!", "review": "The Vasisht gufa is situated around 25km from Rishikesh. You would have to walk down a mountain to reach the cave but the walk is worth once you reach the cave. The inside is dark except for dimly lit lamps at the Shivlinga, but nothing matters once you sit down and close your eyes. You feel peace and sit unaware of time passing!", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r564655261-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "impressing exeprience", "review": "in this cve as well as in the other one closer to the river is a very strong energy present and a spiritual atmosphere that draws one into internal peace and claritiy", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r566054067-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Very Sacred Space", "review": "This is an amazing sacred space. A priest chants before the entrance of the Guha (cave). Going inside is amazing. You get an idea of what it's like for individuals who renounce everything in order to become a priest. The renunciate will sit for many days in meditation. Of course, this is not what you, the visitor will do, but please understand that this is a holy place so it's important to be respectful of the area. There are also cows present (behind a fence), and a singing  Swami - Gitanandaji Maharaj- who plays the guitar while chanting mantras.  If you love his performance, you can even purchase his CD. Don't miss going to the Ganges and watching it's beauty flow over the rocks. Also important for you to be sure-footed, as areas are rocky and there are steep steps.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r567756022-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A holy shrine", "review": "The cave is cold and damp.  There is only a small lingam, but meditation is so very deep.  It is said that the sage Vasishta who taught Ram meditated here", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r570873900-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "spiritually moving", "review": "The cave is a very spiritual place which can be felt when you spend time inside. Situated by the Ganges it is a memorable place to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r573034869-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Ashram of solitude.", "review": "A worthwhile drive from Rishikesh.A small cave room where you can sit and meditate. A fantastic energy and vibe.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r572812925-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Out of the world", "review": "Situated around 16 Kms from Rishikesh , this is the place where saint Vashishtha did a lot of meditation for several years. Swami Purshottamanand , a saint from south came here and established this place . It's a small cave with a sivalingam and very peaceful place . A must visit .", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r575964680-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful, serene", "review": "This is a wonderful place to visit while in Rishikesh. It's less that an hour's drive up the mountain, beautiful scenery along the way. There is a bit of a decent to the cave so the hike back up is a bit steep but short. This cave is a very conducive place to spend some time in quiet meditation. After visiting the cave, take a short walk to the edge of the Ganges nearby for more stunning scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r541018828-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "very peaceful place", "review": "this place is far from rishikesh but very good place with natural beauty.not crowed. visit early morning if you want to enjoy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r541019885-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "My soul get peace and calm so much", "review": "If somebody want to calm down mind and soul best place near Ganga River , and best place for meditation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r540969642-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Memorable place", "review": "Must visit the ashram. Wonderful feeling inside the cave. Make sure to reach ganga river and meditate on a rock. True nature feeling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r541609332-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "Good for a visit", "review": "Quaint cave temple on the banks of the Ganga. Apparently the cave  has certain vibes and is a good place for meditation (though I did not feel anything, another member of our party felt the peace!). The banks have a nice beach partly sandy and partly rocky. Good place to go, and children will especially enjoy the beach, but not very mobility friendly as there are steps and a slightly steep path to go down to riverside.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r544200550-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Very Peaceful Visit for Meditation", "review": "This is a very old cave known for meditation. The location is easy to reach by car from Rishikesh, takes about 45 minutes on winding roads. There is a very steep staircase going downhill to the cave, so you must be physically able to walk down and climb the steps back up. Once down the hill, there is a small ashram with a collection of cows, and they will ask for donations \"for the cows.\" I protested that the cows were tied up too tightly, as is customary in India. But don't hesitate to bring some fruit or vegetables to give them while you visit. After passing the ashram, the path brings you directly to the cave itself, and it is considered very sacred. You must remove your shoes and refrain from taking photos. You can meditate in the little courtyard outside the cave, or you can enter and find the peace within. There is a path that leads down to the Ganga, and you may walk to dip your feet in the water, or enjoy the sunny banks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r543498303-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Ancient beautiful profoundly peaceful cave", "review": "We went there on recommendation by a friend and just as my friend has described my husband and I felt a profound sense of peace in the cave. When you enter you feel the mountain is embracing you into it's womb. Simply close your eyes and sit. Stillness overcomes the being. Time ceases to exist.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r551373936-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "It's just average", "review": "Went there a couple of weeks ago with my 3 yo son. I didnt find anything outstanding about the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r545956740-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Magic place", "review": "This pace is receable by the local bus from Rishikesh. Once got inside the cave it's easy to feel the magical air you breath. The strong energy makes your body warm and you go into meditation very easily.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r553460194-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "\"Amazing natural beauty around\"", "review": "You can reach this place by walking downhill (not even 5 minutes) from the Rishikesh-Badrinath Highway near Shivpuri. It's a small cave and you will find few people meditating in front of a Shiv Linga. You can go in but remain absolutely silent and make sure you do not disturb the meditators. The cave is on the banks of of course the Ganga with beautiful white sand. It is nature at its best. Best part not many people around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r468382213-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Magical place for meditation", "review": "Once you get in this cave, you will be surprised by the special energy. It is completely silent but at the same time you can feel and listen to that special silence. Hard to explain in words", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r558609058-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Magical place", "review": "I arrived there early, at 8 o'clock in the morning. While there was no one, I enjoyed meditation alone. A magical place with very good vibes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r472111413-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Worth a visit", "review": "This is indeed a very ancient cave, it has mythological background and the caretaker is a very old saint, very courteous and blesses with chocolates...indeed worth a visit if you are in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r473514712-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A perfect Early Morning getaway for Peace & Meditation and Ganga beach", "review": "It's a perfect location to visit in early morning and if you want to relax and meditate by sitting on the side of the great Ganges river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r477767127-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A hidden sanctuary", "review": "Just 25 kms away from Rishikesh. And you step into eternity. The place is so quiet and the beaches so clean. There is an octogenarian saint from Kerala who lives there and regales you with his miraculous stories.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r479201690-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "great early morning activity", "review": "visit early morning really great. it is very peaceful place. it is far from rishikesh but worth visit. take some photos with natural beauty", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r528848620-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "quaint, serene, lesser known", "review": "a walk from glasshouse to this place is worth the morning music amongst birds and cool breeze. leave early in morning and reach here for some mediation inside the cave. Its not too deep. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r491687390-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "a very serene place to be", "review": "The Place is away from Rishikesh but the view is too good and needs to eb visited if  one likes to meditate and have a holy bath ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r535814149-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Good place to meditate", "review": "The cave is not very deep but many people come there to just sit and meditate for a few minutes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r537867458-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "go there if its your calling", "review": "This place was not at all on our todo list. we somehow ended up reaching here on the last day of our trip , almost like it was a calling. Thanks to my wife who wanted to ride around shivpuri for one last time before leaving Rishikesh, we ended up at vashish gufa.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r452020000-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "nice experience", "review": "I went with my classmates in the morning.  The whole area, the greenery, and the view of the mother ganga was beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r450503412-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Inspiring for still meditation", "review": "I have been there,  whenever I visited Rishiskesh to feel the blessings of that saintly vibration. If someone so highly exalted as Vashista rishi has been absorbed in their advanced sadhana, spiritual practise there,be ready to feel this personality in their subtle existence. Connect, pray and feel blessed. Will come back again and again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r450499460-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "nice excursion", "review": "We visited this place from our resort Aranyam on recommendation of the manager. The drive to this place is beautiful and the gufa area is serene and quiet. Good to spend some time with peace.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r446006797-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Spiritual place", "review": "Nice place of history and spirituality, excelent cave for meditation. Place very close to Ganga river with a possibility to swim", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r461485864-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Must Visit place in Rishikesh", "review": "A temple built in a cave, a must visit place in Rishikesh. Trek is a bit tough, but worth the efforts. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r455357753-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Serene and Peaceful", "review": "We loved the place and it turned out to be much better than our anticipation. Positive vibes and right near the banks of ganges.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r458889011-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "very peaceful", "review": "This place is very peaceful.  it is not much crowded,  you can spend hours for your inner peace.  it is situated on the bank of Ganga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r458046296-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Beautiful scenery", "review": "I went with some friends. We wanted to meditate within the cave but sadly some noisy tourists arrived. They were actually eating crips, using their cell phone and talking within the cave. Clearly not respectful of those around them or the signs outside the cave. They ruined our experience there but we found some other caves outside next to the water which was idyllic. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r466545880-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Please respect the silence here!!", "review": "This is not a place to hang around with families and take selfies inside the cave!People come here looking for something beyond what we see and experience in our daily lives.Please respect those that are meditating inside and if you can't find anything that resonates within please leave without disturbing others.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r463643467-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Great place for the wanderer in you searching for peace", "review": "Make sure you spend time here. Its a great experience, just doing nothing but sitting alone , quietly in a cave.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r429558046-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A shrine calm place to visit", "review": "This place is on Badrinath road around 20 kms from Rishikesh toward uphills. However, it does not seem eye catching at first site, inside cave is totally different. You will feel the difference once you meditate inside cave for 1-15 minutes. There is pitch dark inside and no one is allowed to speak even a single word. This is totally a religious place. so come with good thoughts. The temple compound is also nice with some fruits trees and fishes at river bank. So, if coming with family, it's worth to visit this place. Should be avoided in Aug-Spe month due to landslide on the way.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r431529724-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "The cave beckons me all the time", "review": "Vashishtha Gufa has an unbelievable level of positive energy and vibration. Once you enter inside, the silence is deafening. If you sit inside, close your eyes, be quiet and calm your mind, the experience that you will go through can't be expressed in words. It is only meant to be felt. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r432877815-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Divine place of serenity and peace ", "review": "The vashishta cave is about 25 kms from rishikesh. An extraordinary place where peace reigns supreme. You descend a flight of steps and come to a small ashram. A small edict gives information about this cave where sage vasishta, one of the seven saptharishis is said to have meditated thousands of years ago. Other saints have meditated here since 1928 and attained salvation. Blankets are spread on the floor of the cave and one can enter and feel the energy and peaceful vibrations. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r436832882-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "A Place to find Divine peace", "review": "I had the great fortune to visit Vashishth Gufa during our last trip to Rishikesh in June'16 and I'm simply floored by the calm and peaceful surroundings there.  We sat there for about 30 mins and offered prayers in the Gufa and felt very happy within.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r434452382-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "visit this If in search of peace", "review": "This place is around 20 kms from Rishikesh, the cave is dark and lit only by small diyas and the experience once you get in is un-describable, it is so quiet that you can hear your inner voice and being in this cave for 5 and more minutes will ..........., cant even  describe. Visit this place only if you are looking for some serious peace SHANTI it isn't the place for those looking for adventures or excitement or as a tourist spot.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r434454126-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 3.0, "title": "PEACEFUL PLACE WITH QUITE WATER FRONT", "review": "It is 20 kms from Rishikesh, A soulful and peaceful place for people who like meditation.   Its water front is going to be great place for photographers and kids. If you have spare time in Rishikesh, then you can visit...", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r437363639-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Yoga retreat ", "review": "Visited the Ganga and the cave on a beautiful day in November 2016! Seeing the place where many of our yoga teachers were inspired to transcend the ego and end suffering! G", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r439402402-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Wonderful Meditation", "review": "Please don't go if you are not going to meditate. It is not a tourist designation. If you do go, please be respectful and don't take pictures or even whisper.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r444374303-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Divine Place", "review": "Go there to meditate, to expereince the divine vibrations. You can see rudraksha trees in the garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r441890557-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "lights captured in  visited vasita gufa", "review": "I along with my wife visited vasita gufa on our return journey of chardham yatra in the year 2008, I took a photo in the cave and streak of light appeared in my photo, if any body wants the photo please mail your email. id  i will provide the photo", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r385230074-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "awesome meditation site", "review": "Only 23 km up river from Rishikesh, this is one of the great meditation sites near the banks of ganga ji. a great motorcycle ride or taxi ride. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r386918778-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Feels Divine", "review": "About 21 kms away from Laxman Jula on Rishikesh-Badrinath Hwy, this place is like no other place I've seen. The cave where Sage Vashista meditated is about 10 meters long. Once you enter, you get a sense of peace that you've been craving for or have at least imagined at some point in time. Stayed inside the cave for about 30 mins & came out a changed man. Need someplace peace and quiet - This is a must-go places, esp., someone who believes in meditation. The caves close from 12noon - 3pm. So, plan accordingly. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r390967658-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Tranquility", "review": "The best place I visited in rishikesh. Quiet... It was not crowded when I went so it was the highlight of my trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r389377645-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 1.0, "title": "Small cave... ", "review": "It's a very small cave hardly 5 mts, but clean. If you are really Into yoga / meditation then go here. It's near to Rishikesh. There is another cave near which is also very small.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r391012970-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditation in True Sense", "review": "It is located 20 kms from rishikesh. The cave is as small as 10 meters but it is a perfect place for people who love to meditate. Their are mats spread for people to come and sit in silence. The cave is a part of Vashishth Ashram located on the banks of the river Ganga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r393492636-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A Memorable Meditative Experience", "review": "Cave is a very good experience for those into meditation as one can feel the positive vibrations while inside the cave... the water of Ganga and the entire scenery has a simply mesmerising beauty ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r405526370-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditative place", "review": "Visited Vashishta Gufa and found very calm. Inside cave you get inner peace and feel like meditate for hours and hours. Sage Vashishta meditated for years here so the place is very divine. Inside there is small shiv ling which was shunning in dark.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r415543418-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "perfect place for meditation with rich history", "review": "perfect place for meditation with rich history, absolutely loved the place and the caves. even meditated here. love the surroundings. a must visit place in rishikesh with great spiritual significance. good for walks and quite safe.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r423701715-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "best meditation ever", "review": "this place has a beautiful energy and meditating inside the cave is amazing! you can breathe peace anywhere around. We went for a dip in the Ganges and it was magical. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r366752670-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "PEACE , MEDITATION ", "review": "I heared many times vashishta cave ( Gufa) with group of people. Best place for meditation. Holy people , holy cows   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r367162575-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Good place to relax", "review": "It is a nice sightseeing spot. Went here with friends on our recent trip to Rishikesh. Next to ganga ji it is a relaxing spiritual spot.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r421743734-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A place with difference", "review": "It may not be a ideal place for those who are not spiritually inclined.The place has very different aura altogether.The moment you settle down inside the gufa ,you are in different dimension.The surrounding adds to the calmness of the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r377173037-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Amazing place to relax and make mind and soul with heart strong", "review": "I always go here before alone and now I always go with my wife and both did meditation there and enjoy mother nature and mother Ganga ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r368169534-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Peaceful Place", "review": "u can sit in this cave, and meditate", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r376331887-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "By the Ganga", "review": "A place to sit & meditate, be it morning or evening, have to walk down from the main road connecting Rishikesh & Gular, approximately 16 kms from Rishikesh city. One can do yoga on the beach in front of the Gufa.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r374452094-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "peace of mind", "review": "This cave is serene and Calm perfect for meditation & peace of mind,Located at a short distance from Shivpuri,Very peaceful place and just sitting there quietly for 10-15 minutes rejuvenates the mind.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r384504304-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Finding bliss inside", "review": "This very special cave it is a place for meditation and finding peace. Be aware of schedule since they close at lunch time for few hours. Nice views and beach by the Ganga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r380899914-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Only visit if you want to sit quietly and enjoy nature or meditate", "review": "This is one of the best places I have visited and I will definitely come back here. It is located on the Badrinath highway (NH58). The journey to this place is just as rewarding as the final destination itself. There are two gufas or caves here. Vashishta gufa closes at 1 and opens again at 3. Arundhati gufa is just below this and remains open all day. You can also sit by the riverside and enjoy the beauty for hours. Please do not take pictures of the gufa. Let this place remain in your memory rather than your memory card. Also many people come here to meditate so please maintain silence and do not disturb the peace. Definite one time visit when in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r380586105-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Calm place with exotic river n hilly view", "review": "we have gone to this place in summer, rainy, winters. every time it is different. cave is 15 kms from laxman jhulla after shivpuri. there are around 150 down stairs. then you see white ganga beach and on right side roberts cave. we use to bath here in ganga and meditate in cave. if you are lucky you can have a lunch as prasad.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r356921560-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Ananda - Peace. Absolute Peace. ", "review": "The stairs to get to the Cave are steep - so it's fun and easy downhill, but if you have really bad knees, the return to the road will be difficult. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r357486286-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashista Cave", "review": "Very peaceful place on the banks of ganges. try to spend more time. Keralites are there more.stay blessed. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r357734548-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful and Inspiring Place", "review": "Very peaceful and quite to sit and meditate. The area is well-maintained and clean.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r378106424-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A definite MUST", "review": "We meditated there for an hour. The silence and bliss were incredible. Only 35 minutes friom Muni Ki Reti", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r358092874-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashishta Gufa- A Peaceful Place for Spiritual Enhancement", "review": "Vashistha Guha is located 25 KM from Rishikesh. The Holy ashram of Swami Purushottamanad Ji Maharaj is located here. The cave is pure bliss for meditation. Lately the place has become a tourist attraction and many tourists throng there causing much disturbance to the meditating souls. However there is another Guha or cave nearby called Arundhati Guha and if someone truly wants to do a peaceful meditation without being disturbed this is the place. All said and done meditation is not to be done at a common place easily accessible by mass public. So sitting at Vashistha Guha if your meditation gets disturbed please don’t complain and go over to Arundhati guha.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r358636390-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "ALWAYS MY FIRST STOP WHEN COMING TO AREA", "review": "This is well known meditation cave around 45 mins north of rishikesh. you will need a taxi to take u. walk down some steps and then proceed to end. there is the cave, u walk in very quietly and sit down on ground to meditate. this is all you do here. might need small flashlite to find you way. also, since it is on the banks of the ganges, good place to take your ritual bath. if your lucky you will see the swami bramananda when his door open. he is 85 and been there 60 years.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r356154030-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Meditation place", "review": "The cave that is known as the gufa in hindi..is a must must visit. Such strong energy..vibration.. Cannot be expressed in words.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r358656039-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Great Meditaton", "review": "If you are a seeker, you must visit this place, will get positive vibes, and will be very peaceful. Jai Gurudev", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r360112007-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Speechless and so Tranquil", "review": "This place is about 25 kms from Rishikesh and is a must visit if you are a deeply spiritual person. From the moment you enter the property you start feeling serene and when you finally enter the Cave, you have the most blissful experience you could ask for .  I went there  with my husband, two kids and elderly parents and we all sat down to meditate in utter silence. It was one of the most meaningful and powerful meditative states I have ever expereinced   We went there around 5 pm and stayed till closing time and it was the  best experience ever. Later we went down the steps by the side of the Ashram and sat by the Ganges where the water is still clear turquoise and the mountains resonate with the tranquilness of the place. This place is a must visit for the Soulful seeker.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r361774521-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Peaceful meditation in a cave", "review": "A short distance from Rishikesh, about 20 min by bus, this is a very peaceful place on the Ganga river to come for a meditation. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r325201084-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Sad the way its being advertised at tourist attraction", "review": "Sad the way its being advertised at tourist attraction. Its a sacred place and heaven for meditators. In case you do not mediate you will not understand the signifinance and it will be a timewaste for you and nuisance for the meditators. Deeply saddened to see how hotels and tourist centers are promoting this place. Instead of silence at times, this place gets filled with cheers and noises of incoming tsunami of tourists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r330243639-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "new experience", "review": "such a peaceful place and very neat and clean.. very well maintained.  seek blessings whenever u are there in rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r338071405-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 1.0, "title": "Nature Walk", "review": "We went down the hill to this place. Steepy Steps. Go along in a group only. Babas on the way smoking chillams makes it bit scary. The gufa was closed when we reached there. But the Ganges view was awesome. Simply the best. Mesmerizing!!! Just 10 to 15 minutes walking distance from road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r342593344-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Cave for Meditation", "review": "I heared many times with my freinds about this cave but finally visited myself and found this place is awasome. Best place for meditation...beautiful river bank. It close 12 to 3 during noon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r342603069-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Good place to visit & try to meditate, by river Ganges.", "review": "Its is a very different place, a cave used for meditation, discovered by a saint much later & used by him to meditate & make this place known to common public. Not surprisingly, the wife's meditation place is set away from Muni Vashisth Cave... Must spend 20-30 minutes of meditation time in cave, followed by a small walk to the river bank ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r343236890-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Heavenly, Peaceful & well maintained cave.", "review": "Worth spending 30-45 minutes in silence to experience the vibration of earlier Rishis and shadhu's & how they managed to connect to the God & attain the ultimate objective - oneness with God - Samadhi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r349028302-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Quaint and Peaceful Cave and Riverfront", "review": "Although we have been visiting Rishikesh for many years now, on our list visit we managed to visit the Vashisht Gufa for the first time on recommendation from the owner of our hotel. We had heard that the place gets crowded during the day and we decided to be there early to beat the crowd. We reached the place by around 9 in the morning and there was only one more family there other than ours throughout our stay there. The time we spent inside the cave was great, the experience was really beautiful. After we came out, the priest of the cave suggested that we spend some time by the riverfront as well. It was so peaceful and the views were so beautiful, that we landed up spending over an hour just sitting on the socks by the Ganges. Overall, a very beautiful experience and on my must visit list for Rishikesh henceforth.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r349352501-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Enjoy some lone time at Vashisth Gufa (Caves)", "review": "The place is serene and Calm. I believe that some of the Tale about the place is True but can not comment in details. the beach next to the Ashram is a place where you can relax and enjoy the flowing River !!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r308010390-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Mesmerizing Engery", "review": "I had visited Vashistha Gufa and Arundhati Cave last year for learning Meditation and to understand importance of meditating in Cave. It is truly amazing place for self realization and to go deep within. I had practice for some hours for a few days and it inspired me to become a Meditation teacher. I am thankful to Prist who allowed me to practice some hours in a day. My experience of practicing meditation was remarkable and self healing. It is far from other touristic attration of laxman jhoola but closed to bank of Ganga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r351113860-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Love it", "review": "I love it here, though they have been 'improving' the place in ways that I don't feel are improvements. The cave doesn't need a door to enter. It was much better when it was just a normal cave. I really like sitting there around dawn and meditating, then going out to the river. The location is beautiful, overlooking the Ganga and away from the road. You do have to walk down a path maybe 100 meters or so to get there, but it's worth the walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r303263278-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "best place for meditation", "review": "Looking for a peaceful place to do a little of a meditation, then don't  miss the chance to visit vashist cave and do meditation at least for half an hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r308448692-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Lord Shiva at Vashistha Gufa", "review": "It is really an inspiring place to sit in silence and pray or Meditate. I often go there with Meditation school - Shree Mahesh Heritage students to show them Meditation Cave and let them experience serene surrounding.It is one of the best place to have bath in Ganga and pray in temple. If you are going after 1 pm..then will have to wait till 3 PM. But you would not be disappointed if you are spiritual lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r310279282-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Uplifting", "review": "I've been there on two occasions.  The ashramites were most gracious and I enjoyed the lunch prasad and the loving way in which it was served.  The cave offers a deep meditation experience.  The only thing missing nowadays is the presence of Swami Shantananda who has recently taken mahasamadhi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r311746577-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "The area outside the grotto is heavenly", "review": "It is nice to visit the grotto but what I found very impressive is the area outside the grotto, especially the place near the river. Make sure to spend an hour there, relaxing, enjoying the wonderful nature, and the ganga river. It was one of the best places for me. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r315255443-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Historical", "review": "This is very nice place. You can meditate there, it's quiet and calm inside. Please note, that it's losed from 12 am to 3 pm", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r316480619-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Visit for the Cave as well as the Ganges", "review": "Located a short distance from Shivpuri, a good place to visit. There is a small walk from Ashram to the river bank which should not be missed. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r316505247-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Best place to visit for meditations", "review": "Always go here everythime in rishikesh. Need to hire taxi to get there around 600 rupees. Spend some time in cave meditating,very powerful, sincere seekers only to get true benefit. Not a looks loo place, lucky to find resident swami when he is out. Great man, also, place to take dip in ganges. Must wear bathing suits.this is a must visit place for the meditators amongst us", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r324871508-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "quiet getaway", "review": "It is a quiet place, away from the hustle bustle of the town, mostly frequented by foreigners. it is closed in the afternoons, so check the timings. one gets a lovely view of all the camps near ganga, people rafting. one can sit by the rocks at the shore of the river. lovely experience for the quiet, nature loving sorts.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r268266538-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "A Tranquil experience", "review": "The calm gufa is the ideal spot to meditate. It opens at 7 in the morning and is closed in the afternoon from12 to 4. A series of steps lead to the gufa. U have to park your vehicle on the main highway itself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r270444723-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "pure BLISS", "review": "This is an ideal place for the meditative person. Go and sit in this dark cave, with only a traditional oil lamp that is lit, by a small shrine to the rishi who lived in this cave. Go and sit and be still and breath for as long as you can. Then afterward walk down to the ganga and go for a swim! Its simply one of the most divine experiences !", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r270815923-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful to meditate", "review": "When we meditated here, it was very different. We were the only people in the place and the experience was very different. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r270911565-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Tranquility", "review": "Beautiful little cave with a large temple built around it. There are few people who visit this place as it is quite a distance from Laxman Jhoola, and one has to take a taxi to get here. The cave is situated on a stretch of river which is a wide sandy beach. It is a very beautiful and peaceful place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r289023319-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Interesting to visit", "review": "The walk to Vahishta Gufa can be a bit steep for older visitors. managed to keep my balance on the way down. But it was well persevering as the river Ganges is nearby and went for a wade whilst waiting for it to re-open. Extremely peaceful, quiet and clean. The cave itself was very cool, welcoming from the heat at this time of the year. Very serene experience where you can meditate in a beautiful setting with such a awesome history.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r287623509-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "If you can walk", "review": "Its a very nice place to visit on bank of river Ganga a holy cave and ashram with its religious values. The river side also has a good view. And cave is always cool even if it is too hot outside. Beware of monkeys. And its about 300 meters walk from where you can park your vehicle", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r287076849-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashishta Gufa", "review": "It close at 12 noon . Take a bath at the calm water near the river full of rocks . There is another small cave down the river beside the camp area , Arangidi Jakama Cave which is only a small opening only 3 persons can sit in the open , wife of Vashishta . After bath then visit the Arangidi before going to Vashistha cave to meditate or relax. Its cool . At 5pm there is a prayers on top the Temple opposite but close after 1/2 hour or so . It's the guru who has samadi there a statue and a Linga .", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r278955013-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "The most sacred place in Rishikesh", "review": "This cave is located outside 15-20 kilometres from Rishikesh and is the most sacred place to visit if you are ever in Rishikesh . A little away from the main road - the path will take you down towards the the cave which is situated near the holy Ganga .As you enter the dark cave which is deep and roomy - the Shivlinga with the flickering oil lamp in the cave becomes visible after your eyes adjust. The feeling of the being inside will leave you speechless and playful .Too beautiful . Worth coming here and spending some time here . The ashram adjoing to the cave manages this place . There is food for if it is lunch time . There is an elderly swami ji if possible meet him . There is a nice Goshala ( cowshed) too . A must visit and feel blessed .", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r291509013-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Excellent cave.Peace of mind here.", "review": "Excellent experience.peace of mind in this place.no sound pollution.we can meditation here.The ganga river is flowing near by.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r290453264-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashishta Gufa – Cool Place for Meditation", "review": "If you are visiting Rishikesh, do not forget to visit this place. I took my parents to this place and they loved the ride to this divine place though it took us some time. My parents went for a three day meditation trip and I accompanied them. With greenery all around and Ganges flowing nearby it is a divine experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r261377104-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Been going there since I was 5, now I am 27", "review": "It is one the most serene place on earth, how I know about the place being so young, well Purushottamananda was my grandfather's teacher (nanaji's guru) and all of us went there, I loved the lovely stroll down the hill on the ramp, then the mango trees when you reach, the kitchen besides, mandir on first floor, ganga maa in front, I still have so many stones collected from that shore and best part was evening aarti and gufaa, aarti is sound ON and all resonating with inner self but gufaa tears you apart in ur thoughts and best part, now one stops your from going in and meditating, last I went was 3 years back", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r256608511-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashistha Gufta – Nice Set of Caves", "review": "I had heard a lot about this place through different platforms and planned a trip with my family members. Though it was crowded but we opted for a stay at the ashram located nearby to visit this place again. We explored the caves on our second day with the help of our torches and did some meditation there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r261381070-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "A Nice Place", "review": "Vashistha Gufa is familier to those who visit  Rishikesh regularly. You have to climb some for entering the Cave. The Cave is dedicated to Vashistha, one of 7 Sages. Realy a spritual Place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r261454760-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Instant deep meditation inside the caves!", "review": "Our kirtan and bhakti tour group made a stop here, and we were all extremely impressed and inspired by the energy here. Inside the cave was a deep stillness unlike anything else I have ever felt. I regularly meditate, but it usually takes me about 10 minutes to get my mind nice and settled - but upon taking a centering breath and closing my eyes, I was instantly in an extremely still, grounded, and focused state. It's rare that I reach that kind of being in meditation - but there I was! Most everyone else in our group remarked they also felt themselves drop into a really significant space while in the caves.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r261914280-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Truly Meditative space", "review": "Sage Vashishta - one of the Saptharishis is supposed to have meditated in this cave ... I truly sensed the sacredness of the place and the atmosphere elevated my awareness to a sense of a higher conciousness . The location is beautiful , beside the mighty Ganga river in which you can take a dip and spend time stiing on the banks with the cool water flowing over your feet. Please carry water and any other eatables required as nothing is available to buy. Do be responsible to take back your garbage and dispose properly . There is an ashram and sometimes rooms can be booked also. I am told that the entry into the actual gufa( cave) is only with permission now though we were allowed in in 2014.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r262791954-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "A LOVELY PEACEFUL PLACE TO VISIT", "review": "This is a great place to visit if you are seeking a quiet place to meditate. About 30 kms from Rishikesh and a steep climb down from the main road. Slippery when it has rained. The Gufa is not open the whole day and the Ganges is very quiet as it runs by the side of the Gufa.Give yourself half a day to enjoy nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r262820186-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Must go down the valley", "review": "A not-so-known beautiful, peaceful and quiet location on the outskirts of Rishikesh towards Badrinath. There is a cave where a Saint has worshipped and practised spirituality for years, giving the place good vibes. It is good day picnic spot provided you can maintain the cleanliness and tranquility of that area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r263353986-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "enjoy the peace", "review": "You have to drive out towards Shivpuri to get to Vashishta Gufa and then take a walk down a path to reach it. It is right on the banks of the river with a beautiful sandy beach. The cave it self is very peaceful and energizing. It has been built up all around with a big temple and what not. But the cave, the beach and the Ganga are there to enjoy. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r265159810-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "True spiritual experience", "review": "This cave, Vashishta's Gufa, is situated in the mountains just outside Rishikesh itself. Views are breathtakingly beautiful and one could sit on a rock inside the Ganges which makes for great photo opportunity. The cave itself is small and looks nothing special but the feeling of peace that I experienced was incredible. Best spiritual experience in the whole of India was right here in this old simple cave. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r267873827-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silence", "review": "Deep silence at the cave. Very profound and still.Lovely views of the Ganges and sweet cows. Reached after a long journey on twisty roads but very worth while if you can meditate.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r239764135-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Meditation Cave", "review": "The best place for meditation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r243964555-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Peaceful", "review": "Visited this place second time, and would want to go back again, it has a sense of calmness and energy that is soothing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r243079368-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Nice ancient cave", "review": "Ancient cave dedicated to yogi and guru vashisht who meditated here 2000 yrs ago. Sat theee meditating for 15 minutes which was a norvana experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r244680599-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "If you want peace - this is the place to vist", "review": "Ancient cave deep in the hill. Inside you feel nirvana and at peace just quietly sitting with our own thoughts or simply doing nothing. There were a lot of foreigners there for visit and meditation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r248728971-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Welcome to the spiritual past.", "review": "A dark, long cave that has been cleanly maintained and provisions kept for sitting on the floor. Ideal for meditation. It is advisable to carry a torch in the cave, as the illumination by the light of the mobile phone may be inadequate. Very peaceful place and just sitting there quietly for 10-15 minutes rejuvenates the mind.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r248036043-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "A spiritual place far from congestions", "review": "Vashistha cave is dedicated with great sage Vashistha who was one of the Saptarishis (Seven Great Sages) in ancient India. Vashistha is considered manas putra of Lord Brahma & Guru of Lord Ram. Located 25 kms far from Rishikesh (but near to Shivpuri), it is believed that Vashistha Rishi meditated here for a long time. This cave is meant as a beautiful place of meditation so one must avoid noise here. This cave is closed between 12 noon to 3 pm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r251593892-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Must Visit", "review": "The Vashistha Gufa is well known is Rishikesh. Lot's of Foreign Traveller visit this Gufa. This gufa is best of our meditation. You can feel relaxation at this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r249719607-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "The vibes are just amazing", "review": "It is a bit of a trek but what you discover is beautiful. One might say it is just a cave, but well, if you have it in you....that is..you are slightly spiritual and have a thing for peace and mythology you won't miss the heaviness in air and the vibes. And then when you exit and just go to your left instead of hiking back you will see this beautiful river beach right there. I discovered it when it was raining. Can't explain the beauty of the sight", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r252243679-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Holly place!!!", "review": "I've been there with some friends to celebrate Maha Shivratri. After meditating inside the cave, we took a holly bath in the Ganges. This is some thing you have to do while your are in Rishikesh. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r255522070-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "HIGHLY RECOMMENDED", "review": "To anyone reading this. Please visit the vashishth gufa and meditate inside the cave for just 30 minutes. The positive vibes will last with you for another few days. It is difficult to describe it. It needs to be experienced on its own. Also one can contribute in the kitchen by doing some sewa and making food for the visitors.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r195153590-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Profound", "review": "This was once a great cave (guha pronounced gufa) for meditation but I am told that because people went in and did not want to come out, the government cut off the deeper rooms to provide for more superficial meditations and more returning tourists.  So be it.  Also a magnificent spot on the River Ganga.  When we were there there was a yagya in progress. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r199901356-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "An ancient cave", "review": "This ancient cave was where Sage Vashishta meditated in the millennia gone by ! It is well preserved even now and one can meditate quietly inside. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r201142848-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Interesting Cave", "review": "This place has one twenty feet or so deep cave where Sage Vashistha did penance centuries back. Nice picnic spot - provided you are into quiet, eco friendly picnic and not leaving garbage behind :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r202168723-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "AUM NAMAH SHIVAYA", "review": "A very special Ashram at the Ganga. Peaceful and you can feel the power of both \"The Ganga & The Shiva\" .... Wow ... Wanted to sit here for a longer time than I had. It is absolutely worth of it to visit that place. Please have the time to enjoy the silence and feel the precence of Shiva in the Cave.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r202604690-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Spiritually enchanting.", "review": "Definitely a must visit. Guru of Shri Ram meditated and did tapasya here. Very well kept and easily accessible by road. We had hired bikes(Bullet) in Rishikesh and with the help of Google map did reach here in 40 min enjoying the road side view. Visitors can stay here for upto 3 days and meditate if talked to the management. We went there at afternoon and it was hot and as we entered the cave it was refreshingly cold and calm, A divine experience we sat and meditated. A little far on the right is Arundhathi cave, you can have a look at it too. Nearby Ganges flows and its spectacularly beautiful. We did sit there with our feet immersed and it was as if the time has stopped. A fun and soulful experience and we talked to a sadhu who informed us about the place. Have a good time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r205478465-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful", "review": "Peaceful and a place you want to revisit umpteen number of times! The water here is serene, calm and wonderful pebbles rocks to sit and relax.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r214223077-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "excllent place", "review": "its a good place on the bank of the ganga to meditate, Its a cave where its said that the guru of meditation vashistha meditated for years. it definitely has positive energy inside the cave ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r234816113-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Spiritual vibrations can be felt by everyone", "review": "The spiritual vibrations inside the cave were felt by my daughters, who are not meditators (yet). It is a wonderful place to meditate. Must visit for everyone who seeks to go on internal journey.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r234089333-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "serene", "review": "serene, mysterious and silent. its a must. a deep cave with ancient origins we loved the coolness inside. an ancient shivling sits inside and you can see yogis sometimes sitting and meditating in the darkness. locals say it was once unending..", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r159953737-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Serenity personified..", "review": "The place has very positive vibrations and for the people who love to meditate, the cave gives an exhilarating experience. The place also has a Arundhati Cave near the river bed , which has been visited by lot of holy men and 'aliens' ( read- Apprentice to Himalayan master by Sri M ) as well. Saw a foreigner meditating there and frankly was impressed to see people with foreign origin know the value of such a holy sight. a must go for people visiting Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r161218481-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Vashishtha Gufa Trip", "review": "Went there with a friend. It is a short drive up from Laxman Jhula where we were staying. Hired a taxi to take us there and then walked down  to a beautiful beach and the cave. Despite all the construction that has been done there, the place is still very nice and beautiful. Must visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r179137563-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Divine", "review": "For those who believe in meditation and peace, this is a quiet, little hermitage on the banks of Holy Ganga. Spend an hour in the solitude and get drenched in the love of Lord Shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r161134632-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Enthralling", "review": "The highlight of our trip was to meditate in Vashishta's cave.  An extraordinary experience, not to be missed.  And the Ganga river is close by for bathing and ritual dips and to sit and meditate with Mother Ganga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r165322115-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "BEST PLACE TO TAKE GANGES BATH AND VISIT TEMPLE", "review": "This is a very full expereince, plan a half day there and hire a car from aurora merchant store- sit in cave for as long as you can to meditatie.not a place for tourists, but a must place for those seeking deeper spiritual enhancements.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r181084536-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "No words", "review": "No words can describe this place and it is quite strange that it is on Trip Advisor, a highly important mythological place with deeply potent energy, if you are reading this \"review\" then dont even question it and go there, treat it with respect as this is a highly sacred and important place", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r185169347-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "good place to meditate", "review": "calm and very place to spend your time lonely. it is located near the ganga river with nice white sand", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r192598542-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "a bit commercial, but nice", "review": "Nice meditations in the cave, if it's not too crowded. Unfortunately a memorial block of concrete has been set in the best meditation seat to commemorate the swami who took Mahasamadhi there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r192576188-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "I like cave", "review": "I have have in Hong Kong but this very better with temple and walking down into cave. Pictures are ver good to click beautiful cave to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r609079634-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditative location", "review": "The time we went (just about closing time at 6 AM), there were not many people to guide and inform what exactly was there to see here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621247831-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful and Soothing", "review": "Its located around 20kms out of rishikesh and you have to use your own transport to reach there. The ganga river flows right through the ashram and just sitting on its banks will give you so much peace that you won't want to return. There are very few tourists there so you can have sometime to yourself sitting by the river. Its one of the most peaceful places in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r617335100-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must visit if you are on spiritual journey", "review": "Great place to visit if you are on spiritual tour/journey. The cave itself is not beautiful. It is located next to a Ganges beach. The cave is used for meditation. It's a dark small cave with thin cushions and you can sit down for a (short) meditation. You feel a special energy (spiritual or not). The entrance is free. And you can reach the cave after a 100 meter walk down (stairs). You can also visit the nearby beach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r620001761-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful meditation on the banks of Ma Ganga", "review": "I travel here every year to meditate in this sacred place.  Authentic, peaceful, real.  You can take a taxi from Rishikesh easily.   There are stairs to walk down and there is a handrail.   It is dark in the cave with a subtle candle light.  Enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621312504-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Awesome place..", "review": "we went there and then reached the Ganga ji ka kinara and had holy bath there. it was very refreshing and quite there, and no concrete ghat really made the experience.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r633491219-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silence and stillness at Vashisth Gufa", "review": "The entry into the holy cave is undertaken in groups or if you are lucky to have just one or two more people with you, that is possible too. Meditation inside the cave is usually in time slots of about 20 minutes, though you can stay longer if you wish. There are a lot of stairs going down and also a slope, so you need to be physically fit in order to visit this place. The elderly or those with physical restrictions may find it difficult. Decorum must be maintained since it is a spiritual space, recommended to wear modest clothing and to be in silence.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r634385851-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Worth visit", "review": "A bit far place but worth. Peaceful, calm and serene. Small gufa where you should sit in silence for 10 min and feel the vibes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r639072549-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must see thi", "review": "Peaceful, and away from the town and noise. Spectacular scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r643455259-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "I like cave", "review": "I have have in Hong Kong but this very better with temple and walking down into cave. Pictures are ver good to click beautiful cave to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r609079634-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Religious Site near Ganga", "review": "The cave is atmospheric and for those who meditate a chance to join the many who have sat quietly here over the centuries- it’s more about the history and the Epic devotion than what to see- then take the steps down to the river for beautiful vista and quiet contemplation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r659027856-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful and Soothing", "review": "Its located around 20kms out of rishikesh and you have to use your own transport to reach there. The ganga river flows right through the ashram and just sitting on its banks will give you so much peace that you won't want to return. There are very few tourists there so you can have sometime to yourself sitting by the river. Its one of the most peaceful places in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r617335100-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must visit if you are on spiritual journey", "review": "Great place to visit if you are on spiritual tour/journey. The cave itself is not beautiful. It is located next to a Ganges beach. The cave is used for meditation. It's a dark small cave with thin cushions and you can sit down for a (short) meditation. You feel a special energy (spiritual or not). The entrance is free. And you can reach the cave after a 100 meter walk down (stairs). You can also visit the nearby beach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r620001761-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditative location", "review": "The time we went (just about closing time at 6 AM), there were not many people to guide and inform what exactly was there to see here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621247831-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful meditation on the banks of Ma Ganga", "review": "I travel here every year to meditate in this sacred place.  Authentic, peaceful, real.  You can take a taxi from Rishikesh easily.   There are stairs to walk down and there is a handrail.   It is dark in the cave with a subtle candle light.  Enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621312504-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Awesome place..", "review": "we went there and then reached the Ganga ji ka kinara and had holy bath there. it was very refreshing and quite there, and no concrete ghat really made the experience.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r633491219-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silence and stillness at Vashisth Gufa", "review": "The entry into the holy cave is undertaken in groups or if you are lucky to have just one or two more people with you, that is possible too. Meditation inside the cave is usually in time slots of about 20 minutes, though you can stay longer if you wish. There are a lot of stairs going down and also a slope, so you need to be physically fit in order to visit this place. The elderly or those with physical restrictions may find it difficult. Decorum must be maintained since it is a spiritual space, recommended to wear modest clothing and to be in silence.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r634385851-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Worth visit", "review": "A bit far place but worth. Peaceful, calm and serene. Small gufa where you should sit in silence for 10 min and feel the vibes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r639072549-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must see thi", "review": "Peaceful, and away from the town and noise. Spectacular scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r643455259-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Religious Site near Ganga", "review": "The cave is atmospheric and for those who meditate a chance to join the many who have sat quietly here over the centuries- it’s more about the history and the Epic devotion than what to see- then take the steps down to the river for beautiful vista and quiet contemplation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r659027856-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful and Soothing", "review": "Its located around 20kms out of rishikesh and you have to use your own transport to reach there. The ganga river flows right through the ashram and just sitting on its banks will give you so much peace that you won't want to return. There are very few tourists there so you can have sometime to yourself sitting by the river. Its one of the most peaceful places in Rishikesh.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r617335100-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must visit if you are on spiritual journey", "review": "Great place to visit if you are on spiritual tour/journey. The cave itself is not beautiful. It is located next to a Ganges beach. The cave is used for meditation. It's a dark small cave with thin cushions and you can sit down for a (short) meditation. You feel a special energy (spiritual or not). The entrance is free. And you can reach the cave after a 100 meter walk down (stairs). You can also visit the nearby beach.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r620001761-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Meditative location", "review": "The time we went (just about closing time at 6 AM), there were not many people to guide and inform what exactly was there to see here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621247831-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "I like cave", "review": "I have have in Hong Kong but this very better with temple and walking down into cave. Pictures are ver good to click beautiful cave to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r609079634-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Peaceful meditation on the banks of Ma Ganga", "review": "I travel here every year to meditate in this sacred place.  Authentic, peaceful, real.  You can take a taxi from Rishikesh easily.   There are stairs to walk down and there is a handrail.   It is dark in the cave with a subtle candle light.  Enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r621312504-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Silence and stillness at Vashisth Gufa", "review": "The entry into the holy cave is undertaken in groups or if you are lucky to have just one or two more people with you, that is possible too. Meditation inside the cave is usually in time slots of about 20 minutes, though you can stay longer if you wish. There are a lot of stairs going down and also a slope, so you need to be physically fit in order to visit this place. The elderly or those with physical restrictions may find it difficult. Decorum must be maintained since it is a spiritual space, recommended to wear modest clothing and to be in silence.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r634385851-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Awesome place..", "review": "we went there and then reached the Ganga ji ka kinara and had holy bath there. it was very refreshing and quite there, and no concrete ghat really made the experience.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r633491219-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Worth visit", "review": "A bit far place but worth. Peaceful, calm and serene. Small gufa where you should sit in silence for 10 min and feel the vibes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r639072549-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 5.0, "title": "Must see thi", "review": "Peaceful, and away from the town and noise. Spectacular scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r643455259-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}, {"point_of_interest": "Vashishta Gufa", "rating": 4.0, "title": "Religious Site near Ganga", "review": "The cave is atmospheric and for those who meditate a chance to join the many who have sat quietly here over the centuries- it’s more about the history and the Epic devotion than what to see- then take the steps down to the river for beautiful vista and quiet contemplation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g580106-d4092570-r659027856-Vashishta_Gufa-Rishikesh_Dehradun_District_Uttarakhand.html"}]