[{"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "When you never knew you wanted to own marble", "review": "After visiting Taj Mahal all of a sudden their sales skills changed us from looking at the inventory to wanting to bring expensive souvenirs. Great company, sit down and negotiate and have beer in the morning. We bought two marble art pieces that should be produced and sent to us in The Netherlands. We are satisfied with the art piece and the company was very responsible for the freight. Produced, wrapped and packed to perfection.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r648260782-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Marbles goods", "review": "We picked up a beautiful display plate & six wonderful different coloured elephant coasters, we are very happy, the whole experience was easy inc the delivery to the UK", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r651659312-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Pricey but worthwhile artisan marble products", "review": "Was taken here by my tour driver, one of many stops on a 3 week tour of Rajasthan. Most such places are staffed with some of the slickest salespeople I have ever encountered and Agra Art Gallery was no exception. They were extremely friendly and informative about the process and work that goes into making their amazing marble pieces. I was pretty sure I’d buy at least one small sculpture but ended up buying a decorative hot plate, coasters, a small jewelry box, and one small elephant sculpture. The quality of the products is readily apparent and was the final selling point for me. The icing on top was the free shipping they threw in, from Agra all the way to Boston. This is stuff you buy to last a lifetime, but be warned, if you’re on a budget, don’t torture yourself with a visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655327500-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Rato", "review": "Excellent staff and excellent workmanship. We purchased two coffee tables and coasters to match which now takes pride in our living room... a bit of class. The effort that goes into designing and carving these marbles, precious and semi precious stones is absolutely incredible. The Agra Art Gallery is a definite must see but be warned you will be spoilt for choice. You will not be able to leave without buying a souvenir may it be small or big. Our purchase was packed extremely secure and safe and delivered without any problems to London. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659135398-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Marble tables", "review": "Excellent service and attention, buy some tables and have sent me without any problem to Mexico, I highly recommend", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655313728-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Must See Before Visiting the Taj Mahal", "review": "This is a beautiful art gallery specializing in marble inlay work and jewelry with semi precious and precious stones. We went here the day before we visited the Taj Mahal and are so happy we did. You can actually watch artisans in the gallery, descendants of those that did the beautiful marble inlay work on the Taj Mahal, doing their craft the same way its been done for hundreds of years! You see first hand how the work was done on the Taj Mahal and it gives you a far deeper appreciation of what you are looking at when you visit. The craftsmanship is beautiful and I didn't see any marble work like it anywhere else we traveled in India. I have been told that it is only here in Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r658817162-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Art buy", "review": "We bought a marble art piece that should be produced and sent to us in Sweden. We are very satisfied with the art piece and the company was very responsible for the freight.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r647710294-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Expensive beautiful work with great customer service", "review": "The quality of work is really great and they have a wide array of stuff to choose.  I personally found it a little expensive, yet I still bought a couple of items.  You will need to be willing to bargain and walk out if price is too high.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r636331446-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "VERY HONEST & RELIABLE MANAGEMENT WITH EXCELLENT SERVICES ", "review": "Wonderful Collection of Marble and top notch quality servicing the marble and tourism industry. Excellent. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r661000569-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Interesting and well worth a visit", "review": "We did not expect to visit Agra Art Gallery but we are happy that we did. We are now the proud owners of a beautiful marble table that will be handed down as a family heirloom and will take pride if place in our home. The staff were friendly and the craftsmen demonstrated for us how the stones are inlayed into the marble as was done in the Taj Mahal, this was fascinating and makes you appreciate the Taj and the artisans who worked on it. Agra Art Gallery tracked my table back to Australia and ensured that it arrived safely and that we were completely satisfied. A very professional organization and worth a visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659391911-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Wonderful articrafts", "review": "I bought in this shop some souvenirs in marble and they shipped to me 'my' wonderful marble plate, carved and decorated with colorful stones. I was so excited when I received the package at my house and you can see how beautiful and precious it is looking at the pictures.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r635164041-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Marvellous marble artwork ", "review": "I purchased a beautiful marble chess table and a magnificent heritage small table with matching inlaid marble coasters in September during my recent trip to India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r632083497-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Inlaid marble", "review": "Marble art was carved from same marble as the Taj Mahal.  Very beautiful.  Worth buying.  Demonstrations given on the premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659755091-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Piece of India!", "review": "Our tour company took us here after our dat out in Agra, so wasn't expecting to buy. However bought a beautiful marble coffee table as a piece of India for me. Packaging and delivery included, it all arrived on time and in condition.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r645808571-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Very good shop, very good service", "review": "Me and my parents bought marmour tables from Agra art gallery. Their tables arrived immediatly when they returned home in a very good condition. My table was custom made and the arrival date was just as the owner of the shop told me. The table was very nicely made and just as i wanted. Thanks a lot for the good service and the good quality. Would go again definetely:)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r639917988-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A lifetime memory of your trip to Agra and theTaj Mahal", "review": "We were taken here by our Guide after our visit to the Red Fort. Their shop is chokka block with exquisite marble works which are painstakingly made by traditional methods of marble inlay. So many to choose from it makes it really hard to decide on just one.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r637385786-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Amazing experience", "review": "I had an amazing experience in Agra Art Gallery. The staff were very professional, kind, and honest with me. They kept a marble table I bought some months ago while I was travelling in India and they delivered it when I got back home. I am so grateful for their honesty and I definitively recommand anyone to visit this store. Everything is extraordinary beautiful inside. It's a must! :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r640378003-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Marbleous ", "review": "Our driver took us here to have a look.Did not to expect to buy anything, however ended up buying a beautiful Marble stone with Taj Mahal on it.Very kind staff.They shipped my purchase by mail and it arrived safely at my door.Thank You, Agra Art Gallery.Namaste.Best regards Santosh, Norway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r643673695-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Love our table", "review": "Lots to choose from at this shop however we settled on a small marble base which came with a stand. We had it delivered to Australia and it all arrived on time and in good condition. well packed. We are very happy with our table and it is beautiful to look at. Thank you Agra Art Gallery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r647204569-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Quality & Best Moments captured of the Taj Mahal in this Showroom.", "review": "One of the most beautiful and unique gallery i have come across in the world.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r595422224-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "nice place to buy handmade artifacts, precious stones and jewelry", "review": "Agra Art Gallery contains handmade artifacts, precious stones and jewelry . One get mesmerized by the colors and artwork studded with precious gemstones. The interesting part is that they walk you through the specialty of the stones they use, enlightening you with its origin and history, its nature and use. If you are visiting this place, you will surely get awed by the skills of the craftsmen, who make their artifacts there and put them for sale. You might feel that the products are overpriced, but a lot of hard work is put in the making of the items, so bargain well and buy the best.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r576200804-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Shiny experience", "review": "We were taken there by the tuk driver, it was a nice surprise- great art marble pieces and great offering of jewellry. We bought pair of silver earings with topas. Several months upon return back home unfortunatelly one of the earings got lost. But thnxs to internet and great help of Art Gallery stuff we have ordered the same one plus few more pieces. Nicely packed-as s surprise in a marble box, thank you :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r594088297-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Keeping a dying art alive", "review": "Watched in amazement as artisans carved gemstones and enlayed them into marble. I treasure the white marble and gemstone table top and black marble elephant I purchased. Excellent craftsmanship, great prices and free shipping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r647463770-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Agra", "review": "they were quite helpful and very reasonable priced we got there with a driver in the tut  I would recommend to any one visiting agra", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r588571019-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Wonderful Marble to take back Home.", "review": "Nice warm place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r595683821-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Great place to visit", "review": "We were taken there by our tour guide to get a glimpse of how the inlays were set at the Taj mahal.  It was very interesting to hear the history of the artistry.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r621224745-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "quality marble work - be prepared to buy or don't go", "review": "We were brought here by our driver, but did not think about what we wanted to buy beforehand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r614005154-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "Not sure", "review": "Our tour guide took us to this place. I enjoyed learning about how the gems are placed int eh marble and the art works built up bit b bit. It was clearly more shop than museum and I'm in nom position to judge the quality (they looked nice!) or the value of the art they were making. My wife, however, still wishes she had forked out for a momento.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r325642966-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Good Place", "review": "Amazing collections of GEMS and various Indian Jewellery and arts.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r598330694-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Hot welcome", "review": "Thank you very much to all team. I have receibed our products on time and with good packaging. It arrives to us without any damage. Also, they trace it up to product arrive to us.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r631025267-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Nice Art Gallaery", "review": "This is one of the very good art gallery we visited. here you can find lot of the things which you can't find in other art galleries.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r629115862-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Great art", "review": "There are many arts of indian mughal history that great looking and it is a must visit place the place is also good", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r440573320-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Exquisite items to see (and purchase!)  Courier service to UK recommended!", "review": "A delightful visit, so many beautiful items to see.  It was interesting (amazing) to hear of the history and techniques that go into these creations of art, as well as to have a demonstration of the work to get an idea of the huge amount of skill involved.  I heartily recommend a visit, and if you can afford it, then do feel confident to make a purchase - mine was shipped back to the UK (they quoted me an inclusive price in the shop and I also bought the insurance) and arrived fairly promptly and very securely packaged after my return from holiday.  The communication with the shop after I returned from holiday re. delivery was very good - I opted to FaceBook message them.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r362312677-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "AWESOME ART!!!", "review": "I had been brought here by my guide (which probably gets some form of commission) to see how the marble has been made for hundreds of years in the Taj Mahal.  It's really impressive that it has been done apparently by hand, with nothing more than basically a grinding wheel  to make replacement tiles for those deteriorating because so many people put their hands on them.  It really is intricate work to be appreciated.  I was particularly impressed to learn the same family has been making the tiles since the construction of the Taj Mahal in 1648.  I checked out their work and bought some beautiful marble coasters inlaid with different stones used in the Taj.  Ya it was more than I wanted to pay, but I almost walked out at closing time, so at the last minute they dropped the price.  Walking out gets people negotiating.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r470210262-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 2.0, "title": "A tourist trap !!", "review": "In fact they have some nice things, but they are greatly over priced (in my opinion they multiply the normal prices by 10 !!!). Handicraft: forget it for a large part: there are evident sings on the backside of the semi precious stones that the are machine cut and polished!!  As for the quality of the gem stones, the gold (14 karat ?) and the precious stones (diamonds ??), I do have my doubts.  For this amount of money they ask you better get assurances and quality.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r363702663-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Beautiful Inlaid Marble", "review": "We visited Agra Art Gallery after visiting the Taj Mahal.  We were blown away by some of the exquisite workmanship on display.  Yes, it is expensive and they would not let you offer a lower price, but you get what you pay for.  We did see much cheaper inlaid marble but it wasn't the fine detail and labour intensive workmanship.  We had 2 tables posted to us which arrived very well packaged and intact. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r458619468-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "Marble inlay work", "review": "We wee taken to this place by our tourist guide at the Taj Mahal, and according to him this was a genuine place to buy any marble crafts.  They gave a demonstration on how marble inlay work is done.  We ended buying small round decorative discs but did feel it was over priced.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r528595397-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Good  one for  Gem  Stones", "review": "best for  Shopping  , specially  for the ART   lover ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r532495064-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Beautiful marble tables", "review": "Had to have a remembrance of the Taj Mahal so something marble fit the bill. We enjoyed seeing the demonstration of how each marble table is decorated with semi precious gems. However, we did not do a good job of negotiating the price of the table we bought. With that being said, the table arrived in 2 weeks. It was extremely well-packed and looks lovely in our living room.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r272161280-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 1.0, "title": "Lying about quality of product ", "review": "The store and the men in it are theifs and liars. I was taken here by my driver on Agra and it seemed legit. I was told my ring was silver and they even give you a guarantee certificate but now, less then a few hours later it obvious I have been ripped off as the ring has already started discolouring  my hand. Ripoffs and theifs, don't shop here", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r562909108-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "Its Alright....not that great", "review": " i have a mixed response to the place as while i appreciated the collection and the handworks visible at the place, i am not sure about the price being fair and the authenticity of the jewellery. I did had to go through a lot hour of bargaining skill on a silver ring i fancied at the place but even after a told of to and from rate negotiations, it did not seem right so i ended up leaving it. I believe that many of the pieces are priced way to expensive. But yes the collection is definitely a treat to the eyes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r258177718-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 1.0, "title": "For cheating foreigners", "review": "On valentines day I along with my wife went to the shop. By seeing us The manager said that the shop is only for exporting because we are indians then we entered inside the shop and observed the stone and marble works and shocked that variety of stone jewellery are made in your  own village also and you may get better than that in your town and then I understand that they are running shop just depending on foreign tourists by cheating them royally. Never go shopping is a waste of time in Agra", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r254604697-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 2.0, "title": "Too expensive", "review": "Too expensive and they try to cheat tourist beside given wrong information ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r298881645-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Enlightening on many levels", "review": "It was beautiful to learn about marble processing, handicrafts and this art form and to  meet the people who do this on a daily basis. I loved seeing all the products and I was tempted to buy even though they vastly overprice. I do understand that handmade art has a lot of worth but they do try cheating tourists into buying their stuff for horrific prices and they bargain on your looks and charm it seems. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r304556052-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "They show you how they make marble objects and then..", "review": "The people are very friendly, they show you how they make those beautiful marble tables, plates, how they work with the precious stones and make them into any shape so they can make them fit in the marble objects ( the same way that they decorated the Taj Mahal)... real craftsmen and then it is business, it is a store after all. they have lovely stuff but a bit expensive, so then the usual negotiations start and never agree with a price that is higher than 50% of what they are asking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r292612903-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Wonderful experience with amazing Souls", "review": "Must to \"see and be\" place!!!! It was the most amazing afternoon in my trip in India after visiting the Taj Mahal...I met there amazing souls with such a big heart that I was thriled with. They are so guifted that they produce magical treasures with their hands. they have amazing presents you can bring back to offer or magical presents for yourself to bring back the amazing and magical energy of India with you....I loved it and will be bcack there really soon...Highly recommended", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r303597726-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Very nice", "review": "I have visited in this art gallery many times, but this time there is very beautiful collection of art and handicrafts available to represent.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r292890228-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "TREASURE OF HANDICRAFTS", "review": "A must visit place. There are 100s of Handicrafts by which everyone will be attracted. A place where we can get many precious handicrafts which could be gifted to all our Family Member, Friends and Business associated. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r287048912-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Awesome!!!", "review": "Beautiful collection of handmade things, fine arts on marbles with studded precious stones attracts any visitor. It was a great experience. People were welcoming and eager to show their work. I found price matching with any other good handicraft shop and worth of the hard-work. I bought some stuff and would like to visit again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r310828908-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "Good variety of Inlay Marble Art. But over-priced", "review": "We had visited and found this place with lot of Artifact and lot of variety to choose. But after purchasing an Elephant for Rs 2500/- we found same item somewhere else at 60% of the price. So look for better pricing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r244946083-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Fine artisans, welcoming staff, reliable service", "review": "Met proprietor Virender Pal and his nephew Bitoo over some chai while they showed me their inlaid marble artistry.  I bought two of these beautiful items while there and had them shipped back to me in the USA.  I am pleased to have these pieces in my home, they are gorgeous to look at, and make a fine conversation piece; a lasting memory of my visit that will never fade.  Enjoy a visit with these nice people and allow you eyes the pleasure of viewing their dazzling inlaid marble artistry.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r238994403-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 2.0, "title": "Very EXPENSIVE place to buy such art!", "review": "Despite the beauty and the fine art of the marble tables, cups, ashtrays..etc. This place is very expensive compare to other local sellers. I tried to bargain with them for a small ring/jewelry box but they refused lowering the price. I respect the value of the items they sell but they are just a rip off. Upon departuring from India via New Delhi airport I found the same small box sold at some shop inside the airport for a price that we 3 times less!!!!  Sadly we learned later that they are making use of the tours agreed between the tour guide and the gallery to stop by and for each item gets sold the tour guide gets of %20 the sale!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r244282094-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "You must visit once", "review": " It was a very nice gallery and I had a nice ring from there. The staffs were very approachable and nice and you can get in very affordable price", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r239741847-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "nice gallery", "review": "AGRA ART GALLERY - is a leading Exporter & Manufacturer of Colour stone , jewellery- diamond, golden from Agra,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r246453514-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Lovely shop and family", "review": "Went here with my girlfriend and the marble art was amazing. The shop owners were lovely people and were more than happy to show and tell us how the jewellery was made and where the stones came from. Would recommend to anyone who appreciates amazing craftsmanship! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r249560275-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Wonderful people,  beautiful work.", "review": "The marble work is truly amazing. Learning how they make their marble items and how they inlay the stones was a great experience. I was brought here by a guide after visiting The Taj. I knew going in that it would be a sales thing,  even after being told there was no pressure to buy.  As in most shops in India,  there is always a sales pitch. Nevertheless,  everyone was very friendly and welcoming. Make sure you barter and stick to a price you are comfortable paying.  I picked up some beautiful marble coasters but it took me leaving and going to another shop to get them for the price I was willing to pay.  I am very happy with the items I purchased and satisfied with the price I paid. Great little shop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r249778701-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "nice gallery but better options in outside local shops", "review": "We found the collections in art gallery quite impressive /the marble and stone works in particular. But we are of the view that similar artefacts can be bought at much lower price from other shops around or even from local market.Staff is courteous and helpful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r251937361-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Like a museum, plus delivery", "review": "We visited the Agra Art Gallery in December 2014. It was a memorable experience. The work there is comparable to any museum. Not only jewelery but also boxes of all sizes an shapes. We were particularly impressed by marble table tops, amazing artistry. My son fancied a chess table top and decided to buy it, after a bit of bargaining. The price seemed fair. The table top comes with a wooden stand and a matching set of carved chess pieces. The price includes door-to-door delivery. It was indeed delivered to our door a month later. I was surprized by the quality of the packing - very professional! I do recommend this place and their delivery service. Visit even if you do not intend to buy. They do the sales pitch in good taste.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r252341643-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 3.0, "title": "Great service but unfortunate results!", "review": "Visited a few days ago with my sister and 2 friends, and we're truly amazed by all the incredible jewellery! Staff were incredible polite and really helpful telling us all about their different items, offering us drinks for tea to beer! 3 of us decided to buy some rings, and it was my friends birthday so they sorted out an incredible deal for her which was irresistible! Then provided great deals for me and my sister as well for a sapphire and an emerald ring. They even had them resized for us within 20 minutes, and gave us complimentary scarfs before leaving! Had a really great experience...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r250016422-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Beautiful Gallery", "review": "Beautifying the partition of the workmanship displays in Agra, the works of experts old and new exhilarate everyone. These jaw dropping considers of craft in Agra will keep you cheerfully possessed for a long time. It goes without saying that visiting the art galleries is a must if you want to make the most of your experience of entertainment in Agra. Art Gallery is sometimes wrongly spelled as art gallery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r162946905-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Affordable Art", "review": "The array of fine threadwork, gemstones and fabric is simply amazing. The tradition of family learnt art continues to live", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r210844177-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Efficient door-to-door delivery from a service oriented family business", "review": "On the last day of my brief visit from Hong Kong to India I purchased a ring and inlaid marble tabletop at Agra Art Gallery. The staff of this family business were approachable, friendly and enthusiastic. The products are of a high quality and made by local craftsmen. I liked that this well established business supports local producers. I had limited time to purchase something memorable after my visit to the Taj Mahal. In my haste to head off to the airport I took the marble table top without the table part. On discovering my error on return to Hong Kong, I rang the owner of the gallery. He was prompt and courteous and indicated that he would be pleased to send off the table to me immediately without charge. It arrived promptly via courier. I was really impressed by this example of \"service recovery\". Brian King (Prof), Hong Kong", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r211045506-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 1.0, "title": "Made by children", "review": "I traveled to India, and while I was there I had a ring made for my fiancé. I went into the art gallery under the lure that they were professional, but then I got my custom made $1400 ring it looked like it was made by kids and in 2 days all 3 gems fell out.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r236946886-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Art buy", "review": "We bought a marble art piece that should be produced and sent to us in Sweden. We are very satisfied with the art piece and the company was very responsible for the freight.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r647710294-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "you should visit at least once", "review": "You should go to this place a least once. It was nice gallery. It surprised me a lot. and It is not far from agra main city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r237515849-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "When you never knew you wanted to own marble", "review": "After visiting Taj Mahal all of a sudden their sales skills changed us from looking at the inventory to wanting to bring expensive souvenirs. Great company, sit down and negotiate and have beer in the morning. We bought two marble art pieces that should be produced and sent to us in The Netherlands. We are satisfied with the art piece and the company was very responsible for the freight. Produced, wrapped and packed to perfection.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r648260782-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Marbles goods", "review": "We picked up a beautiful display plate & six wonderful different coloured elephant coasters, we are very happy, the whole experience was easy inc the delivery to the UK", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r651659312-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Marble tables", "review": "Excellent service and attention, buy some tables and have sent me without any problem to Mexico, I highly recommend", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655313728-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Must See Before Visiting the Taj Mahal", "review": "This is a beautiful art gallery specializing in marble inlay work and jewelry with semi precious and precious stones. We went here the day before we visited the Taj Mahal and are so happy we did. You can actually watch artisans in the gallery, descendants of those that did the beautiful marble inlay work on the Taj Mahal, doing their craft the same way its been done for hundreds of years! You see first hand how the work was done on the Taj Mahal and it gives you a far deeper appreciation of what you are looking at when you visit. The craftsmanship is beautiful and I didn't see any marble work like it anywhere else we traveled in India. I have been told that it is only here in Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r658817162-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Pricey but worthwhile artisan marble products", "review": "Was taken here by my tour driver, one of many stops on a 3 week tour of Rajasthan. Most such places are staffed with some of the slickest salespeople I have ever encountered and Agra Art Gallery was no exception. They were extremely friendly and informative about the process and work that goes into making their amazing marble pieces. I was pretty sure I’d buy at least one small sculpture but ended up buying a decorative hot plate, coasters, a small jewelry box, and one small elephant sculpture. The quality of the products is readily apparent and was the final selling point for me. The icing on top was the free shipping they threw in, from Agra all the way to Boston. This is stuff you buy to last a lifetime, but be warned, if you’re on a budget, don’t torture yourself with a visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655327500-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Rato", "review": "Excellent staff and excellent workmanship. We purchased two coffee tables and coasters to match which now takes pride in our living room... a bit of class. The effort that goes into designing and carving these marbles, precious and semi precious stones is absolutely incredible. The Agra Art Gallery is a definite must see but be warned you will be spoilt for choice. You will not be able to leave without buying a souvenir may it be small or big. Our purchase was packed extremely secure and safe and delivered without any problems to London. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659135398-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Interesting and well worth a visit", "review": "We did not expect to visit Agra Art Gallery but we are happy that we did. We are now the proud owners of a beautiful marble table that will be handed down as a family heirloom and will take pride if place in our home. The staff were friendly and the craftsmen demonstrated for us how the stones are inlayed into the marble as was done in the Taj Mahal, this was fascinating and makes you appreciate the Taj and the artisans who worked on it. Agra Art Gallery tracked my table back to Australia and ensured that it arrived safely and that we were completely satisfied. A very professional organization and worth a visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659391911-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Inlaid marble", "review": "Marble art was carved from same marble as the Taj Mahal.  Very beautiful.  Worth buying.  Demonstrations given on the premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659755091-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "VERY HONEST & RELIABLE MANAGEMENT WITH EXCELLENT SERVICES ", "review": "Wonderful Collection of Marble and top notch quality servicing the marble and tourism industry. Excellent. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r661000569-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "When you never knew you wanted to own marble", "review": "After visiting Taj Mahal all of a sudden their sales skills changed us from looking at the inventory to wanting to bring expensive souvenirs. Great company, sit down and negotiate and have beer in the morning. We bought two marble art pieces that should be produced and sent to us in The Netherlands. We are satisfied with the art piece and the company was very responsible for the freight. Produced, wrapped and packed to perfection.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r648260782-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Art buy", "review": "We bought a marble art piece that should be produced and sent to us in Sweden. We are very satisfied with the art piece and the company was very responsible for the freight.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r647710294-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Pricey but worthwhile artisan marble products", "review": "Was taken here by my tour driver, one of many stops on a 3 week tour of Rajasthan. Most such places are staffed with some of the slickest salespeople I have ever encountered and Agra Art Gallery was no exception. They were extremely friendly and informative about the process and work that goes into making their amazing marble pieces. I was pretty sure I’d buy at least one small sculpture but ended up buying a decorative hot plate, coasters, a small jewelry box, and one small elephant sculpture. The quality of the products is readily apparent and was the final selling point for me. The icing on top was the free shipping they threw in, from Agra all the way to Boston. This is stuff you buy to last a lifetime, but be warned, if you’re on a budget, don’t torture yourself with a visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655327500-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Marbles goods", "review": "We picked up a beautiful display plate & six wonderful different coloured elephant coasters, we are very happy, the whole experience was easy inc the delivery to the UK", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r651659312-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Marble tables", "review": "Excellent service and attention, buy some tables and have sent me without any problem to Mexico, I highly recommend", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r655313728-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 4.0, "title": "Interesting and well worth a visit", "review": "We did not expect to visit Agra Art Gallery but we are happy that we did. We are now the proud owners of a beautiful marble table that will be handed down as a family heirloom and will take pride if place in our home. The staff were friendly and the craftsmen demonstrated for us how the stones are inlayed into the marble as was done in the Taj Mahal, this was fascinating and makes you appreciate the Taj and the artisans who worked on it. Agra Art Gallery tracked my table back to Australia and ensured that it arrived safely and that we were completely satisfied. A very professional organization and worth a visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659391911-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Rato", "review": "Excellent staff and excellent workmanship. We purchased two coffee tables and coasters to match which now takes pride in our living room... a bit of class. The effort that goes into designing and carving these marbles, precious and semi precious stones is absolutely incredible. The Agra Art Gallery is a definite must see but be warned you will be spoilt for choice. You will not be able to leave without buying a souvenir may it be small or big. Our purchase was packed extremely secure and safe and delivered without any problems to London. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659135398-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "VERY HONEST & RELIABLE MANAGEMENT WITH EXCELLENT SERVICES ", "review": "Wonderful Collection of Marble and top notch quality servicing the marble and tourism industry. Excellent. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r661000569-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "Inlaid marble", "review": "Marble art was carved from same marble as the Taj Mahal.  Very beautiful.  Worth buying.  Demonstrations given on the premises.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r659755091-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Agra Art Gallery", "rating": 5.0, "title": "A Must See Before Visiting the Taj Mahal", "review": "This is a beautiful art gallery specializing in marble inlay work and jewelry with semi precious and precious stones. We went here the day before we visited the Taj Mahal and are so happy we did. You can actually watch artisans in the gallery, descendants of those that did the beautiful marble inlay work on the Taj Mahal, doing their craft the same way its been done for hundreds of years! You see first hand how the work was done on the Taj Mahal and it gives you a far deeper appreciation of what you are looking at when you visit. The craftsmanship is beautiful and I didn't see any marble work like it anywhere else we traveled in India. I have been told that it is only here in Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2484460-r658817162-Agra_Art_Gallery-Agra_Agra_District_Uttar_Pradesh.html"}]