[{"point_of_interest": "Balkeshwar Mandir", "rating": 4.0, "title": "One of the Most peaceful and spiritual place in Agra", "review": "Have visited this place a hundred times but still it feels like the first time, the peaceful place like this is hard to find now a days. Come here if you want to spend time in Peace and lap of nature among the holy temple then this is the place for you. located on the Banks for River Yamuna in case of heavy rainfalls the place is filled with water but the shiva idol(shivling) which is around 4-5 feet below the ground level is never fully drowned its a saying that the city will be flooded the day the idol is fully drowned.  A huge ceremony happens there every year with crowded markets and festivities at the time of Shivaratri & a Huge rally starts from here at occasion of Ram-Barat. Must visit place for peace, solitude, history and nature lovers, peacocks can be seen in huge numbers here throughout the day.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r386934507-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 5.0, "title": "Totally Awesome Place", "review": "This Temple is very famous among the locals. It was the ancient Shiva's Temple. It is my favourite place to spend some peaceful time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r410836730-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 4.0, "title": "Balkeshwar Mahadev Temple Agra", "review": "Balkeshwar temple in Agra is about 2 kilometers from the Agra city and is the crowded place at the time of Shivratri festival and other such days. Balkeshwar Mandir is one of the famour temple devoted to Load Shiva. Balkeshwar Temple is situted on the bank of yamuna river and is famous destination for locals as well as tourist visiting agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r477659269-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 5.0, "title": "101 Lord Shiv Mandir in One Row!", "review": "Baba Bateshwarnath Dham also known in the holy scriptures of Ramayana, Mahabharata, and Matsya Purana.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r516607799-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 4.0, "title": "Wonderful Temple!!!", "review": "Balkesh Mandir is in Kailash Nagar, Kamla Nagar, Agra. The temple is very famous and crowded when we went to this temple. Lord Shiva is the Main God.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r519952759-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 5.0, "title": "Bam Bam Bhole", "review": "This is very very old Mahadeo Temple in Agra ,in the holy month of Saawan ,thousands of local people visit this place for worship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r591574702-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Balkeshwar Mandir", "rating": 4.0, "title": "nice shiva temple", "review": "Balkeshwar Mandir is the temples devoted to Shiva.It is located in Balkeshwar Colony on the banks of river Yamuna..This Shiva temple is spread across the sprawling acres of land.The temple organizes bhajans and kirtans daily. One can reach this temple easily by hiring an auto rickshaw or a cab after reaching Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10489021-r576428282-Balkeshwar_Mandir-Agra_Agra_District_Uttar_Pradesh.html"}]