[{"point_of_interest": "Bateshwar Temples", "rating": 4.0, "title": "Shiva temple", "review": "This shiva temple is situated at the bank of Yamuna river and this temple is very old you can see great seen from here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r569547773-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 4.0, "title": "Ancient temples of Shiva on the banks of Yamuna", "review": "Bateshwar is around 60 km from Agra and if you love travelling / driving, it is definitely worth a visit from Agra. Do carry eatables as you may not get much to eat here (if you are not used and don't want to take the risk of roadside eateries ;-) .. )", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r514072925-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 4.0, "title": "TEMPLE OF LORD SHIVA", "review": "Bateshwar is situated at a distance of 70 km from Agra on the bank of river Yamuna. Bateshwar is one of the oldest towns.It is one of the important spiritual and cultural center in India. Bateshwar is known for the 101 Shiv temples situated on the banks of Yamuna.The serene temples scattered along the banks of River Yamuna is a peaceful sight, especially during sunrise and sunsets. One may want to sit still and meditate to experience tranquillity. A visit to the Bateshwar Temples is a must for those seeking clarity and harmony in life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r576444229-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 3.0, "title": "The Photos Do Not Show The Filth.", "review": "I visited here, beguiled by the fabulous photographs I had seen of these ancient Shiva Temples sitting on the banks of the Yamuna river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r545935016-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 3.0, "title": "Beautiful price of history, equally badly kept. ", "review": "India is full of history and historical monuments and buildings. It's highly intriguing how so much of historical existed and continue to be. One such complex is Bateshwar Temple complex which is situated on the banks of river Betwa. It's one of a kind complex with over 100 miniature temples. The sad part is the complex isn't well maintained and even the access is not as convenient. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r603795750-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 5.0, "title": "Fascinating temple complex on the Yamuna river bank", "review": "This is a complex of about 100 temples dedicated to Shiva. They line the banks of the Yamuna river in a very rural part of central India. We did a trip from our lodge, The Chambal Safari Lodge about 10km away who also have a boat. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r661832993-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Bateshwar Temples", "rating": 1.0, "title": "Chambal national park, extended tour option", "review": "Better not to even think of. Not even T in the name of tourism. What you see on websites is all nonsense. Nothing worth visiting except negligence and govt appathy. Better stay at Agra and enjoy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12099459-r641590500-Bateshwar_Temples-Agra_Agra_District_Uttar_Pradesh.html"}]