[{"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Glazed Tiles ", "review": "It is commemoration building in Agra, houses the tomb of Allama Afzal Khan Mullah, a scholar & poet who was the Prime Minister of the Mughal Emperor Shah Jahan. It is famous for its glazed tiles work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r525889780-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "LOST Treasure for Artists", "review": "Though this place is lovely it is very underutilized as a tourist attraction. Most people ditch Chini ka Rauza on their trip to Agra but I would highly recommend it to artists looking for inspiration for future projects. Though very little is left of what was an artistic masterpiece of Persian craftsmanship, you can still find nooks and corners of what once was.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r561249900-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Beautiful piece of Architecture", "review": "A beautiful piece of architecture tucked away from the main road very close to Itmad-ud-daulah tomb in Agra, This is the tomb of Afzal Khan who was a poet In Jahangir's time and also Wazir in Shah Jehan's reign...this structure is unique as it does not have the usual carvings and niches which are present in most of the monuments of that time..this has a beautiful blue glazed tiled work on its facade...the whole building is not in a very good shape as the outside tiled work is fading away with time..the interiors are also very beautiful..its a place which is not very popular and the overall maintenance  is also not like the other monuments in Agra...there were people who were having picnic in the premises and children were playing cricket in the grounds which is a big threat to this beautiful monument.. also the approach is not very conducive for people to come there and there are no visible boards to guide or tell people about this place...am sure if the concerned department was to maintain and guard this monument like the others in will be a good attraction for tourists and will add to the rich history of the city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r569060611-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Chino ka rauza", "review": "It's one of important tombs in Agra but not much visited if you have spare time have a look on it and enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r563368735-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Not touristy so different and authentic ", "review": "Not a popular tourist hotspot and you need a Tuk Tuk to Access that place as it’s on a tiny isolated place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r572564861-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "made in the memory of Persian poet Afzal Khan Aalmi", "review": "The mausoleum is situated on the banks of river Yamuna.It was made in the memory of Persian poet Afzal Khan Aalmi.The mausoleum exhibits a perfect blending of Indo-Persian architecture. It is the first building which was constructed using glazed tiles.The different shades of the tiles like yellow, green, aquamarine and orange are the most attractive feature of this monument. The interior part of the tomb is decorated with paintings of flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r576195249-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Off the beaten path", "review": "During my holidays in Agra, we had visited this small tomb which is located in a narrow bylane on the road from Ram Bagh to ItumiudDaulah Tomb. This place is free and not well maintained and we saw locals playing cricket on the lawns beside the tomb. The tomb looks ordinary from outside but once inside, the dome which has multi color design is very beautiful. This place needs to be maintained better,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r603328797-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "A quaint tomb beside the river ", "review": "One of the lesser known monument in Agra is Chini ka Razwa. Parts of the monument still retains glazed tiles with which it was once completely embellished with . For half a millennia the waters of the Yamuna has softly rolled past a few steps away . And what ever remains is enough for us to imagine what it resembled in the distant past . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r614842321-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Un luogo magico dimenticato dai turisti", "review": "The Chini Ka Rauza, near to the Itmad Ud Daula, the \"Baby Taj\", is a Mausoleum on the Yamuna River, in nice garden and seems to be forgotten by God and mankind. You have to make a short walk from the street, between trees in the middle of a big noisy town, and then you discover a really charming place, nearly with no tourist and visited only by some local people sitting and chatting in the shadow of some trees near the river. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r633685918-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "A monument worth visiting.", "review": "On road to Tomb of Itimad-ud-Daulah you get a ASI signage for Chini Ka Rauza Mausoleum. A narrow road with poor class residents all around and a bus cannot enter this road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r440098943-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": ".A hidden gem, still in the rough.", "review": "A delightful site, work in progress  Go to explore what the tombs were like before renovation and fixing.  Colors and calligraphy, beautiful.  Needs restoration work, but well worth the visit.  Setting on the river is beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r421203163-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "A little visited gem", "review": "This is the tomb of Shah Jehan's prime minister, a little way up the road from Itmad-ul-Daula's tomb.  It is just off the main road on the left in the middle of a market garden.  It is not well signposted but there is a small sing at the actual turning.  It is simply designed tomb with exquisite Persian turquoise tiling on the outside and beautiful inlay work on the inside.  It is free to visit but you need to tip the guard.  Hardly anyone comes here but it really is worth the visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r353541294-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Quiet place, yet to be fully restored", "review": "This place is about 1.3km north of Itmad-ud-Daula.  There is an official caretaker for the tomb.  Small groups of locals were there socializing, and it is a relaxed environment.  Signs of damage and disrepair are evident.  This attraction is tuk-tuk accessible.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r447037357-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "It's tomb of afzal khan", "review": "It's tomb of afzal khan who was poet and prime minsister in the 16th century(Mughal king shah jahan). Not in good condition you can skip if you don't have time. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r490882587-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Quite and relaxed place", "review": "Mausoleum is basically tomb and the word come from the persian. It is quite old and damaged building. ASI is trying to restore it to its former glory and it may take some time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r478459135-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 2.0, "title": "Waste of time", "review": "Even as a free site, it isn't worth visiting. Ruined mausoleum with too many kids begging for rupees or chocolate. The most interesting part of our visit was the heard of water buffalo on the river bank.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r252579092-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Beautiful Ink tiles, but need restoration.", "review": "This unpolished gem need to be restored. But you'll be amused to gaze the blue ink tiles tear down by time and lack of maintenance", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r493240488-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Only for Architecture and history buffa", "review": "Like most monuments in Delhi an Agra Chini ka Rauza is also a mausoleum. On the banks of the Yamuna, not far from the Itimad-ud-Daula tomb, it houses the tomb of Allama Afzal Khan Mullah a poet and the Prime Minister of Shah Jahan. This was built around 1639 C.E ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r525747680-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Poorly maintained", "review": "The easiest way to reach the Chini Ka Rauza is by tuk tuk (rickshaw in local language) from Agra. Visit might take as little as 15-20 minutes.  The Chini Ka Rauza was constructed in 1639 as the last resting place of Afzal Khan Mullah of Shiraz a poet and prime minister in the reign of Shah Jahan, On the other side of the Chini Ka Rauza there are wide views of the river.  You may skip the monument if not history crazy. Not maintained building in damaged condition.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r509924867-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "The tiled wonder -Chini Ka Rauza", "review": "Chini Ka Rauza is located about a km away from the Tomb of Itimad ud Daula. It is not well known and one can have the place entirely to oneself. The tiled work although damaged still offers clues to the original splendour of the monument built as a mausoleum for future use for himself by Afzal Khan, the Prime Minister or Vazir of Shahjahan. For more details and pictures, do check out my blog on Chini Ka Rauza at www.wanderndiscover.wordpress.com", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r267334356-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Chini Ka Rauza Mausoleum", "review": "This is a monument built by Shah Jahan to commemorate offerings to one of his prime ministers. The man was known as a great scholar and this monument is built along the banks of Yamuna river. Now a days , this monument is not at all maintained.  Too many children begging and a herd of buffaloes are all that you can spot here now.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r276063871-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Chini Ka Rauza Mausoleum", "review": "The tomb of Afzal Khan, a Persian poet who was also a minister in the court of Shah Jahan. Brown, rectangular building, the inside of the tomb decorated with now fading paintwork and inscriptions form the Quran. The tomb is adorned with different colors, blue, yellow and green tiles adding a spectacular view to it. Open every day, 24-hour a day. Free entry.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r281782552-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Run down, but worth the effort", "review": "Slightly lesser known mausoleum fairly near the 'mini mahal', it took me a while to find this, but it's worth the effort. It's not in great shape, but the fading decor of the outside is unusual and worth seeing, as is the stunning domed ceiling inside. Annoyingly, there are 'archeologists' and 'experts' all around the temple that will pester you into paying them to show you around. It's not worth it. All there is to see is completely obvious. They will also use lighting to highlight the ceiling, whether you want them to or not, and then expect paying. Tiring to say the least. Otherwise, it's free to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r306712170-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "It is also called \"Chinese tomb\"...", "review": "It is also called \"Chinese tomb\". Though probably more correct to call it \"Persian\". In connection with the outside finish work by Afzal Khan, a scholar and poet from Shiraz. Until now partially preserved glazed blue tiles with exquisite calligraphic inscriptions, resembling the architecture of Persia.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r334895037-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Unique mausoleum currently being restored", "review": "The Chini ka Rauza is at the end of a lovely shaded lane. Unfortunately lots of the ceramic tiles have been lost over time but it is still possible to discern what this tomb looked like originally. There is lovely tile work along one facade and renovation are going on inside the tomb at the moment to restore some of the internal decoration. No other visitors.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r310140954-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 2.0, "title": "Nothing specific", "review": "Its just another structure with very little historic value to it. My driver said that it was after 5 years that he drove someone there. Its so scarcely visited.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r329466397-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 1.0, "title": "Very bad condition", "review": "When I reached over there then I found locals were playing cards over there. I felt very insecure.Building is not kept very well", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r339570579-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 2.0, "title": "Disrepair! ", "review": "This building has fallen into disrepair. No tourists there and a few sketchy looking locals - didn't feel overly safe there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r341365893-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 2.0, "title": "Under Repair?", "review": "It looked like the whole place is under repair/renovation. Nothing for a traveller, just one building which is almost in ruins now.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r162152271-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Hidden Gem", "review": "Hidden in the green, next to the river stands this beautiful tomb of a polished and cultural Iranian who served India. The tomb is famous because of the glazed tile decoration on the exterior. Alot is ruined already thats true but still worth a visit. An old man will be your guide for a small tip. At the back you can see the cows and buffels taking a bath in the river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r164157108-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "A Spectacular Tomb", "review": "Chini Ka Rauza is a stunning tombwhich is  very close to Taj Mahal in Agra. The tomb is dedicated to the Prime Minister of Mughal dynasty Allama Afzal Khan, the Mullah of Shiraz, during the tenet of Shah Jahan. The tomb is adorned with different colors, blue, yellow and green tiles adding a spectacular view to it. This encroaching structure is implicit a rectangular shape and it is special with a bulbous tomb. It has an orthogonal chamber in the center and numerous engravings made with blue coated tiles are obvious in the tomb. This tomb has been a unique specimen of best of Mughal and Persian architectural styles.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r163153349-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "good architecture", "review": "I visited this tomb with the auto rickshaw I rented for the afternoon. It's only a 15 in ride from Taj Ganj. It's clearly a place that is not visited by a lot of tourists but a recommended one. The interior of the tomb is impressive (an old guy will give you some info for a small donation) and you can still find some bright blue tiles on the exterior.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r162718067-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "What shame !", "review": "Such a stunning piece of architecature in such a derelict  condition. The colour combination of blue and turquoise is unique in India and one can see it only in Uzbekistan. Nothing is done by Govt /ASI to restore it. People are playing cricket making the wall as wicket ! Millions of Rupees is spent on Taj and not a single penny for this !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r172915511-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "For Romantics Only", "review": "This Persian-style tomb from the 17th century is both lovely and rather sad. It is true that most of the tiling has been lost but there is enough remaining on the eastern and western sides to give some sense of how wonderful this tomb must once have been. For tourists who have been to Iran, it will quickly bring to mind visions of Shiraz and Esfahan. (The calligraphy on the eastern side is a nice touch.) Overall, to get some sense of the original splendour, I recommend walking to the western (Taj Mahal) end of the garden in the late afternoon and looking back at the remaining tiling. You will feel a hint of its former grandeur. The Yamuna-side setting doesn't hurt either. But this is one for the romantics only.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r192111223-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 1.0, "title": "Wastage of time", "review": "DO NOT VISIT THIS PLACE. It is a complete wastage of time. The most ill maintained place. It must  have been one of the frequently visited places before but not anymore. It is a very shady place. mostly empty no tourists. Children play cricket. men are sleeping in the compound as well as inside the monument. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r241227889-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Unfortunately it is rather dilapidated", "review": "One can get an idea of what this may have been, but there is very little of the tiling left and as the technique has been lost, little hope for recovery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r192778526-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Poor place was not well taken care of", "review": "Chini ka Rauza is a funerary monument, rauza in Agra, India, containing the tomb of Allama Afzal Khan Mullah, a scholar and poet who was the Prime Minister of the Mughal Emperor Shah Jahan. It has very nice view in the back, and a cow dung factory. :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r248382179-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 1.0, "title": "Ruins only", "review": "No persian architecture is left still. Complete waste of time and money to visit this place. Nothing is left here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r182446242-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "A dilapidated place", "review": "Sad that it is nothing but a dilapidated monument and it shows that he was not part of the royal family and it is a monument of a minister only.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r148875603-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Off the beaten track", "review": "A tomb to a poet we understood that there is no funding for restoration but there are traces of its previous grandeur. The local keeper explained its history very well. Take a moment to glance around the back. There on the river bank are buffalo and their owners with ladies collecting buffalo dung to make into fuel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r150996301-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Long forgotten structure", "review": "Chini ka Rauza houses the tombs of the minister of Shah Jahan and the architect of the Taj Mahal. Beautiful frescoes in blue and gold paint adorn the ceilings and the interior walls. This structure also has inscriptions from the Koran. On one of the walls, one can find the mural painting done by the great Vazir himself! Situated by the banks of the River Yamuna, offers good view of sunset and sunrise", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r142491065-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "very interesting.", "review": "Take time to see this. It is well worth the visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r128978456-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Nice little tomb", "review": "Very nice paintings on the walls inside, with some nice views across the Yamuna river.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r128379528-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "chini", "review": "this monument was built by king jahangir for his poet. their you can see the graves of the poet and his family. this poet was also working as a soldier's captain for king. this is not so well maintenaned like tajmahal or baby taj  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r134885328-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Condition very sad", "review": "So sad that this mausoleum is in such poor condition on the outside.  You can get a sense how beautiful this must have been in the early years with some of the vibrant blue tiles that remain.  Inside the paintings are still in pretty good condition.  The \"guide\" inside you give you some information.  He asks for money but doesn't overdo it like many others do, so I didn't mind giving something.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r139054891-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Glazed Tiles ", "review": "It is commemoration building in Agra, houses the tomb of Allama Afzal Khan Mullah, a scholar & poet who was the Prime Minister of the Mughal Emperor Shah Jahan. It is famous for its glazed tiles work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r525889780-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Quiet and beautiful", "review": "I visited this tomb with the auto rickshaw I rented for the afternoon.  It's only a 15 in ride from Taj Ganj. It's clearly a place that is not visited by a lot of tourists but a recommended one. The interior of the tomb is impressive (an old guy will give you some info for a small donation) and you can still find some bright blue tiles on the exterior.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r128315369-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "You could give this one a miss!", "review": "Nothing spectacular here- but if you have 15 minutes after Itmadudaulah- you can nip by.  They haven't worked as hard on looking after this one.  It's more or less infested with slightly odd characters, but it's safe!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r152832145-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Quiet and different from other sites in Agra", "review": "This poet's tomb tucked away down a quiet lane is a perfect place to escape the crowds. There were no tourists here both times I've been and the worn-down state of the place and the friendly and helpful locals add to the charm. View of the river spotted with buffaloes from around the back of the structure is another bonus. Also, the style of the interior is different to other sites in Agra. Not for everyone, but if you're searching for small, quiet and pretty, this is the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r160579324-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Work and tourists needed", "review": "It is in a rather neglected state and maybe some restoration work will attract further tourists and bring out its splendour once again. A mausoleum dedicated to the prime minister of Mughal emperor Shah Jehah and also a famous poet at the time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r152807200-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "made in the memory of Persian poet Afzal Khan Aalmi", "review": "The mausoleum is situated on the banks of river Yamuna.It was made in the memory of Persian poet Afzal Khan Aalmi.The mausoleum exhibits a perfect blending of Indo-Persian architecture. It is the first building which was constructed using glazed tiles.The different shades of the tiles like yellow, green, aquamarine and orange are the most attractive feature of this monument. The interior part of the tomb is decorated with paintings of flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r576195249-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "LOST Treasure for Artists", "review": "Though this place is lovely it is very underutilized as a tourist attraction. Most people ditch Chini ka Rauza on their trip to Agra but I would highly recommend it to artists looking for inspiration for future projects. Though very little is left of what was an artistic masterpiece of Persian craftsmanship, you can still find nooks and corners of what once was.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r561249900-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Beautiful piece of Architecture", "review": "A beautiful piece of architecture tucked away from the main road very close to Itmad-ud-daulah tomb in Agra, This is the tomb of Afzal Khan who was a poet In Jahangir's time and also Wazir in Shah Jehan's reign...this structure is unique as it does not have the usual carvings and niches which are present in most of the monuments of that time..this has a beautiful blue glazed tiled work on its facade...the whole building is not in a very good shape as the outside tiled work is fading away with time..the interiors are also very beautiful..its a place which is not very popular and the overall maintenance  is also not like the other monuments in Agra...there were people who were having picnic in the premises and children were playing cricket in the grounds which is a big threat to this beautiful monument.. also the approach is not very conducive for people to come there and there are no visible boards to guide or tell people about this place...am sure if the concerned department was to maintain and guard this monument like the others in will be a good attraction for tourists and will add to the rich history of the city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r569060611-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Chino ka rauza", "review": "It's one of important tombs in Agra but not much visited if you have spare time have a look on it and enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r563368735-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 4.0, "title": "Not touristy so different and authentic ", "review": "Not a popular tourist hotspot and you need a Tuk Tuk to Access that place as it’s on a tiny isolated place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r572564861-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "Off the beaten path", "review": "During my holidays in Agra, we had visited this small tomb which is located in a narrow bylane on the road from Ram Bagh to ItumiudDaulah Tomb. This place is free and not well maintained and we saw locals playing cricket on the lawns beside the tomb. The tomb looks ordinary from outside but once inside, the dome which has multi color design is very beautiful. This place needs to be maintained better,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r603328797-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 5.0, "title": "Un luogo magico dimenticato dai turisti", "review": "The Chini Ka Rauza, near to the Itmad Ud Daula, the \"Baby Taj\", is a Mausoleum on the Yamuna River, in nice garden and seems to be forgotten by God and mankind. You have to make a short walk from the street, between trees in the middle of a big noisy town, and then you discover a really charming place, nearly with no tourist and visited only by some local people sitting and chatting in the shadow of some trees near the river. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r633685918-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Chini Ka Rauza Mausoleum", "rating": 3.0, "title": "A quaint tomb beside the river ", "review": "One of the lesser known monument in Agra is Chini ka Razwa. Parts of the monument still retains glazed tiles with which it was once completely embellished with . For half a millennia the waters of the Yamuna has softly rolled past a few steps away . And what ever remains is enough for us to imagine what it resembled in the distant past . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d2693788-r614842321-Chini_Ka_Rauza_Mausoleum-Agra_Agra_District_Uttar_Pradesh.html"}]