[{"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Striking", "review": "A really impressive structure in the already impressive Agra Fort.  The marble is really striking, and only surpassed (by a long way, mind) by the marble in the Taj Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648152983-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "superb", "review": "City is not fully developed and apart from taj Mahala and sikandra there is no good place for visiting. The city ambience is quite low and city is totally congested and there is no good mall and also no good place of evening. The markets close to early but if you are food lover then this place is for you", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648736192-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "amazing marble palace within the fort", "review": "as mentioned the visit of the whole complex is a treat for the eyes, but this is the real gem, a stunning marble palace, make sure you do not miss it !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650429241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb Architecture", "review": "Inside Agra Fort you will find the Jahangir Mahal. The inlaid work inside is beautiful as are the carvings in marble. The water features had no water in them when we were there but that did not detract from the ambiance. Go early when is it cooler and quieter. Stunning place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654092515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing...", "review": "There are several things to watch inside the Agra fort and Jahangir Mahal is one of them. Great to see mugal architecture on red sandstone,  well designed place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650473453-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Dominates the Fort", "review": "Superbly decorated sand stone with such fine details that it looks like made in wood, wonderfully well preserved. The whole structure dominates the interior of the fort. The charming monkeys give a nice touch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654794337-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Zenana", "review": "Jahangir Mahal, in the Agra Fort, is a zenana, a palace for women belonging to the royal household. As you walk through the entrance gate, the first structure to your right is Jahangir Mahal. It was built in the year 1570 by Mughal Emperor Akbar as the residence for his Rajput wives. It is a massive building (must have been a large harem!) made of red sandstone in a blend of Hindu and Islamic style with a lavishly decorated facade. Inside, an inner courtyard is surrounded by large halls. Most impressive is the exquisitely decorated stone brackets that support the ceiling beams.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656055747-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A part of an amazing place", "review": "As in previous reviews having a guide will really enhance your experience. Just having the combination of outstanding craftmanship working with the marble and stone coupled with a guide detailing the history of how and why it was built is magical. Be sure you are not in a hurry as you need to stop to admire the detailed workmanship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656391949-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Must see", "review": "This is also a great place of significance in agra fort... This is a dedicated mahal built by Jahangir and is really very beautiful,.... The view of yamuna from this place is really good...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r661986952-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Ladies palace inside Agra Fort", "review": "This is another very impressive part of Agra Fort, the palace of the women from the royal household. More amazing architecture and intricate carving to admire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r660610241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "UNESCO World Heritage Site.", "review": "Jahangir Mahal is the first thing which you;ll see while entering the Agra Fort. As the name suggest it was built by the Jahangir and later extended by his sons and grandsons. It is Constructed with red sandstone some places with Marble, this will give a good look to visitors while entering inside of the palace.this noteworthy architecture building located inside the Agra fort. best place for photo loving people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r612499891-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Jahangir's legacy", "review": "The Jahangir Mahal is the first monument that you will see when entering the Agra Mahal. It is a beautifully designed monument.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r621206802-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Massive", "review": "We entered the fort without hiring a guide,saw the jahangir mahal(the 1st monument in the fort) ourselves only to realise that we won't be able to see the entire monument ourselves.Then came back,hired one and started again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r619793313-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "The Mahal is just fabulous", "review": "The Jahangir Mahal is beautifully crafted in Arabic style. One of the best masterpiece from Mughal Sultanate.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r621438556-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Nice old memory", "review": "This is one of the place where you can see the days how the King would have spent in this Mahal. It's not in full maintained state. However, It is good to give us idea.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r626155256-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "The Legacy of Emperor Jahangir", "review": "This Mahal, used to be the court of Emperor Jahangir, where there would be public hearings, cultural programs and even those confidential meetings.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r627969554-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Interesting", "review": "Again with all of these attractions you need to have a guide with you that will tell you the history and the interesting facts of which there are loads.  Its a nice place to visit and appeared airier than most o the other attractions.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r638500950-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Worth watching a part of History", "review": "Jahangir Mahal is situated inside the \"Agra fort\" which I already mentioned in my previous review that it's worth watching.. Jahangir Mahal is also called the \"Rung Mahal\"", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r633019002-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "An intereting place, don't miss it", "review": "It has an interesting history.  Quite the walk/hike up to it but worth the effort.  Usually a good breeze when overlooking the river (a very pretty view).", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r641060349-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Major palace within Agra Fort", "review": "Jahangir Mahal is the only major palace within the fort which is attributed to the reign of Akbar. It contains courtyards, galleries and various halls and at the front of the palace is an impressive marble pool.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r646428244-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Residence of Badshah Akber", "review": "Built with red stone this was palace of Mughal King Akbar . This was also residence of queen Noor Jahan . This place is also known to have a pond size bowl which was filed with fragrant water .  Governor Amolak RattanKohli", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r599862195-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Red Red Mahal", "review": "The outside is pinkish/red, the color makes it so beautiful. It's such an old building. You can spend so much time walking around looking at it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r601559498-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Spectacular palace of the rulers who built the Taj", "review": "Can't really visit without visiting the Agra Fort - but why would you? Spectacular building and decorations worthy of the palace from where the Taj was planned and built (and imprisoned)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r600259536-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Beautiful architecture in red sand stone", "review": "During my vacation in Agra, I had visited the iconic Agra Fort which is a UNESCO World Heritage site and this beautiful palace built of red sand stone caught our eyes as soon as we entered the fort through the Akbar Gate. Right in front of this palace a big stone tub is located where the emperor used to take bath. Inside the palace, there is a courtyard and intricately sculpted pillars & balconies which showcases the excellence of Mughal architecture style. Along with the Taj Mahal, Agra Fort is the most visited tourist attraction in Agra. It is open from 6 am to 6 pm all days of the week.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r603325895-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Lots of history", "review": "This place is lovely.  The history and quietness here is so unspoilt. It’s very big inside and very well looked after. The gardens are immaculate. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r608137738-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jahangir Mahal", "review": "Jahangir Mahal is inside the Agra Fort. It is the place of Jahangir. Just at the entrance if this Mahal a big bath tub is there which is made of a single rock of granite. This was used by King for bath..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r608049179-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Incredible place with strings attached", "review": "I visited Fort Agra with my girlfriend in August and we both liked it. The architecture is wonderful and the area is vast with a view to Taj Mahal. If you pay by credit card, check your account as double bookings (deliberately) happen. Bring water or at least an empty bottle and use the refill stations to rehydrate since boiling temperatures are common. Sun lotion and protection for your head will come in handy, as well. Watch the lovely tame squirrels all over the place!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r609062945-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Agra Fort - Jahangir Mahal", "review": "This is part of the Agra fort and exemplary building reflecting Moghul architecture. Ideal for pictures during golden hours.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r609381478-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "private residence of Mughal Emperor jahangir", "review": "The palace is situated inside the Agra Fort and was being made by Akbar for his son Jahangir.It is one of the best examples of Mughal architecture. It is made of red sandstone and white marble, it imbibes both Hindu and Islamic motifs into its exterior structures.It still holds historical as well as architectural importance for its rare, sophisticated symmetrical designs and the diverse combination of different religious styles. The entrance fee is Rs 20 for Indian citizens and Rs 300 for foreigners. It remains open daily from 6am to 5.30pm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r609559095-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "located within agra fort", "review": "a big mahal, located within the agra fort. it was made by Badshah Akbar naming after his son Jahangir. A cool palace, reflects the Mughals vision and wisdom", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r609904422-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Great place inside fort", "review": "This was great palace inside fort. Great architecture and construction. Nice place to visit with family. It was beautiful palace ever I have seen.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r574659910-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "The Palace inside the Agra Fort", "review": "Jahangir Mahal is the first thing which you;ll see while entering the Agra Fort. As the name suggest it was built by the Jahangir and later extended by his sons and grandsons. A part of the palace was destroyed in the wars. Though mucch of the palace is still open to see. Once you enter the palace then the it is connected to the other buildings inside the fort. This palace gives a glimpse of the Mughal architecture and is built using the red sand stones. For sure one of the most important part of Agra fort. I would recommend taking a guide to understand the history behind it. Though negotiate heavily as i feel the official guide prices are already on the higher side. I managed to negotiate 70-80% of the official price mentioned for the guides, though its upto you. Also hire only government approved guides.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r570046515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Palace inside Agra Fort", "review": "This palace is the first thing you reach after entering Agra Fort.  It is a fine example of Mughal architecture and worth visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r572747151-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "A MAHAL INSIDE THE AGRA FORT", "review": "It is the largest part of Agra Fort. The palace is being made by emperor Akbar on the bend of the Yamuna river.He built the palace for his son Jahangir. Jahangir’s wife Nur Jahan resided in the palace. The palace is one of the top examples of Mughal Architecture, with intricate Hindu and Islamic motifs. Only 30 of the original 500 buildings at the site survive. Much of the fort was destroyed by Shah Jahan and later by the British invaders. An entrance fee of Rs 20 is charged for Indian citizens and Rs 300 for foreigners visiting the Mahal. It remains open daily from 6am to 5.30pm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r575639993-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Part of the Fort", "review": "Agra Fort a must see when in Agra, as iconic as the Palace and its ramparts very British Colonial... Enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r575791547-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "bath bowl of emperor Jahangir carved out of a single block of granite.", "review": "Jahangir's Hauz is a bath basin in front of the Jahangiri Mahal.It is a circular basin carved out of a single block of granite.The hauz is 1.22 m. deep, 2.4 m. in diameter and 7.62 m. in circumference.During Mugal period it could be transported and used in the camp as well as in the harem for bathing.A Persian versified inscription in the Nasta'liq script was carved which shows the year of its construction i.e 1611.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r576439681-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Palace inside the Fort", "review": "The Jahangir Mahal is a palace inside that Agra fort complex  Jahangir's Hauz is a bath basin in front of the Jahangiri Mahal.It is a circular basin carved out of a single block of granite.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r587245327-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Inside Agra Fort", "review": "Its a palace inside that Agra fort. Spend a few minutes here, by all means. The differing styles of architecture of Jahangir and Shah Jahan are clearly visible here. Jahangir preferred red stone, while Shah Jahan preferred white (think: Taj Mahal).", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r578964182-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Red castle ", "review": "The best example of Indian mongol architecture made by red stone and it is amazing how they solve hot weather with architecture but there is too many beginning kids and people so it’s better to bring candy to get rid of them ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r579572587-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Royal Residence of the Mughals", "review": "This is the place where Jehangir and Shahjahan used to recite. The residence is build around a Garden and is located on the banks of the Yamuna. It was from here that Shahjahan used to have a look at the Taj across the Yamuna. The gallery offers awesome look of the Taj Mahal and its reflection in the river. Fading sunlights adds beauty to the view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r589778748-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "jahangir mahal", "review": "dedicate to jahangir shows father love having good garden enjoy with friends an have good pictures..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r563371929-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Amazing site", "review": "It was my nest spot after sightseeing of beautiful Taj mahal. It has very rich history associated with it and Akbar was the one who built it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r563290208-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Good place to take Great Photos", "review": "This is a very beautiful and luxurious place. It's a great place to enjoy with your friends and take great memorable photos।", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r569321524-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Admirable architecture", "review": "The craftsmanship in every aspect of this place was mesmerising. The unusual colour of the brickwork with the contrast inlay and clever architecture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r566502237-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "The mosque for the Queen", "review": "This mosque is usually out of bounds when visiting Agra fort but if you have the chance to see it (even from outside) don’t doubt to do it because it is a very lovely piece of architecture ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r568583101-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Wonderful Palace in Agra Fort", "review": "Monday 12th February as part of our day trip to Agra, our tour included a visit and guided tour of Agra Fort (reviewed separately).", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r567027657-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "first major part of the fort", "review": "As you enter up into the fort this part of off to your right, and your tour of the fort can start from there.  It is a magnificent sandstone with a lot of little exploring type passageways and rooms.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r567819256-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Hauz", "review": "This place was build by Jahangir of mughal empire this place is called a hauz which generally means water fountain.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r569546291-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Just inside Fort", "review": "This Mahal is located just inside the fort. The building is made of beautiful red sandstone and is filled with many small rooms and chambers.  Take the time if in the fort to go see.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r569948583-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Set aside a fair chunk of time to do it justice", "review": "A really impressive site - I loved the idea of double moat protection - one full of water and crocodiles, the other full of tigers - That should keep the malintentioned out!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r544422405-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Nur Jahan's Abobe", "review": "Jahangir Mahal is a palace inside Agra Fort", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r545688905-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "just as you enter", "review": "Just as you enter the agra fort, you see this big mug like structure on the left and you wonder what it is till the guide tells you its Jahangir's bath tub. like wow. was he huge or is this huge. its like a big bucket displayed in the middle of the garden... imagine a David-like-jehangir emerging from it in his natural state... hmmm.. could be quite a sight. I'm wondering if it has always been here.. in the middle of the garden... even in his time (ofcourse i know, it hasn't but one can always run one's imagination) and how he felt bathing under the sun and under the stars... must've felt like a king ;)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r569708182-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Palace for Royals", "review": "It is beautiful & also in the complex of Agra Fort. This place is used by Royals for their stay. It was originally built by Akbar & used by Jodha her Rajput queen", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r547111716-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Very historic site in Agra Fort Complex !!", "review": "This is on the right site of Agra Fort, a very historic site. The architecture style of the fort is mixed with Indian and Mughals. The fort was built in 15th century.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r547105972-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jodha Palace", "review": "This palace is inside the Agra Fort, hence you can imagine the size of Agra Fort. This palace was built by Akbar & mainly used by his Rajput Queen Jodha ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r547659966-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "close to taj mahal", "review": "situated inside Taj Mahal compound. Once you're done with Taj Mahal next you can visit here. Walk-able distance", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r553299281-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Great place to be", "review": "We were here during our Agra tour. The place was a quick stopover with a good view of the fort from the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r561140593-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing Palace", "review": "Wonderful experience going around the palace.....how we’re all these buildings built with so much precision. Amazing", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r556420552-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 3.0, "title": "Jahangir mahal", "review": "Built for Jahangir bynalbar shows father love nice Mahal enjoy with friends and have good pictures..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r562957497-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 2.0, "title": "A beautiful place but lacks organisation", "review": "The place itself is rather worth visiting: beautiful gardens in front of the main building, a staggering scenery of the river and Taj Mahal from the windows of the fort, superb architecture. Though in terms of my impression it was rather spoilt with security actions and unwise organisation overall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r562416872-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Taste of Mughal Architecture in Red sandstone", "review": "This palace is situated within the Agra Fort complex and is believed to have been used by Emperor Jahangir. Originally it was built by Akbar and the successive emperors have made additions and renovations to the original structure. Its beautiful structure houses a complex set of rooms and living spaces and one can overlook the Taj from some of its windows. Take your time and admire its beauty and the way this part of the fort has changed with successive emperors.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r523318614-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Incredible!", "review": "This area of the Agra Fort is beautiful. The detailis incredible! I would definitely recommend a guide or audio guide to be able to appreciate the history of this area of the fort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r528784193-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "An Amazing Mahal", "review": "This place built in the time of akbar is very big and beautiful. Its still very good. After seeing, your eyes will not moving on this.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r527203957-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Palace of JAhangir", "review": "You will see this as ssoon as you enter the Agra fort. This was adjacent to Akbars esidence. A place worth seeing", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r523983349-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Nice architecture!", "review": "This is situated within the Agra Fort and has a marvelous architecture. Royal wives of the King used to stay here. Take a guide to hear more amazing stories of this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r535258554-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "A key structure inside agra fort", "review": "Jehangir mahal is located within the famous Agra Fort. This red sand stone structure is historic. Very well maintained this structure housed the emperor Jehangir during his rule. Jehangir' monolithic stone bathing tank is an attraction here", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r535248390-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Palace inside Agra Fort", "review": "Jahangir Mahal is a palace inside Agra Fort. It is for the women of the royal household. This Palace is one of the major attraction in Agra Fort.  It was used by the great Akbar's Rajput wives.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r537453907-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "The first thing we see when entering Agra Fort", "review": "Like it or not you will see this ancient construction as soon you enter Agra Fort, but it is beautiful and a good example of mughal architecture like many places in Agra Fort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r537739427-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jahangir's palace", "review": "Literally translated means Jahangir's palace. Apparently constructed by Akbar and used by Nur Jahan till her death.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r541492757-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "The magnificent palace within the Agra Fort", "review": "This ornate palace constructed from sandstone is located within the Agra Fort. Jahangir Mahal was built by Emperor Akbar, the father of Jahangir. One significant tribute to Jahangir was his bathtub which is placed on display just outside the entrance to the Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r540467805-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Don't Miss this while visiting Agra Fort", "review": "This is also a very good tourist attraction in the city of Taj Mahal. It is located inside Agra Fort. Try to avoid during peak summer (Apr - July)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r479550795-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Must SEE", "review": "It is located within the Agra Fort and is made of red sandstone. Quite a magnificent site to see. It is around the perimeter of the fort and something not to miss.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r480347867-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Massive palace inside Agra Fort", "review": "Jahangir's Mahal is the first major palace building on the right, as you come in from the Anup Singh Gate. Supposed to be built by emperor Akbar for his son Salim Jahangir, it is a vast palace in red sandstone and frescoes ceilings. Must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r485680125-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "You get to see the finest architectural art here!", "review": "It was mainly for the ladies (the queens of the emperor). You will find at so many places inside the Agra fort itself, where the carvings have been done on a whole piece of stone to give it a designer look, it's just awesome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r488493464-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Jahangir mahal", "review": "Jahangir mahal is the one awesome architecture of mughal era..place is design on indo arabic style and preserved very well..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r489375643-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Red sandstone palace inside agra fort", "review": "This one is red sandstone palace situated inside the agra fort. It's built with indian and asian architectural style. A must visit palace during visit of Agra fort. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r490840545-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jahangir Mahal", "review": "Beautifully creation, Jahangiri Mahal is a palace for women belonging to the royal household It's kinda mixture of Hindu and central architecture.Must to see place If you are visiting Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r492725730-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Red Sandstone Marvel", "review": "Located inside the Agra Fort this is so pure red  palace. Its grand and magnificent, worth a view. One would be captivated", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r497095317-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Great Mahal!!!", "review": "Jahangir Mahal is situated inside the Agra Fort. Its a Wonderful, Superb and excellently architecture Mahal. Must Visit Place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r519932910-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 3.0, "title": "Mughal Trail ", "review": "It is a palace inside Agra Fort for women  of the royal household. It was used by  Akbar's Rajput wives. Jahangir's wife, Mughal empress Nur Jahan  used this magnificent palace as her residence until her death. The building complex has a huge bowl called Hauz - I - Jahangiri, was curved from a single stone. This Palace is one of the major attraction in Agra Fort. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r522455085-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A Must-See", "review": "Together with the Red Fort this is a magnificent edifice and grounds, well worth a visit and plenty of history to soak up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r457859765-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Inside Agra fort", "review": "This is also a part of Agra fort.. This is where Jehangir resided.. You can see his bath tub outside the palace. The structure has lot of carvings and details .. Made of red sandstone ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r466787395-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Big Palace inside fort", "review": "Its a huge palace inside the fort . It was living area of king, it used to have private rooms, mosque for king and his queens. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r463117809-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Mogul Palace within Agra Fort.", "review": "Just inside the main entrance this impressive red stone facades building is a cool oasis in hot weather.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r457692209-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jahangir Mahal", "review": "Jahangir Mahal the palace of Jahangir (Akbar's son) is one of the prominent structures inside the Agra fort. The palace is made of red sandstone and is architecturally very well made with good symmetry.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r472268573-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "too beautiful red stone hand works", "review": "Jahangir Mahal seems be most important for its too beautiful hand works on red stores . this part of palace has been used by women of emperor family . there is also a big stoe bowel which is called Hauz-e- Jahangir   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r473870912-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Magnificient", "review": "Jahangir Mahal is located within the Agra Fort and is a palace where Jahangir used to rule from..has some interesting architecture including a room where you can hear even whispers....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r473616599-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Son of Akbar's mahal!!!", "review": "Jahangir is the Son of Emperor Akbar and the beauty of this palace is amazing. Since it';s named by Jahangir but my guide told me that, it was used for Court. MAde with Red Stone and carvings are amazing. Worthy visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r477650341-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "a sure visit through the agra fort", "review": "this is located inside the agra fort and the interiors and decor made with red stones and architecture is beautiful.  if you have a tour guide he will explain you the history attached to this attraction. there is a room where you can whisper too and hear it and it echos. it is worth a visit for 30 mins", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r479073005-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "most beautiful palace of Agra fort .", "review": "Agra fort is one of the famous destination in Agra In Agra fort there are lots of building and palaces and Jahangir mahal is one of the beautiful mahal in Agra fort.This mahal was built by third mughal king Akbar for his son Jahangir. In this mahal there is  beautiful mixture of Muslim and Hindu religion .In this mahal there are beautiful carvings to see.Akbar built one temple for the Hindu wife.The open courtyard in Jahangir mahal was used in those days to celebrate the functions and festivals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r421062624-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "A Palace within Fort", "review": "This is a well maintained palace built by Jahangir, the son of Akbar. It is located within the Agra Fort and is easily accessible. Must visit if you are at the Agra Fort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r478457677-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Impressive", "review": "One of the majestic building in Agra Fort where Emperor Jahangir used to stay...very impressive and exhibits exquisite mughal architecture", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r433856610-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Nice Palace", "review": "Jahangiri Mahal may be the most noteworthy building inside the Agra Fort of India. The Mahal was used mainly by the wives of Akbar Rani Jodha Bai.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r429935208-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Part of Agra fort", "review": "Jahangir Mahal is a major part of Agra fort, located on Bijlighar area of Agra. Made by red stone its a huge building.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r446221142-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Best building within Agra Fort", "review": "The Jahangir Mahal, as the name suggests, was the palace of the Mughal emperor Jahangir and is the first building one encounters while entering the Agra Fort. A small Haud (water tank) lies just before its entrance. The building, built of red sandstone, is the most impressive in the fort and has survived the ravages by Shah Jahan (who preferred white marble) and the British.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r435241228-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Good", "review": "Jahangir Mahal, Citadel of Jahangir, Orchha Palace, Mahal-e-Jahangir Orchha, Jahangir Citadel; the Jahangir Mahal is a citadel and garrison located in Orchha, in the Tikamgarh district of Madhya Pradesh state, India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r440574758-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb", "review": "A must visit in Agra!! Do opt for winters for travelling and carry along shades, sunscreen and cap as scorching sun will definitely burn/tan your skin. In totality, its an exceptionally good monument..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r441862350-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Imposing and beautiful", "review": "This is first building which is visible on entering Agra Fort. It must have been a huge structure when it was intact, but some parts are already in ruins. Whatever remains of the structure is well restored and maintained. The palace is build using Red stone. The Facade of the palace enclosed a courtyard, which are both beautiful and imposing. They provides good back drop for photography. There is a huge tank carved out of a single stone, which is placed in front of the Jahangir Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r431798032-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Good ", "review": "This was one of the more memorable buildings in the Agra Fort. It is in equivocal condition as it has been considerably weathered and not renovated. Nonetheless, if you're in the Agra Fort, this part is worth walking inside and exploring - worth a few minutes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r451894415-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Well preserved with beautiful gardens", "review": "Behind this fortress like structure lies a courtyard with beautiful garden.  Great place to get some good shots of Indian Architecture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r364432065-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "its within the agra Fort", "review": "There is a big bath infront the mahal, a nice garden. Once u enter the main gate entrance turn right you will see this long beautiful red building. Enter the central door to other palaces insides  keep goingtill u srrived the viewing point of yamuna river n Taj, turn left u will enter to Shah's marble palace. Keep going up to upper floor will have more viewing points n place where the Shah living quarter, his private little mosque etc", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r454630868-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "''Beautiful Place''", "review": "Jahangir Mahal is a palace in Agra Fort, largest one of the palaces built inside Fort.May be the most noteworthy building inside the Agra Fort of India. The Mahal was the principal zenana palace for women belonging to the royal household, and was used mainly by the Rajput wives of Akbar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r366294969-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Jahangiri Palace in Agra Fort", "review": "Jahangiri Mahal was the principal Zenana (a place for women of the royal household and was mainly used by the Rajput wives of Akbar. The famous Mughal beauty and Empress Nur Jahan, used this palace as her residence. One of the things here that blew my mind was the Hauz-i-Jahangiri that was carved out of a single stone. This huge bowl was used as a container for fragrant rose water.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r357106769-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Nice", "review": "Agra is full of history and a visit to the palace of one of the most well known of Mughal kings does not disappoint. Great for history buffs. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r369887844-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Great architecture", "review": "The architecture is Just Great.the lawns around it are well maintained. Not to missed. Great place for photography.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r404653503-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Great architecture..", "review": "I really liked the mix of Hindu and Muslim architecture in Jahangir Mahal. It is located inside Agra Fort itself. It is the first thing people usually visit in the Fort. Simply take a right turn after entering the long walk in the Fort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r393998344-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "superb", "review": "City is not fully developed and apart from taj Mahala and sikandra there is no good place for visiting. The city ambience is quite low and city is totally congested and there is no good mall and also no good place of evening. The markets close to early but if you are food lover then this place is for you", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648736192-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Striking", "review": "A really impressive structure in the already impressive Agra Fort.  The marble is really striking, and only surpassed (by a long way, mind) by the marble in the Taj Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648152983-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "amazing marble palace within the fort", "review": "as mentioned the visit of the whole complex is a treat for the eyes, but this is the real gem, a stunning marble palace, make sure you do not miss it !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650429241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Interesting visit", "review": "It's nice that the lawns are nicely maintained, etc, I wonder if there is ever a quiet moment in these places...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r388174841-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing...", "review": "There are several things to watch inside the Agra fort and Jahangir Mahal is one of them. Great to see mugal architecture on red sandstone,  well designed place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650473453-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb Architecture", "review": "Inside Agra Fort you will find the Jahangir Mahal. The inlaid work inside is beautiful as are the carvings in marble. The water features had no water in them when we were there but that did not detract from the ambiance. Go early when is it cooler and quieter. Stunning place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654092515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Dominates the Fort", "review": "Superbly decorated sand stone with such fine details that it looks like made in wood, wonderfully well preserved. The whole structure dominates the interior of the fort. The charming monkeys give a nice touch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654794337-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Zenana", "review": "Jahangir Mahal, in the Agra Fort, is a zenana, a palace for women belonging to the royal household. As you walk through the entrance gate, the first structure to your right is Jahangir Mahal. It was built in the year 1570 by Mughal Emperor Akbar as the residence for his Rajput wives. It is a massive building (must have been a large harem!) made of red sandstone in a blend of Hindu and Islamic style with a lavishly decorated facade. Inside, an inner courtyard is surrounded by large halls. Most impressive is the exquisitely decorated stone brackets that support the ceiling beams.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656055747-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A part of an amazing place", "review": "As in previous reviews having a guide will really enhance your experience. Just having the combination of outstanding craftmanship working with the marble and stone coupled with a guide detailing the history of how and why it was built is magical. Be sure you are not in a hurry as you need to stop to admire the detailed workmanship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656391949-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Ladies palace inside Agra Fort", "review": "This is another very impressive part of Agra Fort, the palace of the women from the royal household. More amazing architecture and intricate carving to admire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r660610241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "superb", "review": "City is not fully developed and apart from taj Mahala and sikandra there is no good place for visiting. The city ambience is quite low and city is totally congested and there is no good mall and also no good place of evening. The markets close to early but if you are food lover then this place is for you", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648736192-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Must see", "review": "This is also a great place of significance in agra fort... This is a dedicated mahal built by Jahangir and is really very beautiful,.... The view of yamuna from this place is really good...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r661986952-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing...", "review": "There are several things to watch inside the Agra fort and Jahangir Mahal is one of them. Great to see mugal architecture on red sandstone,  well designed place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650473453-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Striking", "review": "A really impressive structure in the already impressive Agra Fort.  The marble is really striking, and only surpassed (by a long way, mind) by the marble in the Taj Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648152983-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "amazing marble palace within the fort", "review": "as mentioned the visit of the whole complex is a treat for the eyes, but this is the real gem, a stunning marble palace, make sure you do not miss it !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650429241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb Architecture", "review": "Inside Agra Fort you will find the Jahangir Mahal. The inlaid work inside is beautiful as are the carvings in marble. The water features had no water in them when we were there but that did not detract from the ambiance. Go early when is it cooler and quieter. Stunning place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654092515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Ladies palace inside Agra Fort", "review": "This is another very impressive part of Agra Fort, the palace of the women from the royal household. More amazing architecture and intricate carving to admire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r660610241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Zenana", "review": "Jahangir Mahal, in the Agra Fort, is a zenana, a palace for women belonging to the royal household. As you walk through the entrance gate, the first structure to your right is Jahangir Mahal. It was built in the year 1570 by Mughal Emperor Akbar as the residence for his Rajput wives. It is a massive building (must have been a large harem!) made of red sandstone in a blend of Hindu and Islamic style with a lavishly decorated facade. Inside, an inner courtyard is surrounded by large halls. Most impressive is the exquisitely decorated stone brackets that support the ceiling beams.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656055747-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Dominates the Fort", "review": "Superbly decorated sand stone with such fine details that it looks like made in wood, wonderfully well preserved. The whole structure dominates the interior of the fort. The charming monkeys give a nice touch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654794337-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Must see", "review": "This is also a great place of significance in agra fort... This is a dedicated mahal built by Jahangir and is really very beautiful,.... The view of yamuna from this place is really good...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r661986952-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Striking", "review": "A really impressive structure in the already impressive Agra Fort.  The marble is really striking, and only surpassed (by a long way, mind) by the marble in the Taj Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648152983-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A part of an amazing place", "review": "As in previous reviews having a guide will really enhance your experience. Just having the combination of outstanding craftmanship working with the marble and stone coupled with a guide detailing the history of how and why it was built is magical. Be sure you are not in a hurry as you need to stop to admire the detailed workmanship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656391949-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Dominates the Fort", "review": "Superbly decorated sand stone with such fine details that it looks like made in wood, wonderfully well preserved. The whole structure dominates the interior of the fort. The charming monkeys give a nice touch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654794337-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "superb", "review": "City is not fully developed and apart from taj Mahala and sikandra there is no good place for visiting. The city ambience is quite low and city is totally congested and there is no good mall and also no good place of evening. The markets close to early but if you are food lover then this place is for you", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648736192-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Zenana", "review": "Jahangir Mahal, in the Agra Fort, is a zenana, a palace for women belonging to the royal household. As you walk through the entrance gate, the first structure to your right is Jahangir Mahal. It was built in the year 1570 by Mughal Emperor Akbar as the residence for his Rajput wives. It is a massive building (must have been a large harem!) made of red sandstone in a blend of Hindu and Islamic style with a lavishly decorated facade. Inside, an inner courtyard is surrounded by large halls. Most impressive is the exquisitely decorated stone brackets that support the ceiling beams.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656055747-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb Architecture", "review": "Inside Agra Fort you will find the Jahangir Mahal. The inlaid work inside is beautiful as are the carvings in marble. The water features had no water in them when we were there but that did not detract from the ambiance. Go early when is it cooler and quieter. Stunning place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654092515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing...", "review": "There are several things to watch inside the Agra fort and Jahangir Mahal is one of them. Great to see mugal architecture on red sandstone,  well designed place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650473453-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "amazing marble palace within the fort", "review": "as mentioned the visit of the whole complex is a treat for the eyes, but this is the real gem, a stunning marble palace, make sure you do not miss it !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650429241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Must see", "review": "This is also a great place of significance in agra fort... This is a dedicated mahal built by Jahangir and is really very beautiful,.... The view of yamuna from this place is really good...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r661986952-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Striking", "review": "A really impressive structure in the already impressive Agra Fort.  The marble is really striking, and only surpassed (by a long way, mind) by the marble in the Taj Mahal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648152983-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "amazing marble palace within the fort", "review": "as mentioned the visit of the whole complex is a treat for the eyes, but this is the real gem, a stunning marble palace, make sure you do not miss it !", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650429241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "superb", "review": "City is not fully developed and apart from taj Mahala and sikandra there is no good place for visiting. The city ambience is quite low and city is totally congested and there is no good mall and also no good place of evening. The markets close to early but if you are food lover then this place is for you", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r648736192-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A part of an amazing place", "review": "As in previous reviews having a guide will really enhance your experience. Just having the combination of outstanding craftmanship working with the marble and stone coupled with a guide detailing the history of how and why it was built is magical. Be sure you are not in a hurry as you need to stop to admire the detailed workmanship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656391949-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Ladies palace inside Agra Fort", "review": "This is another very impressive part of Agra Fort, the palace of the women from the royal household. More amazing architecture and intricate carving to admire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r660610241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Amazing...", "review": "There are several things to watch inside the Agra fort and Jahangir Mahal is one of them. Great to see mugal architecture on red sandstone,  well designed place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r650473453-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "A part of an amazing place", "review": "As in previous reviews having a guide will really enhance your experience. Just having the combination of outstanding craftmanship working with the marble and stone coupled with a guide detailing the history of how and why it was built is magical. Be sure you are not in a hurry as you need to stop to admire the detailed workmanship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656391949-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Dominates the Fort", "review": "Superbly decorated sand stone with such fine details that it looks like made in wood, wonderfully well preserved. The whole structure dominates the interior of the fort. The charming monkeys give a nice touch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654794337-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Superb Architecture", "review": "Inside Agra Fort you will find the Jahangir Mahal. The inlaid work inside is beautiful as are the carvings in marble. The water features had no water in them when we were there but that did not detract from the ambiance. Go early when is it cooler and quieter. Stunning place", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r654092515-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Zenana", "review": "Jahangir Mahal, in the Agra Fort, is a zenana, a palace for women belonging to the royal household. As you walk through the entrance gate, the first structure to your right is Jahangir Mahal. It was built in the year 1570 by Mughal Emperor Akbar as the residence for his Rajput wives. It is a massive building (must have been a large harem!) made of red sandstone in a blend of Hindu and Islamic style with a lavishly decorated facade. Inside, an inner courtyard is surrounded by large halls. Most impressive is the exquisitely decorated stone brackets that support the ceiling beams.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r656055747-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 5.0, "title": "Ladies palace inside Agra Fort", "review": "This is another very impressive part of Agra Fort, the palace of the women from the royal household. More amazing architecture and intricate carving to admire.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r660610241-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Jahangir Mahal", "rating": 4.0, "title": "Must see", "review": "This is also a great place of significance in agra fort... This is a dedicated mahal built by Jahangir and is really very beautiful,.... The view of yamuna from this place is really good...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d10049107-r661986952-Jahangir_Mahal-Agra_Agra_District_Uttar_Pradesh.html"}]