[{"point_of_interest": "Kailash Temple", "rating": 4.0, "title": "Divine Temple!!!", "review": "The Kailash temple is in Bainpur Mustkil, Agra. Its a very divine temple of Lord Shiva. Got nice darshan. The temple is little crowded.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12034433-r519956897-Kailash_Temple-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Kailash Temple", "rating": 4.0, "title": "Kailash Temple", "review": "I visited this sacred temple recently situated at village kailash on Mathura - Agra road and nearer to Sikandra. It is a sacred temple of Shiva (Kailash Pati). There are two Shiva Linga set together at one place and worshiped by all. The Yamuna river is flowing nearby the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12034433-r451629376-Kailash_Temple-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Kailash Temple", "rating": 4.0, "title": "famous temple", "review": "The Kailash Temple at Sikandra is another temple dedicated to Lord Shiva. It stands close to the river Yamuna.Sikandra is 13 kms far from the heart of the Agra city. One can board into bus at Idgah Bus Stand, Agra for reaching this destination.The majestic temple attracts millions of devotees without paying regard towards caste, creed and colour from throughout the country, which not only comes to pray but also to enjoy the cool breeze from the Yamuna River and the serene environment of the area.The temple remains open between 6 AM to 9 PM on all days and Bhakts can attend the aarti both in the early morning and in the evening. Main offering to Shiva Bhagwan includes Belvpatr, Dhautura flower, milk, flowers and sweets.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12034433-r576833481-Kailash_Temple-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Kailash Temple", "rating": 5.0, "title": "Har Har Mahadeo", "review": "It is said that the is the temple founded by Parshuram ji ,here you will find two shiv Linges ,I have not seen two shiv linge under one roof ,it is said that these Shiv linges are thousands of year old", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12034433-r591575009-Kailash_Temple-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Kailash Temple", "rating": 5.0, "title": "spiritual and ancient place", "review": "here is an ancient shiv linge, means two shiv ling.it is said that here is two shiv ling,one we see and one for find.i can't see second shiv ling. hope that you will find it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d12034433-r592128521-Kailash_Temple-Agra_Agra_District_Uttar_Pradesh.html"}]