[{"point_of_interest": "Korai Village Agra", "rating": 4.0, "title": "the best", "review": "this expereince is one of the best way to see yourself to other people. it shows you how they live, the culture that they have and how people survive their daily living. so proud to witness it all. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r293540835-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 3.0, "title": "Korai Village, Agra-Fetehpur Sikri, India", "review": "Based on report and recommendation on Trip Advisor, we drove to Korai Village to see the tribal village. In the village live tribe rearing animal for their livelihood. Expats who wish to see and study the lives of wandering tribes, this is the best place...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r314221498-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Visit to Korai Village in Agra", "review": "Kudos goes to the person who has taken this great initiative to give back to society. My wife and I wanted to visit the Taj Mahal and Fatehpur Sikri but wanted to experience indian village life. We decided to stop by Korai village in the morning before continuing further on to the other two monuments as it is a ten minute drive from Fatehpur Sikri. We had read about Korai on trip advisor, while browsing through the top things to do in Agra. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r499148585-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 4.0, "title": "A cute little village", "review": "This is a cute village with an interesting history. According to my tour guide the residents are afghan transplants that have been here for generations. It's Small you could almost miss it; as its not quite precisely situated on the Trip advisor map. Do not let your driver/ Tour guide talk you out of this one. The children warmer my heart. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r338197860-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 1.0, "title": "Disappointed", "review": "I felt this was a staged visit with everything happening exactly as in a previous trip advisors report.  These people have satalite tv ,yes electricity that is subsidised disco equipment. There are far from needing my sympathy.if you want to see really life in Idian just walk down the back streets in Agra and around the areas where people are sleeping in makeshift tents. Sorry but all 3of us felt it a waste of money and time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r472201197-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Brilliant \"Real Indian Experience\"", "review": "This was the first time I ever visited Rural village in India. I must say it was just fantastic. All of us enjoyed cultivation  lessons organised by our tour operator in the village. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r365799490-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "the rural village in Agra", "review": "Enchanted after seeing life of this village. People are friendly & innocent wearing traditional dresses.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r384545264-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 4.0, "title": "In way to Fatehpur Sikri !!", "review": "This is a small village more like a heritage village, portraying a typical Indian ecosystem of homely cooked food and experience to local culture. You can drop by while your way to Fatehpur Sikri.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r547106224-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "see real india", "review": "when you cross highway so you can see many villages and the journey between agra to jaipur so interusting and if you have chance and you have right driver so please dont loss chance to visit indian villages ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r599244448-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "A beautiful fun day with the kids", "review": "Chanced upon this small village on Sharell Cook's blog and am so happy we decided to visit the same. It was such a beautiful experience mingling with the kids and the villagers ..one of the best days of our trip. It was so different from the last one week of sight seeing and a refreshing change for us. Also liked the concept of the money being collected and given back to the villagers in the form of vegetables, fruits and their daily needs. Kudos to the people behind this initiative.  If you have some time in between your sight seeing, do fit a trip to Korai will be worth the effort. Only drawback it shows you the stark reality of how the poor population lives which can be hard hitting", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r550133358-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "\"My first visit to korai\"", "review": "My holiday was full of fun while lasted in India. During my stay in Agra, I went to this village and had lovely experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r227397098-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Tribal village.", "review": "Went to the korai village in June when I was on my way to Jaipur from Agra. There are approx 12 families with bunch of kids. It's a unique experience there, our assistance mr Tikendra gave us a short and precise introduction before entering the village. Quite fascinating experience. Although it was extremely hot weather during our visit we had amazing time there. I will most definitely visit again if I happen to make it back to India in future, thanks gets holidays for the arrangement. Truly appreciate it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r219762014-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "What great work!!", "review": "I was in Agra when our FAM TOUR GROUP were invited to visit the Korai Village. This is a village of about 12 families. They used to entertain people with their bears, but the government has taken away the bears as animal rights objected. So now, these people are jobless and depend on visitors and locals to feed, clothe and educate them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r230814227-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Wonderful Experience !! Please visit ....", "review": "Nice learning experience. I really enjoyed visit to this village. I will recommend to all my clients and traveler to visit and experience other side of life. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r234933825-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 3.0, "title": "Snippet of Rural India", "review": "Korai Village is located few kilometers off to Fatehpur Sikri Highway. It is a small village nestled in Agra where you can get a glimpse of the daily life of the tribal inhabitants. I personally do not recommend this as a must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r276028842-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Enjoyed the visit", "review": "I have lived in Agra during the 70's and wanted to take the children back to visit India. We visited the Taj, Agra Fort and Fahtehpur Sikri and the Korai Village. The time was well spent to interact with the villagers and hear their stories.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r245371181-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 4.0, "title": "go for it", "review": "KORAI's is a hamlet of tribal qalandars with intriguing history, & culture. You would experience the real, true and rural part of India here. People here are nice and welcoming ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r276274583-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Not to be missed", "review": "This was one of the best parts of our India tour. I would like to thank our travel agent for recommending this to us. It is a must visit for everyone who wants to experience the real India, something away from the ordinary and a very refreshing addition to the usual sightseeing. The best part is our visit helps this villagers. We would recommend every visitor to Agra to take out a couple of hours to visit this village.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r275611822-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "A real insight into the ,real ' india", "review": "If you have the time during your trip to Agra you must visit this little village with a dozen odd families. Still untouched by the commercialism which has usually spoilt all such projects, this is a beautiful experience. Despite living in such poverty the people are so warm it's a delight to spend a couple of hours with them. Very highly recommend", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r278451291-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "A village made for you!", "review": "Korai Village is a small village, made in a traditional way, with people who may had no other way to live a normal life. Now, they can live a better life in this village, made in a traditional way. Travellers may have an experience in other traditional villages in India, but travellers with not such a plenty of time may want to visit Korai village in order to see/meet country life style easily, with a short excursion. For them who love photo shooting, it's even better... You will make some great photo portraits!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r198233640-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "A must see in Agra", "review": "We were a little sceptical when our tour operator suggested this add on for our planned trip. But am so happy we did take out the time to visit this village and get to know what an actual village life in India is all about. This is not a tourist attraction but an insight into the real India.very much recommended. A big pat on the back to who ever initiated this project as i was told its really helping the villagers. I would strongly recommend this activity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r215061279-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Korai Village Agra", "rating": 5.0, "title": "Experiencing the real India.", "review": "We actually wanted go to Agra just to see the beautiful Taj Mahal with a group of friends. But the tour  operator suggested that we might as well experience a glimpse of real india through Korai Village,Agra. Rather than just visiting popular places, we thought why not a little other side of the India. Never knew, It could be that fulfilling experience after all. We were so glad that we took the suggestion. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d6406972-r219323305-Korai_Village_Agra-Agra_Agra_District_Uttar_Pradesh.html"}]