[{"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "A really noble work", "review": "This place is really involved in noble work. All of us must support them in the great mission of Mother Teresa. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r522469282-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Tremendous work for humanity that can use your support", "review": "This is a not a tourist attraction so visit it for a genuine experience of the good work that is done here. Also if you are queasy about seeing suffering then better avoid it. These amazing people look after little children who have disabilities and are abandoned. Some are tiny babies. Another part of the home looks after adults who have mental health issues as well as disabilities. You need to come to the office from where you will be taken around the home with a staff or one of the sisters. It is heart-warming and painful at the same time, to see so many people in need and the dedication with which they get help here. Please do make a generous donation before leaving.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r571398167-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Help", "review": "We were told to visit this old age home & orphanage of Mother Teresa ..which is in Agra .. we spend some quality time with the small children & old people ... all i can say it gives you great pleasure and relief in the end .  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r535831884-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Need to be visited when people came to Agra", "review": "I plan to come but didnt expect to be very welcome as i didnt call to be attend ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r569801275-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "living examples of self less service", "review": "This is the one of the Mother Teresa Homes which stole my heart and made me a fan of Missionaries of Charity. I got connected here in around 1996. The Sister In-charge showed me the whole complex which even took care of leper inmates besides little kids. The motto of service before self was very much seen here. Remember the team of nuns here brought in leper when they got a call that a dying man was lying by the roadside. The team rushed with their ambulance brought in that man, gave him a wash, cleaned and dressed his wounds taking good care of him and saving his life. Impressed by their selfless service I got more involved with the center and even later got my uniform stitched by the inmate who knew stitching  and used to repair clothes of other inmates in the center. After completing my tenure in Agra, my connect remained with Missionaries of Charity in Hyderabad, Kolkota  and then Delhi as I moved(was transferred). Later met the same sister incharge in Kolkota. Really cannot forget the selfless service the sisters of Mother Teresa Homes render..... (sharing experience of 1996-97)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r536692204-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful work being done. Was great to make a contribution.", "review": "Seeing the adults and children cared for was an eye opener. Glad we made the time to visit. The place is split in three, men, women and children. The nuns were more than happy to show us around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r540391147-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Missionaries doing an exceptional good to mankind", "review": "This group of Mother Teresa missionaries is doing a yeoman service to mankind by serving the poor, needy, weak,old, sick and very small children, who has no one to care. They are very courteous and always welcoming the outsiders. Things like old clothes, woolens, detergents, soaps, biscuits, lentils and wheat flour are always welcome as donations by the sisters.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r544395607-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Do not miss", "review": "This was an experience not be be missed.  Seeing the way the children and handicapped are cared for renews ones faith in humanity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r471678013-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Good", "review": "It takes nine years to become a full-fledged Missionary of Charity. An initial short-term \"come-and-see\" period is available. Those considered possible candidates by the Congregation may enter Aspirancy, focused on learning English (which is the community language) for those who are not from English-speaking countries and religious studies. It is followed by Postulancy (introduction into the study of Scripture, the Constitutions of the Society, Church history, and theology). If found suitable, they enter the Novitiate, the beginning of the religious life. Novices wear white cotton habits with a girdle, and white saris without the three blue stripes. In the first year (called canonical), they undertake more religious study and learn about life as a Missionary of Charity, the second year is more focused on practical training for the mission life. After two years, they take temporary vows for one year, which are renewed annually, for five years in total. They also receive the blue striped sari of the Congregation, and a metal crucifix. In the sixth year, they travel to Rome, Kolkata or Washington D.C. for \"Tertianship\", further religious study, at the end of which they make their final profession.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r579669556-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Charity", "review": "A liftetime of charity and kindness - a reminder of our humanity and a great lesson to teach our chilfren. So glad we went, neednt spend too long, maybe 30-45minutes but so much to learn, appreciate and see. The sisters are so devoted, and see the heartache of poverty and abandonment", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r571853712-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "A sad eye opener.  But worth it.", "review": "We visited with a group.  Very touching,  had a young boy climb up me and cling to me.  When I put him back down he looked me in the eyes and said dada.  The section with challenged children is even more heart wrenching.   A sobering reminder of how good most of us have it in North America.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r470865901-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "PLACE TO LEARN HUMANITY AND SEE THE TREMENDOUS ROLE OF CHARITY", "review": "The centre is famous for his work of humanity.It has been divided into three chambers. They have a reserved section each for old men and women. The nuns care for them in all their capacity, not only providing them with food, shelter, clothing but also with words of comfort at all times. They are made to feel at home and are tended with extreme care and love. The next section is reserved for the kids. Besides providing the much love, care and understanding the young ones need for healthy growth and lifestyle, the non - government institution aims at giving parental love and motivation to the abandoned children to overcome apathy and grow up to be strong individuals. The foundation not only facilitates free education, healthcare, clothing, and shelter but also assists children to pursue quality education at higher levels.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r575846390-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "HUMANITY STILL EXISTS", "review": "When people come to Agra people visit Taj & Fort and at most Mehtab Bagh because they are famous. Nobody suggests them to visit Missionaries of Charity but please update it in your list for your next visit. You will how few humble nuns take care of orphans, challenged children and adults and also the abandoned old people. This is place that will make you thank God for all you have. The innocent faces of children waiting for your attention. The old people seeking for your love and warmth. Spend some time with them and the nuns to understand the life there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r477617119-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give your contribution", "review": "This is not an attraction. Is a place you go and donate because you want to support the work of the missionaries. When I went, there were absolutely no turists. By the way, no pre-booking needed, just drop by. The kids (also adults) sleep between 12:00 and 15:30. So, if you want some interaction, then drop by before or after these hours.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r478191075-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa's Missionaries", "review": "What a great experience to visit the tomb of Mother Teresa.  As a Roman Catholic I thought this was truly a moving experience. I could have used a little more time going through the artifacts of her life.  I would definitly recommend this stop if your in Kolkata India. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r482593244-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Lovely for a donation visit", "review": "If you are visiting this area please consider this location for a donation and a visit.  Very clean facility. donations go to good use. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r488040070-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Fabulous and very welcoming.", "review": "We arrived outside of visiting hours but we're still welcomed in. The nun that took us on a walk around was lovely and extremely grateful for our visit and the goods we brought from the uk. The children were mainly asleep during our visit but the ones that were awake seemed very happy. The grounds were lovely and the rooms were brightly painted and very clean. Overall can't fault. Would happily return.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r478643208-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Must visit to see the reality of agar", "review": "The real situation in Agar is more important than just sightseeing here, donation not limited to money but many goods for the children who no one care even their parents", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r483592720-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "love all", "review": "wish i had lot money so i can help each and evry child ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r479933434-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A touch of reality", "review": "Do make time to visit here and if possible donate cash or items to support the good work here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r467465706-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Catholic stop", "review": "A very important stop for those of the catholic faith. Very helpful and kind staff and a sense of what life was like for her.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r452406032-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "One of the most moving things I have ever experienced", "review": "You really have to witness it to get any sense of what these centres do. It was so moving to see 1) people that society has forgotten 2) realise that there is a section of people that do care and without them these would lost souls.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r459574367-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Worth a visit to pay your respects", "review": "Mother Teresa lived her life for the betterment of everyone around her. It was a touching moment when we visited her Mission. It can be confronting for those of us who have a tendency to be emotional, if you can spare some cash as a donation to the mission then that goes a long way to helping the severely disadvantaged ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r459113563-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Call them first", "review": "In case you are going for some donation just call them first to inquire about what is required, usually dry ration is preferred like aata, rice, pulses, suji, poha, and more. If you want to visit children then check for their availability.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r521710963-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Heart breaking", "review": "I went to visit the kids and it was so heartbreaking. I fed them, hugged them and danced with them. Coming here makes your heart bigger. If you want to know what the real world is, if you want to give love to children in need, you should stop by. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r442352990-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful nuns", "review": "This is a very moving place run by only a few nuns but catering for so many women, men, and children op hand or with special needs. If bring your children here, and I think you should please prepare them as it broke the heart of one of the men in our party. It was lovely and clean and they were eating and being fed during our time there. Lots of cots and beds in one room but all neatly made. I had made a collection from my church before coming so that I could leave a donation. Please be generous when you are here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r470093211-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Great charity well run", "review": "Don't forget to bring a photo copy of your passport.  Or at least the passport number.  To donate in India you need it.  This is a great organization started by an amazing woman.  Every penny hoes  to helping those in need.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r467720805-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A Must for People Looking to Donate", "review": "I can't say enough about the nuns and people who run this place. Mother Teresa would be proud. The children and adults living here are clean and well taken care of as are the rooms and facilities. They must work round the clock... I can't imagine. I wish everyone in the U.S. could visit a place like this-- seems unreal that people are hell bent on not vaccinating their children. The liberal/hippy fad of this is even more terrifying to me now that I have seen what polio can do. I'll never forget this experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r468059763-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give them what they want", "review": "Prem Dan is a hindi name which means give love ( spread love), when you enter this place you feel humbled & ready to help the inmates here & many like them around the world. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r467768549-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Great India Adventure", "review": "We visited this place, brought some bed sheets to help the less fortunate kids, they were so sweet and thankful, a heart breaking place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r368558755-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A Very Meaningful Place to visit", "review": "This is located off of a very busy street in the heart of the city.  Be aware there are beggars around the mission.  You have to take off your shoes to enter.  Pictures of her room and tomb are not permitted.  We visited the orphanage there.  We could visit the orphanage for \"normal\" children and then proceed to those with disabilities.  There were 28 of us in the group and very few did the latter.  The part of the orphanage we did see had workers from all over the world.  The children and their rooms were very clean and orderly.  We were very impressed.  There is a small museum to visit about the history of Mother Teresa.  Very interesting.  It's a very moving visit.  Donations are allowed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r470148660-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Saint Mother Teresa", "review": "I have visited this place serveral times but writing the review first time,it is home for home less children founded by Mother Teresa ,building is situated in Pratap Pura not very far from Agra cantt railway station", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r415952642-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "TRUE LOVE AND CARE", "review": "At first we felt a little hesitant to enter, but the Nun who met us at the door welcomed us so sweetly and lovingly we could not resist but enter the Room. Later we were shown around and what was most surprising was to be met with so many little children. Our Hearts were touched and I even wept with the feeling of deep emotions i has when cuddling those cute little Angles. Yes Mother Teresa'a Missionaries are true Angles in Human Form. May God Bless all those  serving,loving and taking care of all those Homeless little kids... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r404013002-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Inspiration for charity", "review": "Mother Teresa's Missionaries of Charity is the great place to visit. It inspires people to be a part of charity. To begin charity, you should not search any specific place or time. Charity begins at home. We can start caring our maid's children by donating cloths, books and food.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r413808764-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful experience", "review": "I loved seeing the faithfulness of the nuns in their care for the children.  The children that I saw looked clean, healthy and happy.  Truly inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r370797020-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful People", "review": "My husband and I visited here while on holiday in Agra and came prepared with toys and clothes for the children but didn't realise that there would also be so many adults cared for here. The staff do a fantastic job and need all the help they can get in the form of donations. I urge everyone to visit this place even if it is just to spend time with the children", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r394529518-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Heart breaking but Very Good place", "review": "It's always heart breaking to see children without a family.  Although the orphanage takes good care of them.  The only downside of visiting this place was that we were not allow to play with the children or pick the babies.  We purchased a book and I was looking forward to sit with the children and read to them but they did not allow us to do that.  I wished they allow the tourist to play and give some love to the children.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r422840678-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful to see Mother Teresa's work still going strong...", "review": "We enjoyed seeing where Mother Teresa spent her time.  Take the opportunity to read the many articles and see the many pictures in the museum section.  We also were glad to go to the orphanage as well.  What an incredible woman she was and her legacy certainly lives on.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r434226722-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Amazing place", "review": "An amazing place to visit. You can feel the emotion in there and the hard work that is put into it", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r327979626-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Love and human dignity", "review": "We visited this special place in Agra and we were moved by the love and commitment of the nuns and the volunteers who care for the basic needs and the dignity of the most disadvantaged people in their community.In our harsh and selfish world it is easy to forget the simple, everyday acts of human kindness and generosity which are present in the world but are not so visible. This is a place which reminded us how much can be done by a few with love and commitment. A humbling and inspiring experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r336531229-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful works of Mother Teresa", "review": "You can visit the orphanage and a small museum that tells about Mother Teresa's life and show where she lived.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r429246395-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Saints on Earth!", "review": "This is not the sort of place you'd like for - and National Geographic provided us the opportunity.  To see the work these Sisters are doing in an orphanage founded by Mother Teresa is a unique opportunity.  They are caring for the poorest of the poor.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r328390689-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Quick stop to see the good work and make donation", "review": "Close to other attractions and really worthwhile to just pop in and say hello to the children. The sisters are helpful and I got the opinion that they are happy to show you around. There's no fuss and only expect a swift tour of the premises. Children and young adults are studying, at play and some just sleeping. The place is well maintained and everyone is very happy and smiling.  There appears to be plenty of toys and this is just one of many centres in India. Make a generous donation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r351528896-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Home for orphans", "review": "This is a home for orphans and disabled children. The place is neat and clean. Sisters here are doing a great job of dedication and devotion.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r349323967-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "excellent job done", "review": "Do make it a point to include this in your itinerary of Agra ,the job done by the sisters is worth an applaud you will be overwhelmed by their service.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r339589616-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very Touching", "review": "Moses Rosario, A christian boy from the company 'Agra By Bike' - showed us his Parish church and the Mother Teresa's Missionaries of Charity. If you want to feel some love from Indian children, it is heartbraking but warm experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r336647471-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Such Happy Children", "review": "This was my first stop in Agra.  What a lovely place where the ladies are doing such good work for this less advantaged children.  No pictures allowed and a donation is suggested.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r357865437-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Got Real peace!", "review": "i visited here in march 2015.Here Old people,physically handicapped children and other children are present.They are doing great jobs,take care of Children education and old people.You can come here between a time limit,and can buy something for children here and can spend some time with them,talk with them,play with them.I bet you will get real peace here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r344889779-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Here goes foreigners", "review": "There is that you have to guide the foreign friends.People of various countries around the world are coming to volunteer.I think the beautiful people of the mind are gathered. I think that it is good for long-term residents from meal comes out. Close to there is also a cheap hotel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r347052424-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help another charity in Agra!", "review": "As requested by the people that work at this amazing place, I urge you to do some research and find another charity to donate your gifts to. They said because of trip advisor they have more than enough and that they are donating the stuff they are given to other charities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r301046386-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "THUMBS UP!", "review": "its good too see place like this where people are trying to help and took care to other people most especially children. it melts my heart seeing that they been took good care of this kind of charity. how i wish all of the government around the worl would have a charity like this.  very thumbs up! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r293541333-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Amazing Experience....-Visited April 2011", "review": "I visited Mother Teresa's on my fifth month of living in India. They do amazing work and the sisters were kind. Walking in and seeing Mother Teresa's tomb was awe inspiring experience and transformative. As a traveler, it is important to see this work happening and to support India.  I went with my mom, sister and it was worth while. I would recommend anyone to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r286071239-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "I visited Mother Teresa's Missionaries of Charity in the Philippines", "review": "To be honest, I was in mixed feelings: sympathy, pity, a little bit scare and a little bit fear when I see them. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r302018344-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I volunteered there", "review": "this was not a vacation destination.  I went there to work as a volunteer for  Mother Teresa for a month back in 1989.  They did amazing work for the poorest of the poor, and it was a life-changing experience to be there.  Challenging conditions - made me appreciate home much more.  Date is wrong .  There were no options for entering 1989.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r289791223-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "wonderful souls", "review": "went there, visited it and was amazed with so much love I received and saw there. anything you could offer is more than welcome and so much needed. i was thriled to see how much dedication to have to this kids and how much theyr eyes were shining when I went their", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r303598661-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "donation of clothes", "review": "We visited this orphanage via information provided by a local shopkeeper as we had brought some clothes from England to donate to them. We were met by a lovely nun who show us around & took us to meet some of the children & staff (very humbling) It's not just a orphanage it takes in anybody who need help male/female/ young/old. We intend to send clothes to them when ever possible ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r327524904-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Must Go !!", "review": "I went to this Orphanage on one of my friends birthday. I got tears in my eyes when I saw these small kids there without their parents. This trust take care of kids but not like parents do. I usually go whenever I get time to spend with the kids. It will give u peace and little change from stress   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r309398894-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Place for Parentless, differently abled, helpless people", "review": "A place where helpless, differently abled, parentless people are taken care of by the Missionary staff. Hats of to the people of Missionary who are able to maintain the hygiene of the place. If you want to donate, this is the right place. You can donoate anything from money to cloths, toys etc...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r306537784-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 3.0, "title": "How can you rate a home for oprhans and disabled?", "review": "I came to this home one afternoon with a bag full of toys for children. My driver went to sisters room to let them know that I was there, but nobody came to say hello or offered to show me the place. So I went by myself to see children and spend some time with them. I held the babies, played with them and started giving them toys. Still no one from adults showed up. Not that I needed a big thank you but perhaps expected some interest on the adult side to show me the place and answer my questions on how I could further help the home. Nobody seemed to care. At least the place seemed clean and saw a playground there as well. Hope children are taken care of properly. I left it with a mixed feelings.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r324803813-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa", "review": "Check for the visiting times as we missed this and the children where asleep, although the Nun still showed us around, we didn't want to stay long, we listened to all the amazing work and support they do. This place really is incredible all down to the nuns. We took giant Sudo Creams with us as a gift and the nuns eyes really lit up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r255167995-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa", "review": "Visited this beautiful place, you will be so touched with the work these nuns do every day of the year with such dedication and devotion. Take anything you can to help them as the need is great and give as much as you can. When I visited there was no volunteers. Help as much as you can, sheets for the beds, creams , paracetamol, ect ect all will help", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r258847550-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very good work!God bless you!!", "review": "Here the sisters take care of abandoned special kids and adults .. We also saw others kids from the poor family .. You must donate here.. We were moved by seeing them .. Sisters and everyone around work very hard and have dedicated their life  .. One must help them and contribute .. Gob bless them!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r269503695-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A moving experience", "review": "A heart wrenching experience. Roomy, clean and airy place with children from months to teens.  Our guide was so moved that he is going to spend one day a week helping there.  All the children seemed super happy even though many had major disabilities. I could have left with one little boy about 18 months old who never stopped smiling. Do visit if you can.    ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r263257262-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "It was a moving experience!", "review": "Such a humble place that we cannot pass along without getting touched. We all Know the missionary work but seeing it and seeing the residents is another thing. A quiet place, serene and humble. From new born babies to adult persons all have their own space. Everyone seemed to be happy and quiet although many of them had major disabilities. It takes you to a new level of thinking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r264668193-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Peaceful", "review": "A very special place for me. It was humble, it was warm and welcoming and mostly it was a quiet sanctimonious oasis in the heart of throbbing Calcutta. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r260864649-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "My visit to Mother", "review": "Her foundation sits on a small crowded path in Kolkata. Kolkata is great. Wonderful food and fun people. Truly a great city. As I walked in the Missionaries of Charity I could feel the spirit of it's soul. It's a quiet place of prayer and is interesting to visit. The nuns who care take and now work the property are interesting to speak with. Mother Teresa's body sits in a tomb in the center of the prayer room. It;s not fancy but demands the respect of those wh enter naturally. Down the hall sits Mother Teresa's room where she used to sleep and write. It's a simple room with just a table, chair and bed. That's it. Not even a ceiling fan. Kolkata is one hot place and I don't know how she did it. This is a must visit in Kolkata. The church where her funeral was held is just down the street. Also worth a visit. A lot of spirit in Kolkata.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r264335367-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Wonderful work", "review": "We took over 30kgs of children's toys and clothes to donate to this well deserved charity. The sisters here work with compassion and empathy to the many children here. There is also a dormitory for women with special needs so if any one is visiting women's clothes are also gratefully received. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r280829845-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Charitable Mission", "review": "Missionaries of Charity at APC Road, Kolkata has become a landmark for the poor and don't haves. The magnanimous work done by Mother Teresa and other Sisters after her death is beyond expressing in language. It is a must see and is situated in central part of Kolkata near Sealdah/Moulali", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r279463870-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Worth the visit", "review": "I feel really honoured to have been able to visit here. It's heartbreaking to see so many children and adults living here but the sisters do an incredible job of looking after them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r244256692-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "How can you not visit here", "review": "A place of peace in the business of Calcutta.  Visiting here allowed us to get back to reality a bit.  Understanding what these sisters still do for the poor and the sick makes you realize that God cares for those less fortunate as much as He cares for us.  Amazing women who are called to serve and do it with hears of love.  Humbling and inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r242719579-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "one of the most beautiful places i've ever been - jaime alcaraz montreal", "review": "i cannot say enough about the spirit of both the people and the place...the mother teresa house is truly extraordinary, it exudes peace and love...the history, the calm, the serenity, it is surreal...and i am not a religious person....yet it does't change the fact that the place is filled with GOOD...an absolutely must-see place...you will learn of how they have healed and helped, of who has assisted, you will feel the great work she and everyone here have done...it's incredible, and as i said i am not a person of faith at all - jaime alcaraz montreal", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r279816667-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Wonderful work in need of help", "review": "Our driver, who is involved with this charity, took us.  The sense of peace and serenity was apparent not only in the Sisters who run this charity but also in all who were there, and seemed to have transferred itself to the orphans and rejected, disabled children who live there cared for by the sisters and young girls saved from unemployment or worse in the villages, who are given a home and taught baby and child care so that after two or three years they may find work as ayahs in families. This is wonderful work well worthy of support.  All in all a moving experience which would give anybody pause for thought.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r244931050-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Sad", "review": "Interesting but sad place to visit. Felt a bit pressured for donations, which I was happy to give without being pushed! Kolkata mission is a better visit if you want to see the original ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r246813158-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "this is true welfare", "review": "every body should visit this and do something for such children.they doing very hard job to look after them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r253835975-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very peaceful and worth supporting", "review": "Unfortunately when we stopped by they were very busy getting the younger children up for the day but they were happy to let us just have a look around and smile with the kids. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r254060535-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Lovely", "review": "Unfortunately we came at 12 so it was a bad time for visitors but it was the only time we could get there and we had some clothes to bring. Despite it being lunch time and nap time for the children one of the sisters was still more than happy to show us around and say a quick hello to everybody. She explained to us how the whole thing works and it made me feel very special and appreciate everything i have a home and a loving family. Would recommend a visit if you have time, if not it a worthy charity for your donations.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r248769109-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "If in Kolkata...", "review": "...go. It is most interesting and respectful to this special woman. The  museum which depicts her history is very interesting. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r254215842-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Volunteer work at Mother Teresa", "review": "I recently had the privilege of visiting the Mother Teresa missionary.  What a beautiful heart warming place this is.  The children are looked after very well  and I was able to spend some time volunteering.  Such a humbling experience and great way to spend my days.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r252353748-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "The highlight of my trip to India.", "review": "The moment you walk into the property, you feel the peace and love in this place.  The Sisters are doing an amazing job caring and loving for the marginalized.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r235778737-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "impromptu visit", "review": "We popped in about lunch time with a few pots of ointment colouring pens and a donation. The sister was delightful and awe inspiring. Although the children were sleeping she showed us around and explained the good work that is done here. She was so thankful for our gifts it was truly humbling, it brought tears to my eyes. Worth a visit but don't go empty handed. We didn't take photos or stay for long just enough time to offer our support.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r255165163-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "A very interesting visit.", "review": "If you are travelling first class it is difficult to see some the people who have fallen through the cracks of life. The very young children were the most difficult to interact with. the nuns are doing a wonderful job in making the unwanted feel wanted and cared for. Great to be able to make a donation directly to a charity such as this.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r232141870-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A humbling and worthwhile experience", "review": "I would never have sought out the missionary if I hadn't stumbled upon the beautifully written review posted on trip advisor during Easter. That kind man wrote paragraphs which touched me to the core and inspired me to do a small something for my short stop in Agra whilst visiting Delhi for work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r215895843-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Bitter sweet experience.", "review": "The place was immaculately clean,with linen to match.There was only 5 staff,with 2 being young german woman soon leaving.It is a very sad situation,but God bless the 3 sisters who are doing a far far better job than we could do - recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r213554632-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Your heart will bleed", "review": "Having witnessed one of the most beautiful pieces of architecture in the world, how can yo not be moved to tears by what the sisters are doing in this humble abode. With no funding other than visitor donations, they provide an oasis for a small number of children who are charged to their care- some have learning difficulties ranging in severity. The sister themselves eek out a humble lifestyle and are truly grateful to anyone who offers any for of help- be it monetary or simply spending time playing with the children. In the context of the squalor of Agra poorest parts, these children are fortunate indeed-- think about it- -they are fortunate....how humbling is that for us with our relative affluence. Your heart will bleed and you will be moved to provide something of yourself to help", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r238429223-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A must when in the area !", "review": "I had my tour guide take me to this place after tah mahal instead of the fort. I bought crayons and coloring books and wafer cookies to the nuns. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r239385263-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "When love comes to town", "review": "The unconditional love given to all without exception, provides a home where none could otherwise exist.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r240513586-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very emotional and powerful moment", "review": "If you are in Agra please come here! These childrens, these people need you. When we arrived everybody smiled at us and say Namaste. One of the Sister was very kind with us and let us visit all the rooms, I will never forget this moment. I gave some clothes of mine, money and candy. But feel free to bring even the smallest thing, it is very important. God bless all these people and the amazing Sisters. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r238470030-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "See the great work of Mother Teresa continued", "review": "A group of us visited this orphanage which houses not only litte babies & toddlers but also children & teens that are mentally & physically challenged as well as some elderly people. The nuns do a great job of looking after the kids & adults, home is clean & tidy . This orphanage has recently started to offer child minding for single parents free of charge, so the parent can earn a living . The orphanage survives with donations of food & clothing from locals and monetary gifts from people visiting the home like us. If you do visit do spend some time with the babies and please give generously.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r177470108-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "tearful and beautiful experience", "review": "You question the meaning of your life when u visit this place. the commitment and the dedication of the nuns actually make u understand the beauty and the love of mother theresa, whose life work was to help the downtrodden, sick and hungry. It is tearful to see how her great work is continuing in this beautiful place, and it definitely makes u rethink all the luxuries of life we have.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r241369308-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Hidden Gem of Agra", "review": "I visited on a Thursday in March 2014 for a few hours en route to Jaipur as part of a 9 day private golden triangle holiday", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r200236216-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Stop, think and look around you when you are in India.", "review": "I actually visited this place in April 2007, but feel compelled to review it now. On arrival in Agra I walked around a lot before going up to the gate of the Taj. Something told me I shouldn't go in, but that I should find a charitable institution to visit instead.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r196299191-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa's Missionaries of Charity Chandigarh", "review": "Back in 1999, I traveled to India for my brother's wedding. While there, Y2K frenzy led to my losing my flight home and any thereafter for a month. I decided to spend my spare time doing volunteer work. I went daily to the orphanage to play with the children, work on their \"abc's\" and make \"topis\" (hats). They were delighted I was there and it meant more to me than anything else I did in India at that time. Now, 14 years later, married with two little girls, I feel compelled to move towards doing more in that country. I want to help the movement towards gender equality. I want to help the little girls who are abandoned & abused. I want to do anything possible to empower women. So, as you can see, it made a distinct mark in my life, one that I will never lose. I encourage you to visit these places and whenever possible, give anything you can to make their lives better. Sarah", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r197900658-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "An Experience", "review": "I visited here during my time in Kolkata. Mother Teresa is buried on the ground floor of the Mother House. Her tomb is a place of pilgrimage and quiet meditation. The site of the tomb is a place of silence and peace despite the noise of passing traffic outside. The nuns pray at the tomb throughout the day, and visitors are welcome to join in.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r194085071-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Angels of Mercy", "review": "We visited the Missionaries of Charity founded by Mother Theresa.  We were showed around the facility by a sister who worked with Mother Theresa. The facility was spotlessly clean, and decorated with bright colors to stimulate the children. A little girl with a brace on her leg took a liking to us and stayed close the entire time. There are adults and children here with mental and physical handicaps. It is an inspiring place and relies totally on outside contributions to stay open.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r202313759-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 3.0, "title": "A visit to touch your heart", "review": "This is an orphanage for children whose parents are unable to raise them for a number of reasons. The sisters raise the children with love and provide care for those who are ill. Heartbreaking to hear the stories. If you visit, gifts for the children- books, candy, even vitamins, are most appreciated.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r155630016-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very inspiring...", "review": "Well worth the effort of tracking this place down. Small but full of fascinating life line story boards of Mother Teresa's amazing achievements....so inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r156602693-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "\"a realistic view apart from a shinning picture of life\"", "review": "On arrival in Agra I walked around a lot before going up to the gate of the Taj. Something told me I shouldn't go in, but that I should find a charitable institution to visit instead so i went there for my mental pleasure... trust me as a good human you should visit there once .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r211629349-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A very spiritual place!", "review": "while in business at Kolkata, I made sure I visited Mother's House as they call it there. And what a spiritual experience! both myself and my sister got emotional while walking through the articles about Mother Theresa and her work for the poor. also a very humbling experience especially when you visit her bedroom! this visit was very special to me!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r155746801-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Inspiring, loving, spiritual", "review": "On our recent trip to Agra, my 11 year old daughter kept asking me \"when are we going to visit the orphanage mum?\".  This was a first for her.  On entering the orphanage, we were warmly greeted by the Nuns, and were given an overview of the facilities and of the mission itself.  We were then taken around the grounds to see the adults and the beautiful children.  We met amazing children and saw how they lived.  My daughter donated gifts of colouring books and crayons for the older children and sat and played with the younger ones.  This experience was so inspiring for us both, the love care and compassion the children and nuns have and give will always stay with us.  My daughter plans to revisit the center when she returns to India.  So grateful privileged to have shared this experience with my daughter and to have meet these wonderful children.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r157119496-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Doing a great service to humanity", "review": "We went and met the sister , who showed us around the school. The ward for physically challenged children is kept well. Nurses serve the kids with good care and affection. It was quite an emotional experience for us as a family", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r172321433-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "inspiring", "review": "It was such an inspiring visit to the workshop- I just wanted to drop off a donation ,but the head sister came out and gave me a tour and showed me the people who lived there .Such a variety of people helped with so little money - spotless and cheery place ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r163901446-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Place where i find peace and relax", "review": "I have joined this Mother Teresa's Missionaries of Charity since 5 years and every month i go there and spend time with cute babies.I always celebrate my happiness with cute little child  at Mother Teresa's Missionaries of Charity .Its really head's off to all who looks after these infant babies and devotee their life for these little cute child's", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r159408567-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Missionaries of Charity-Agra", "review": "It was good to see missionaries of charity functions in agra. The are serving the needy people with utmost care.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r170410080-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "humanity", "review": "the very humble place. the best place to show your humanity. so many handicaps are there and waiting for some helping hands. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r175680513-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A humble experience", "review": "We saw this on tripadvisor and decided that we would donate some clothes and have a quick visit. We arrived late on Christmas Day (pure coincidence) and was lucky to be invited in by the Mother Superior even though the place was closed for the day.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r176831866-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "peace", "review": "this place gives me motivation. when i saw the kids and other women who are living their, i started weeping silently. God is merciful. These children and women are struggling with life and this missionary is doing great job. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r134885153-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Put a little back", "review": "It's a very moving experience, which will stay with us for a long time.  We took clothes, toys, and made a donation.  It’s a great feeling to think that you have helped in some small way.  Should be on the top of everyone’s list, doesn’t take long to make a difference.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r143598052-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Not a tourist attraction", "review": "Every time a humbling experience. There is so much love going around in any of Mother Theresa's homes for children. Volunteers are welcome as are donations. But a children's home is not a circus.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r140230456-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very heart touching", "review": "i have been to this place first time it is very sad , i have donated lots of my things, children's are nice and the people who are taking care of this place GOD less them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r146552915-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Good place to visit to see selfless people at work.", "review": "The place looks after orphans,abandoned babies, beggars and abandoned parents. You get to seethe tend are and care the nuns show to the poor and the sick. Many of them come in from the streets in near death condition but the workers nurse them back to health. Do provide donations of cash or ties in kind to ell these nun continue their good work.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r139554806-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "make the time", "review": "It is not an attraction people should go there with good grace to give and not to receive. We went to give a donation on behlaf of my mother and were met by two gracious sisters. Make the effort if you want to give something back.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r150995231-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very Humbling Experience", "review": "I decided to stop over the the Mother Teresa Charity House during my visit in Agra.  What an incredible experience! I had the pleasure of meeting two German college students who were interning there, and shared with us their experience thus far.  What incredible young ladies! The missionary gave us a tour of the nursery, play areas, and women's area.  Very humbling experience & definitely recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r152153795-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "must do!", "review": "The Mother Teresa's charity is fantastic, it provides shelter for children from birth to adult hood! I decided to visit many different charities on my visit to India, its not for everyone but I did it for me and if you want to see how people really live then you must go visit some of the charities. This on was particularly sad i found as it was over run with children and adults and there just wasnt enough staff to cope with all the needs. I took lots of books, pencils, pens, paints, rubbers etc as they can use all this stuff, and if you do plan to visit these places then if you have clothes that you no longer want take them with you they are very greatful :) All depending on what your in india for then this is a place you should visit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r151506762-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere", "review": "Not at all depressing but very uplifting. Very clean and well cared for.  Mother Teresa would be proud.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r120724223-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 3.0, "title": "The work the nuns do is commendable", "review": "We were shown through the buildings and dormitories by the Sister in charge.  Most of the men and women had an intellectual disability.  The dormitories were basic but extremely clean.  The children were at school but in the baby nursery we were introduced to two young german volunteers who have been helping out daily for some time.  We also visited the catholic church on the site.  Noone could come away affected by this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r154070691-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Highlight of Agra!", "review": "Amidst the busy-ness and the touristy part of Agra, it is heart warming to see great love and care in this place. Eye opening and touched my heart deeply when seeing so many people ranging from babies to old folks are being taken care of (of course there could be more but at least there is this missionary). People visiting Agra should visit this place. It makes visiting Agra especially meaningful. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r121079368-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Good for the soul, please visit!", "review": "My husband and I visited here while on our holiday in Agra, it is an amazing place. They have around 45 children in their care, some very young, some with disabilities. There are also over 100 adults that are unable to care for themselves. We took toys and clothes, as was suggested in previous posts. We met Sister Superior though and asked her what people should bring, she said just money and please ask people to come, they need all the help they can get. Everyone is very well cared for, but they definitely need more donations.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r121340984-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Missionaries of Charity", "review": "I visited their children's home at Civil Lines last month. It is amazing to see  their love and affection for children. They take care of their food, clothes, medical needs, education and well being. They also promote and support adoption. Their work is even great when we know that they do all this without expecting anything back. Hats off to the Mother Theresa's team. Thanks. Pradeep", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r153763157-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "The Orphan's and Poor's Heaven", "review": "This name of Mother Teressa alone is enough to explain the importance and the services of the place.It needs though more attention of the people who spent a lot of money on Luxury and think only about themselves.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r122031448-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Volunteer and you will be rewarded", "review": "We spent Christmas morning 2011 assisting the sisters feed 2,000 of the poor from the streets of Kolkata. It was one of the most rewarding experiences of our lives.  From chatting with the sisters to visiting with the children in the orphanage to sharing Christmas with the people receiving their meals and boxes of fruit and bread, it was the perfect Christmas present. The often curious stares we received and the beautiful smiles of thanks, we met each \"Happy Christmas\" with our \"Merry Christmas.\"  it was indeed a merry and happy Christmas for us.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r123068324-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Great experience to share a little love", "review": "Lovely to share a little time with the less fortunate children and adults who are well taken care of by the sisters. We enjoyed our time at the Centre. Wish we spent more time there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r127135337-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Gift of Love", "review": "It is a heartwarming experience, the love given to the poor broken people is overwhelming", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r127033593-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "A humbling visit", "review": "The wonderful work of Mother Teresa continues behind the walls of a compound in the heart of Agra ... caring mostly for disabled  young people and adults who will live their entire lives here.  A short visit but, more importantly, a donation (food, clothing, blankets, sports equipment, cash) to help the centre fund its invaluable work should be on EVERY tourist's 'to do' list.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r123078775-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Must go!", "review": "We got there quite late so could only see the childrens area. it was amazing to see the lovely little children.  Only the day before a newborn baby had been left on the doorstep. The work they do is amazing.  Must go to see and take clothes, toys, donations. They are in need of lots of things. It really made an impact on us.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r127407026-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 3.0, "title": "soe charity good for heart", "review": "If you feel something bad has done to you and you are helpless, then you should see the mother teresa's missionaries of charity. which will give you a new way of seeing the life. you will see the struggle of life and you will realise that life never stops until you choose to stop it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r127915077-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "The real beauty of Agra is there...", "review": "I've been visiting Mother Teresa's Missionaries of Charity after reading the reviews here and it's really worth the visit. There you will find the real beauty of Agra, of life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r120025459-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "A most humbling and moving experience", "review": "We visited \"Mother Teresa's mission\" during our brief visit to Agra.   I had read about the Missionaries a little while ago and really wanted to visit in order to understand and see their work first hand.  The taxi driver that took us there said that in the three years he had been running tourists around, not one person had asked to be taken there.  Here's what I have to say.  Yes, by all means go see the Taj Mahal - it is a wondrous building with incredible detail, but please leave a little time to visit Sister Glory and the Missionaries of Charity and donate anything you can (they rely soley on donations for everything).  They are always in need of basic medial supplies such as sticking plasters, latex gloves,  syringes, antibiotics as well as multi-vitamins.  For the school age children (and some of the adults), exercise books/paper/pens/pencils etc.  Clothing for adults, children and babies is always welcome.  Even if you can't squeeze any of these or similar items into your luggage, then take along some sweets/candy and go witness the love and care these wonderful missionaries offer to men, women and children who have been cast aside by society.  You cannot fail to come away untouched and, perhaps, wanting to do a little more. The mission is 10 mins from the railway station and is open for visitors between 2-6 p.m.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r50166115-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Mother Teresa's Mission - Agra", "review": "Thank you for sharing this information.  Very Helpful.  I will for sure stop by...and contribute.  This is a real service you've done by posting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r53601153-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 4.0, "title": "Survey At Mother Teresa Missionaries At sec 23 Chandigarh", "review": "It was a live project  but lately we admit that it should be within you who will serve these people.There was no age bar from 1 month baby to 80yr old man everyone struggling for there lives in a small bracket of world.We served them with eatables and we cannot give you the feel we felt after serving them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r95133123-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Help others.", "review": "Hello everyone,  help someone in life..it will definitely come back to you..so please help Mother Teresa’s Missionaries.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r613579846-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I cried", "review": "everone should go there and help the poor people i went there as we have book an appointment , sister was there to greet us then they show us all the places which is very clean and organized, they accept everything new and used, help them God will help you  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r615754965-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Very sad", "review": "I went first time to this place..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r622109055-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Visit Agra", "review": "Visit this place and offer love and devotion. Paying tribute to Mother Teresa. If you don't know of her miricales, google it. Mother Teresa is a univeral force ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r656046063-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Give a donation - Cash only", "review": "I wanted to visit here when I was in Agra, to give some money. This is all run by nuns, and they appreciate anything you can give. I also brought some handmade toys my mother made especially from Spain, for the babies. Please note that they can only accept cash, not card payments, so come prepared. They will give you a formal receipt for your donation so you know it’s all going into the right channels. You don’t have to take a tour of the orphanage if you don’t wish to, there is a church within the grounds you can say your thanks if you prefer. We booked a driver to stop by the orphanage on our way out of Agra, when we were visiting Fatehpur Sikri and he came in with us to speak to the nuns as well. (I wasn’t sure if there would be a language barrier). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r639515458-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "I have visited for the past 28 years.", "review": "I live in Agra at least two months in a year,and have tried to bring candy on Sunday whenever possible. I the past, I have taught some of the children. In 1990, Saint Theresa,blessed me in Calcutta,and  I decided I had to give love where I found love. I was unable to visit in 2018,as I had a bad ear infection, but since 1990, I have visited, Missions of Charity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r659687166-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Sad and heartwarming- go yourself, don’t take a tour!", "review": "We took a tuk tuk to here to donate what we could afford. We just turned up and we’re shown round by one of the nuns. There are many sick children here but the nuns do an amazing job caring for them as well as older people in need of help. They rely wholly on donations. If you visit DONT  take a tour, go yourself and donate the money you’ll save from being charged an exorbitant amount by a tour company! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632119828-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Don’t leave town without helping these amazing nuns", "review": "Take 1 hour out of your Agra trip to visit these nuns. No need to book, just turn up and they will welcome you. We took some essentials as gifts (clothing, rice, wheat, lentils, soap, toothbrushes and clothing) and you can also make a cash donation to support their great work. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641245217-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Mother Teresa’s Orphanage,Agra", "review": "So heartfelt, the orphaned children and adults with special needs.  The children just cling to you when holding, so overwhelmed with emotion.  Please go, hold the children and donate as much as possible as who else will care for them", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r641789068-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Mother Teresa's Missionaries of Charity", "rating": 5.0, "title": "Love is everywhere ", "review": "The place looks after orphans, abandoned babies, beggars and abandoned parents. It is a heartwarming experience....  Amazing achievements..... So inspiring and humbling. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d1595132-r632313536-Mother_Teresa_s_Missionaries_of_Charity-Agra_Agra_District_Uttar_Pradesh.html"}]