[{"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "We were not prepared for this.", "review": "Our guide suggested during our visit to the Taj Mahal that we would see a demonstration of the stone inlay techniques “later” although this had not been included in the summary provided by our tour operator.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r542366832-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "Nice view - hard sell and harder to get out", "review": "What started as the usual come see my goods, turned into the usual what would you like to drink.  Then the hard sell.  Very disappointing that our wonderful Tour Company includes places such as this on the agenda. I would rather pay a fee, see the craftmen at work and watch the production, get rid of the hard sell - i refused the free drink, been there done that before. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r545139771-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Genuine  small Table Top / plate", "review": "We bought a plate from here with 609 Gems in it, It looked more genuine than in other places but cost us $340 AUD. Not sure if this was too much or not, but then you never know in India, if you are paying too much. We read after the visit there are 3 floors here the smaller gifts are down the stairs. We never went as we had already spent enough.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r615886276-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Show and sell", "review": "We were brought by our guide, we knew this was a demonstration place in order to sell. They would bring you after visiting the Taj so you can learn about the stones used. It was interesting though. They show you how stones are cut and then take you to a show room, for the most expensive pieces. If you say you don't want to buy, they will take you to another smaller show room with cheaper pieces. In this one prices were ok, so we bought 2 small pieces for about $11 both. They are our souvenirs from Agra and they look great at home. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r552230254-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "SCAM!!!! don´t order anything there - no shipment - no communication", "review": "we've visited in february with our guide - nice there and we did choose a small table plate for approx. 200$ - we were offered for free shipping back to austria - it never arrived - no response since 1 months ... no money back ... very bad experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r569647151-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Interesting link to Taj Mahal visit but inevitable sales push", "review": "Visited as part of tour and it was interesting to see the techniques used to construct the Taj Mahal applies to range of products. As soon as you enter you do know it’s going to be the usual selling approach albeit it was done politely. In did buy a piece I liked as a present but it is all very expensive (I paid £200 for a 25 x 25cm square tablet. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r624398703-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Average throughout,  an find better. Pushy for a sale ", "review": "We were dropped to this shop by our taxi who explained that we could look how marble tables and other ornaments are made with stone inlays. When we arrived it felt quite orchestrated, with the manager urging the team to work.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r577548305-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "If you want a piece of India to take home, come here!", "review": "Great spot that demonstrates the techniques and craftsmanship that was used to build the Taj Mahal as well as very informative on the stones and marble used. A wide array of beautiful hand crafted pieces available for purchase. What’s great is that the pieces are very versatile and no two are the same. I purchased one that can be used as a cutting board, cheese platter, used in the oven or purely as a display piece. We were told that the art of inlay is a dying one as you can understand why when you see the demonstration. The time and effort that goes into each is a large one. I’m not sure if it’s only this store, but supposedly 65% of the proceeds go to the Artisans. Definitely worth checking out! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r465851100-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Just not sure", "review": "Our guide brought us here after we asked about wanting to pick up some decent souvenirs.  The pitch starts before you even walk in the store with the head guy explaining how these pieces are made in the same manner as was done at the TM, but descendants of those that did the work at the TM....I struggle somewhat with the latter?  Pretty strong sales pitch, and after 20 min or so, you can look at the wares.  Fairly nice stuff to be honest.  And then...you ask for the price.  Quite a bit higher than what one would expect.  Some cheaper and smaller stuff downstairs, as fyi.  So you negotiate for a while, but as we really needed to get moving, did not do as good a job on that front as I would have liked, so do believe I overpaid, but so be it.  This aside, did buy a couple of pieces we do really like and my son picked up a small TM downstairs.  Worth the stop I suppose, but be willing to negotiate to a level you are comfortable with.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r457048212-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "to tired", "review": "I think that it is very unfair of the tour guides taking you to these stores. if I want to buy something I will do so quite happily but to have someone pressuring you into buying unwanted, expensive things is totally wrong ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r649944465-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Nice place to buy Marble", "review": "Quaky fun place to see how marble inlays are made. Nice pieces to take home. Very informative.  They have some ancient equipment and artisans there making marble inlays.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r438810953-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Beautiful Marble Art", "review": "We visited Nice Marble Arts & Handicrafts with our friends to get a close up experience of the magnificent inlay work and skills of the craftsman whose ancestors worked on the Taj Mahal. Douglas Sequeria kindly explained the process and his craftsmen demonstrated how they shape each piece to be inlayed. Quite amazing especially as they were using ancient tools. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r646315649-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Nice Art and Handicrafts", "review": "This is one of the very good experience we had here with this place to see lot of specific and special art and handicrafts examples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r629116401-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Nice but Expensive Marble Artworks.", "review": "Was brought to the store by the tour guide after our Taj Mahal tour. We were given tour demo on the old marble technique which is the same during the construction of the Taj Mahal. After that, was brough to the showroom and the sales manager will show you a few patterns including the price. No obligation though the prices of the marble art pieces ranges from a couple hundreds onwards. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r453055540-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Nice Marble Art and Handicrafts", "review": "I purchased several pieces of Marble for myself and gifts for friends in the US.  I was so impressed with my purchase and pleased.   I had the items shipped back to the US.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r469052431-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "A beautiful addition to my kitchen- really a fantastic purchase", "review": "Bought a lovely piece of inlayed marble from this store.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r472546284-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Lovely work but pressure to buy,", "review": "Although it is quite interesting to look and the amazing work that has gone into the marble art I find that these type of demonstrations go for way too long and always pressure you to buy stuff.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r475142441-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "Loved that place, demonstration, did not like dishonest sellers", "review": "I loved the artwork in the main room, I loved the demonstration, story about Taj Mahal workers. I was asking if they have something smaller to take home. This was my last day in India. They brought me the coasters from another room (now I understand, that there is downstairs, where they have generic pieces). That seemed perfect. They pretended to count the number of gems and told me price. Since I thought this was a unique piece, I paid the price after \"bargaining\". Well, at the next stop with my group, the very same piece was 1/3 of that price. On Ebay, there are more of the same pieces... Since I paid with the credit card, I followed up the dispute that looked promising at the beginning, futile at the end.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r529299309-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Zainub marble art shop", "review": "I visited Agra yesterday and I passed to Zainub Marble shop ,In fact their product are so nice and perfect and after some demonstration ,I decided to buy a Marble chess board with a wooden table and marble chess pieces , The owner was very gentle and helped me to choose the right item and confirmed to do all the delivery to my home in his responsibility .Price was logic and reasonable and I recommend all visitors to visit this shop  .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r480444958-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Nice collection but little over priced", "review": "Visited this place for shopping of memorabilia from Agra. They have nice collection of different articles of Marbles & Stones and also of different varieties. The options can be tables, chess board, miniature statues of Gods/ Goddesses, decorative items of different budget, size. However, the price is little on the higher side especially if you are looking something in the 500-1000 INR range for gifting purpose. Also, you can do bargaining.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r508354012-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Excellent place to buy Handmade Marble gift from", "review": "I visited them in December of 2015 and was amazed how much intricate work has been involved in the hand crafted marble pieces. I wanted to buy gifts for my friends and in Laws in states and this place was one stop to get everything. There packaging was pretty amazing and made all the delicate items pretty indestructible for flight back home. Staff was very kind and courteous as well. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r342719419-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Great experience!", "review": "I visited here with my husband in Dec 2015 and was blown away by all the beautiful handmade marble pieces. I enjoyed how each staff member took their time in explaining the process and then showing us how each piece was crafted right in their own store. The was especially great since we had just left a Taj Mahal tour and could connect both the work of the structure to the work in this shop. Everyone was beyond friendly and there were many pieces to choose from. After leaving here,  I was able to return home with numerous items for my family. Awesome experience, will visit again!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r342719184-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Beautiful artisan ship at a price", "review": "The work a generational artists with marble and natural stones is stunning. The designs are traditional, the workmanship impeccable and the prices very high. We really hoped to buy something but everything we liked was very expensive and everything in our budget, we didn't like. There was no pressure to buy and they tried to find us something but we left empty handed. Plan on spending into the thousands if you want something really unique. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r420126246-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Good place to buy marble handicrafts", "review": "Recently visited this place. I was looking for something very specific marble crafted item and found it here after visiting few places in the city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r341657479-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Amazing but there are three viewing rooms", "review": "Beautiful products, look at all 3 three stores they won't tell you that - don't buy until you look at all the products otherwise you will feel hood winked by them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r343464933-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "good place to see marble being made", "review": "Situated in the heart of medieval Agra, Grand Imperial, a heritage hotel offers luxury accommodation with spa facilities, conference facilities and beautiful gardens, ideal for business and leisure and see how marble is beind made just outside taj mahal", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r350457190-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Check the exchange rate !", "review": "We were taken here by our tour guide ! We were welcomed and shown how the marble was/is worked, very informative. We were then taken into the upstairs showroom which was full of large pieces of marble that were very decorative, there were a few smaller pieces and we chose two small elephants at £50 EACH. I fancied another piece but felt it was too expensive for an occasional side table. When it came to paying the owner / manager converted into rupees for us to pay by card, unfortunately my wife wasn't feeling too well and didn't realise that we were overcharged by 5000 rupees !! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r430800477-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "Nice view - hard sell and harder to get out", "review": "What started as the usual come see my goods, turned into the usual what would you like to drink.  Then the hard sell.  Very disappointing that our wonderful Tour Company includes places such as this on the agenda. I would rather pay a fee, see the craftmen at work and watch the production, get rid of the hard sell - i refused the free drink, been there done that before. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r545139771-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Show and sell", "review": "We were brought by our guide, we knew this was a demonstration place in order to sell. They would bring you after visiting the Taj so you can learn about the stones used. It was interesting though. They show you how stones are cut and then take you to a show room, for the most expensive pieces. If you say you don't want to buy, they will take you to another smaller show room with cheaper pieces. In this one prices were ok, so we bought 2 small pieces for about $11 both. They are our souvenirs from Agra and they look great at home. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r552230254-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "Dishonest Proprietor - Rip Off Prices Beware", "review": "We visited Nice New Marble Art and Handicrafts last weekend. Upon arrival we received a demonstration on how inlaid marble is crafted. After the demonstration we were taken to the showroom. The items are amazing. The prices are rip-off. As example a sandstone crafted elephant we were quoted €1,500. My wife and I were unsure and then decided against. Upon return to Mumbai the same sandstone crafted elephant at Marriot CourtYard was €130.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r436602630-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "We were not prepared for this.", "review": "Our guide suggested during our visit to the Taj Mahal that we would see a demonstration of the stone inlay techniques “later” although this had not been included in the summary provided by our tour operator.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r542366832-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "SCAM!!!! don´t order anything there - no shipment - no communication", "review": "we've visited in february with our guide - nice there and we did choose a small table plate for approx. 200$ - we were offered for free shipping back to austria - it never arrived - no response since 1 months ... no money back ... very bad experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r569647151-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Average throughout,  an find better. Pushy for a sale ", "review": "We were dropped to this shop by our taxi who explained that we could look how marble tables and other ornaments are made with stone inlays. When we arrived it felt quite orchestrated, with the manager urging the team to work.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r577548305-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Genuine  small Table Top / plate", "review": "We bought a plate from here with 609 Gems in it, It looked more genuine than in other places but cost us $340 AUD. Not sure if this was too much or not, but then you never know in India, if you are paying too much. We read after the visit there are 3 floors here the smaller gifts are down the stairs. We never went as we had already spent enough.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r615886276-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Beautiful Marble Art", "review": "We visited Nice Marble Arts & Handicrafts with our friends to get a close up experience of the magnificent inlay work and skills of the craftsman whose ancestors worked on the Taj Mahal. Douglas Sequeria kindly explained the process and his craftsmen demonstrated how they shape each piece to be inlayed. Quite amazing especially as they were using ancient tools. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r646315649-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Nice Art and Handicrafts", "review": "This is one of the very good experience we had here with this place to see lot of specific and special art and handicrafts examples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r629116401-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "to tired", "review": "I think that it is very unfair of the tour guides taking you to these stores. if I want to buy something I will do so quite happily but to have someone pressuring you into buying unwanted, expensive things is totally wrong ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r649944465-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Interesting link to Taj Mahal visit but inevitable sales push", "review": "Visited as part of tour and it was interesting to see the techniques used to construct the Taj Mahal applies to range of products. As soon as you enter you do know it’s going to be the usual selling approach albeit it was done politely. In did buy a piece I liked as a present but it is all very expensive (I paid £200 for a 25 x 25cm square tablet. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r624398703-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Show and sell", "review": "We were brought by our guide, we knew this was a demonstration place in order to sell. They would bring you after visiting the Taj so you can learn about the stones used. It was interesting though. They show you how stones are cut and then take you to a show room, for the most expensive pieces. If you say you don't want to buy, they will take you to another smaller show room with cheaper pieces. In this one prices were ok, so we bought 2 small pieces for about $11 both. They are our souvenirs from Agra and they look great at home. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r552230254-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "We were not prepared for this.", "review": "Our guide suggested during our visit to the Taj Mahal that we would see a demonstration of the stone inlay techniques “later” although this had not been included in the summary provided by our tour operator.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r542366832-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "SCAM!!!! don´t order anything there - no shipment - no communication", "review": "we've visited in february with our guide - nice there and we did choose a small table plate for approx. 200$ - we were offered for free shipping back to austria - it never arrived - no response since 1 months ... no money back ... very bad experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r569647151-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 2.0, "title": "Nice view - hard sell and harder to get out", "review": "What started as the usual come see my goods, turned into the usual what would you like to drink.  Then the hard sell.  Very disappointing that our wonderful Tour Company includes places such as this on the agenda. I would rather pay a fee, see the craftmen at work and watch the production, get rid of the hard sell - i refused the free drink, been there done that before. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r545139771-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 5.0, "title": "Genuine  small Table Top / plate", "review": "We bought a plate from here with 609 Gems in it, It looked more genuine than in other places but cost us $340 AUD. Not sure if this was too much or not, but then you never know in India, if you are paying too much. We read after the visit there are 3 floors here the smaller gifts are down the stairs. We never went as we had already spent enough.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r615886276-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Interesting link to Taj Mahal visit but inevitable sales push", "review": "Visited as part of tour and it was interesting to see the techniques used to construct the Taj Mahal applies to range of products. As soon as you enter you do know it’s going to be the usual selling approach albeit it was done politely. In did buy a piece I liked as a present but it is all very expensive (I paid £200 for a 25 x 25cm square tablet. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r624398703-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 3.0, "title": "Average throughout,  an find better. Pushy for a sale ", "review": "We were dropped to this shop by our taxi who explained that we could look how marble tables and other ornaments are made with stone inlays. When we arrived it felt quite orchestrated, with the manager urging the team to work.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r577548305-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Beautiful Marble Art", "review": "We visited Nice Marble Arts & Handicrafts with our friends to get a close up experience of the magnificent inlay work and skills of the craftsman whose ancestors worked on the Taj Mahal. Douglas Sequeria kindly explained the process and his craftsmen demonstrated how they shape each piece to be inlayed. Quite amazing especially as they were using ancient tools. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r646315649-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 4.0, "title": "Nice Art and Handicrafts", "review": "This is one of the very good experience we had here with this place to see lot of specific and special art and handicrafts examples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r629116401-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "New Nice Marble Art & Handicrafts", "rating": 1.0, "title": "to tired", "review": "I think that it is very unfair of the tour guides taking you to these stores. if I want to buy something I will do so quite happily but to have someone pressuring you into buying unwanted, expensive things is totally wrong ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d9706354-r649944465-New_Nice_Marble_Art_Handicrafts-Agra_Agra_District_Uttar_Pradesh.html"}]