[{"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Very Good Bird Sanctuary", "review": "If you are travelling to Mathura or Agra next time and can spare 2 – 3 hours then it is good place to visit. It is on NH-2 between Mathura and Agra highway. There is entry fee for the sanctuary Rs.30 per person and you can drive in your car or bike. (for a fee the car fee is Rs.100). If you are having kids or do not like to walk for 2 kilometers then it is recommended to have your own transport. The sanctuary is quite and you can see many birds and monkey on the way. There is Bear Rescue center where you can see Indian bear. Recommended to visit if you are on road towards this route.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r446665412-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "Go for the Bears, not for yourself.", "review": "I can't believe the people saying they didn't see the bears, or they were sleeping. One hears the same complaints at the zoo from visitors all the time..can you wake them up?..can they come closer?.. This is a rescue and these animals benefit greatly from your support of this facility. You might see a sleeping bear, or a resting bear from 20-40 feet away. But you visit a place like this not to get a great photo of  a bear but rather to educate yourself that we as mankind once did a cruel thing, but now are making it right. Which is a good feeling. You can read many educational signs and watch a movie and visit a nice little gift shop. And you WILL see sloth bears, as seeing them in the wild in the parks is hard to do.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r539948294-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 2.0, "title": "Waste of time but a good cause for bears", "review": "As an animal friend it's great that India has banned Dancing Bears.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r454429759-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "Bird Sanctuary", "review": "Sur Sarovar is a good place to visit. A good place to be with nature, birds and fishes in the rivers. It`s a big lake with all sounds of birds, peacocks, parrots, migration birds of very wide variety. Boating in Keetham Lake is available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r537454465-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Sur sarovar bird sanctuary", "review": "Bird sanctuary of agra is nice place to spent weekend with family specially with kids..their has many wild animal and bird kept here..nice must viait", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r489379285-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "A Sunday Morning Well Spent", "review": "The trip of this sanctuary was a stop in our roadtrip. Drove from Vrindavan in an early winter morning. Reached a little later than we should have. It had become quite crowded by 10 AM and birds had receded in deeper forest. But one can still spot a few birds. Migratory birds visit this sanctuary in winters and this is the best time for tourism too. I am little into photography so enjoyed it a lot. The authorities here should make adequate arrangements for crowd situation. We took cycle rickshaw to wander inside. The proper jeeps were not plying. Cycling would still be a better option or even better, walk! So some checkpoints in my next visit would be- reach as early as possible (6 AM), walk or cycle and do not forget my camera lenses. :-/", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r551694186-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "Disappointing", "review": "This Wildlife SOS - Sloth Bears sanctuary was disappointing after our fantastic visit to the elephant sanctuary earlier in the day, our two hour slot materialised into an hour only. This attraction is approximately 20 mins away by road from Wildlife SOS elephants.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r519575699-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "A GOOD LEARNING ABOUT SELFLESS SERVICE", "review": "Visited the Bear rescue centre. Met Ruman Khan, the education officer who conducted us around. It was a very touching experience. Kudos to Mr Ruman Khan , the vet Dr Illayaraja and ofcourse all those behind this project whose dedication and devotion to this noble cause is praiseworthy.They as a team are doing a wonderful job. Everyone visiting Agra must make it a point to visit this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r603170338-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "sanctury", "review": "it is located 20 kilometers away from Agra on the delhi agra highway and is spread over a vast land area", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r312962765-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 2.0, "title": "No birds found!", "review": "We go there with lots of expectation to see birds but only able to see 4 or 5 cormorants,1 or 2 herons or egrets,1 kingfisher and a group of flamingoes that too with quite a large distance.Advised not to go there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r315511246-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "Great experience", "review": "It is a very nice place to visit, Ruman was very helpful.. alot of beers and deers are there... Perfect place to go.. do donate for Noble cause of beer conservation", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r586205233-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "Doing a great job", "review": "I had pre-booked to go here as part of a school trip. On arrival we were met and given a tour around and a brief overview of the sanctuary. Due to the time of year we were there to find out more about the Sloth Bear rather than birds. (As not so many birds around at this time of year) The tour/talk was very informative and the guide clearly had a lot of knowledge and was passionate about his job. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r606622674-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 2.0, "title": "No birds just trees around a lake", "review": "This may be called a sanctuary but no birds are available, even their sounds are not heard within the area. Located about 20km away from Agra, the ill management is a turn-off for anyone trying to visit the area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r327068523-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "interesting place", "review": "good place to spot birds.went at the fag end of January ' 16 . could spot quite a few of them. visibility was low due to fog. 500 bucks for a camera is a killer though. garbage , beer cans etc are visible every where is a big eye sore. uncooperative staff ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r346485879-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Good birding destination with poor maintainance", "review": "Keetham lake is a good lake with lot of migratory water birds in winter. we saw thousands of cormorant, hundreads of bar headed geese, hundreds of dalmatian pelican and great white pelican, black wing stilt, marsh sandpiper, pied avocet, river lapwing, asian openbill, egrets of all veriety... we were so happy..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r332784288-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "good place to be with nature", "review": "good place to be with nature , birds and fishes in the rivers ,quite big lake with all sounds of birds , peacocks, parrots,migrationed birds very wide variety ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r366277102-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Sloth bears", "review": "This was a special visit. We were shown a 15 minute documentary about the Dancing bears and what was being done to rescue them from captivity. We were also able to see the sloth bears and they were a fascinating blend of scary and cuddly. It was a joyous experience to see them although sadly we were only able to watch them for less than 15 minutes. Would still highly recommend it for 500 entry fee", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r404133308-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 1.0, "title": "This is no Bird Sanctuary", "review": "The place offers no sighting of birds and the staff appointed are more than just rude. The entry fee is a total rip off. It is a complete  waste of time, though it has a great scope to be developed into a good nature attraction if it is run by a better and more friendly team.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r346590311-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "Birdwatching for Ornithologists, Nature lovers, python lovers.", "review": "Distance from Mathura is about 30 km.   (Delhi to Mathura and then connect by Bus) or you can travel back from Agra. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r198995493-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "Lovely oasis away from the crowds", "review": "Lovely bird sanctuary.  Be prepared to walk.  Take a guide book of local birds so you can identify what you are looking at.  Nice break from all the noise and crowds of Delhi and the surrounding area.  You'll enjoy it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r445716357-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "better than expected!", "review": "Nice place, loved the greenery. im not so much of a bird watcher but appreciated the place and the drive. good place to spend some time together in natural habitats.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r251380174-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Welcoming Natural Beauty", "review": "Located just about 30 km from Mathura, This place boasts of natural beauty and calmness. Keetham Lake, Sur Kurti and bird sanctuary all can be visited at the same time. This place is not that touristy for which we could enjoy the natural beauty and its calm atmosphere. It is a must visit for python lovers and ornithologists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r276065871-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "Four attractions in one place", "review": "Wild life SOS, Keetham Lake, Sur Kuti and bird sanctuary are in one place and can be visited simultaneously. When we went,  there were no tourists so we got totally calm atmosphere and could enjoy natural beauty in it's natural form.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r205638236-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 5.0, "title": "Sur Sarovar Bird Sanctuary -- National Bird Sanctuary", "review": "Located 20 kilometers away from Agra on the Delhi-Agra Highway. With an area of 7,97 square kilometers, the sanctuary was declared a National Bird Sanctuary in 1991. More than 106 species of migratory birds come to Sur Sarovar every year, it is also the habitat for birds such as the little gerb, cattle egret, purple heron, darter, common teal and pintail, among others. This place is an ideal spot for a picnic with the kids. Open daily from 6 a.m. to 6 p.m.  Kids are going to enjoy this place because of the wide open spaces and by watching the many colorful birds at the sanctuary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r281783596-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Keetham Lake", "review": "Agra's Keetham lake is beautiful and a place where birds of different varieties come and have fun, a picnic spot for Agrawallas, a beautiful landscape to spend time from the crowd, come and relax in the arm of nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r297253120-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Amazing Place", "review": "Soor Sarovar Wildlife Sanctuary lies in a sprawling 15-acre green expanse, 17 km from Agra. The place that ignited the passions of Lord Krishna and Radha and inspired the famed poet Soordas to compose the “Bhakti Kavya”. Agra bear rescue facility is locates inside Sur Sarovar Bird Santuary", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r301345852-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 3.0, "title": "If your into peacocks and ducks thats about all you see", "review": "Went for an early rickshaw right through the sanctuary only saw lots of peacocks and ducks but found a tribe of monkeys we were more excited about them than anything. Our guide wasnt too impressed as they are pests there. But all in all was a nice way to spend the morning and good views of the wetlands.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r286565881-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "nice", "review": "It is a wildlife sanctuary lies in a sprawling 15 acre green expanse. Local and migratory birds, jackals, mongoose and hares roam in the sanctuary and it is a place of natural beauty. The place inspired poet Soordas to compose the 'Bhakti-Kavya', one of the finest piece of devotional poetry ever written. So, if you love nature, this place in Agra is for you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r310390313-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "Relax, Enjoy Charm & Beauty...", "review": "This place, also known as Keetham Lake, is really good for relaxing & enjoying the natural beauty with a lake, aquamarine birds, fishes & artificially created islands for shelter and breeding grounds to the migratory birds. A place, conveniently located some 20 kms away from Agra on Agra-New Delhi Highway(NH-2), where you can see migratory birds in their best moods. It was declared as a National Bird Sanctuary by U.P forest Department.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r164664698-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Sur Sarovar Bird Sanctuary", "rating": 4.0, "title": "good for indian tourists", "review": "seems to be a local palace.. but because its in agra my expectations are that it should match the international standard", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d4088755-r304732418-Sur_Sarovar_Bird_Sanctuary-Agra_Agra_District_Uttar_Pradesh.html"}]