[{"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "A decent place, can be avoided if out of time", "review": "This is the tomb of the most famous queen of Akbar. Some people also know her as \"Jhodha\". This is slight off the tourist circuit of Agra. Will take easily 3 hours of ones time, including travel from city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r478458376-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Jodha bai", "review": "It is said that Akbar build this tomb so all of Mughal's can buried here in together but unfortunately it wasn't happened. So now Jodha is buried here. As usual nice architecture. the only problem is its locations. Little bit far away from agra. So not highly recommended but if u have time do visit the tomb. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r496231647-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "TOMB OF JODHA", "review": "The location of this spot is a bit far from central Agra, and there is so much history to see and visit inside Agra itself the this place is kind of unknown. It is a huge beautiful complex with amazing garden and lawn. It was said to be built to bury the family members of the king.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r498416974-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Also known as Tomb of Jodha", "review": "Located a little off the path this is where Akbar's favourite queen Jodha ha been burried. The time taken to visit this place is lot more", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r497098213-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Mariam Zamani!!!", "review": "The Tomb of Mariam Zamani is opposite to Sikandra Tomb. Agra. The place is a very big beautiful architecture and garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r519940934-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Beautiful", "review": "The tomb of queen jodha is beautiful and peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r542539912-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Around Agra ", "review": "Mariam-uz-Zamani was the Hindu consort of Mughal emperor Akbar the Great and the mother of Jahangir. Her tomb is situated near the tomb of Akbar and built by Jahangir in memory of his mother. The square tomb is situated inside of a Mughal garden. The centre of the ground floor houses the cenotaph of Mariam. Exterior of the building was constructed by red sandstone. It's a place of tourist interest in Sikandara near Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r522119364-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Tomb of Jodha", "review": "It's dedicated to Jhodha Bai and bear Akbar's tomb and surrounded by good ground enjoy with friends .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r563368048-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "beautiful resting place of Jodha Bai", "review": "The tomb is just a km away from the tomb of Akbar. It is situated on the Delhi-Agra National Highway, near Fatehpur Sikri. The tomb of Mariam-uz-Zamani is the resting place of Jodha Bai.The tomb is square and stands on a huge garden. There are many massive pillars, arches, and vaulted ceilings that are built using brick and mortar. The significant thing about the tomb structure is that it looks the same from the front and back. This is unique among the Mughal structures.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r576005699-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Jodha Bai - Wife of Akbar", "review": "This place is close to Akbar's Tomb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r651641587-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Tomb of Jodha Bai", "review": "The Tomb of Mariam-Zamani is a 17th Century monument located near Sikandra, which is about 15 KMs away from Agra.  Mariam-Zamani was the wife of the Mughal Emperor Akbar and the mother of Salim (Emperor Jahangir).  She is also referred as Jodha Bai. Her tomb was built by Jahangir in Sikandra very close to Akbar's tomb.  The tomb portrays Barhadri Architecture mixed with Mughal Architecture.  There is a square tomb that stands in the center of the Mughal garden.  The monument is beautifully ornamented.  The red sandstone facade and panels with a variety of decorative designs, such as floral patterns look great. Floral paintings have faded away. Only traces can still be seen in the corners.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r397490267-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Wife of Akbar the Great", "review": "This 400 years old monument is situsded on the left side of Sikandra the grave of Akbar,Mariam was the Rajput princess and wife of Akbar and mother of Jahangir ,the total building is in Red stone and it is like a lovers paradise for young lovers of Agra", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r415951959-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "a place of historical importance!", "review": "There's no hustling and bustling. It has big lawns, great for lying down and taking some rest. The architecture is great. You can sit by the lawns and spend some quality time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r428213672-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "short 2 hour visit", "review": "This is  one of the sites to see in the world and the structure is amazing and is such good condition the tours are well conducted but you need a local tour guide to gain the best experience they know the history and the bet spots to see just pay the guide and your trip will go smoothly and the information will flow all day. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r440541202-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Mary of the Ages Tomb", "review": "I wanted to pay my respects to Akbar's Hindu wife who was the mother of Jahangir. (I think of her as Jodha Bai because of the movie AkbarJodha, but historians give her a different name.) The tomb is in Sikander on the opposite side of the road, but near to Akbar's tomb. The traffic was terrible, but I was determined to pay my respects. The gardens were well kept. The monument was much bigger than I had imagined.  The place was almost empty--refreshing after the crowds of the Taj--so I stayed for a long time studying the motifs and architectural details.  You could descend to ground level to what I assumed was her actual tomb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r444396023-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Agra monument ", "review": "Mariam tomb is very small and quite place.  Not much of people visits here. It is not properly preserved you have to pay entry ticket", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r471323267-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Mariam Zamani - Akbar's Queen", "review": "The tomb of Mariam Zamani the Hindu queen of Akbar is not a much frequented place in Agra. The tomb unlike most of the Mughal tombs surprisingly does not have a dome structure anywhere. The tomb is not maintained very well. Nonetheless one can visit this monument in Agra for its historical importance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r473306192-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "This trip for friends ", "review": "Suddenly planned it near to our locality. Me and my some friends make a plan and visit it. Nice place nd see the historical thing there and lot of fun. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r457468723-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Slightly out of the way but well worth a visit.", "review": "This was not on our itinerary however we knew of her existence and asked our driver to go to her tomb. He admitted he hadn't been either. Its a beautiful compound and well maintained. The historical aspect is very interesting and the monument and garden beautifully maintained.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r473483634-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "good one", "review": "Very beautiful building. The pillars and the ceiling beautifully decorated with ancient architectural style", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r312961920-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Good", "review": "The pillars and the ceiling beautifully decorated with ancient architectural style....Located in Fatehpur Sikri, the Marium-uz-Zamani Palace was the home of Akbar’s wife, Mariam..... A must see place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r313499847-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "\"RESIDENT\" GUIDE WILL TELL YOU ALL ABOUT IT", "review": "I enjoy history so I was appreciative that I found a local guy who comes here daily, to tell you all about the place .. he will ask you for $$ afterwards, but he's well worth it. Very informative", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r320991538-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Akbar's third wife..", "review": "I don't know how far my knowledge on hsitory is correct but just mentioning what i know, pardon me if i am wrong... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r326708037-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Need To Maintain", "review": "Place is good but there was lack of maintenance which should be improved, Cleanliness is the Key area which should be improved.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r338634670-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 1.0, "title": "Upsetting", "review": "Well Jodha Bai who was name Mariam after her marriage to Akbar is buried here. Its just a construction and there is nothing elaborate of beautiful abt this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r329466274-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Not a must visit", "review": "Its a tomb of jodha bai, wife of akbar. Neglected place, need proper maintenance. Also it holds an important place in mughal history. Visit if time permits.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r343293156-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "much beautiful", "review": "so maany flours there. recommend to visit spring there. also building is so beautiful. detail is so good ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r354693106-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Lonely Burial", "review": "The Queen whose son ruled the country lies neglected. The tomb is clean, nicely kept, but one can feel the sense of loss and the pain of being forgotten. Titled as Marium Zamani, mother of the masses (not accurate translation just to depict the sentiment), the Queen is forgotten. Very few histroy buffs or tourist go there. It is so forgtten that local autos etc dismiss or dissuade you going there, saying there is nothing there... nevertheless i liked this place and am happy that i could see this ignored monument.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r395040536-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Just a history", "review": "It was just a tomb there where many visitors come to see, however I still would say that there is nothing then the tomb out there, so not really a must watch thing to do.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r154821538-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Beautiful and serene place.", "review": "Very calm, beautiful, and clean place. You get to see many birds there. Must see if going to Agra. Good architecture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r393995578-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Alright", "review": "We visited this place during our vacation trip to Agra. This place is not hard to find as this place is located on NH2. Also there is a sign put up to direct people there. The place wasn’t crowded and is really isolated and has got a lonely feel to it. We were really bored. The garden was really neat though. The tomb was interesting but there is not much to look at.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r180308747-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Mariam Zamani was an Armenian Christian", "review": "Mariam Zamani's story reminds me that of Prince William because she was Armenian as the ancestor of Prince William was also an Armenian who married an Indian woman and whose granddaughter travelled to GB. to give an Armenina-Indian connection.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r180740474-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Place worth seeing", "review": "Clean nice place set inside a garden, humble but serene. Less crowded, hassle free. Can take a breather here after extensive sightseeing", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r191687462-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Jodha Begam", "review": "Mariam zamani means Jodha i.e Akbar's wife. Jahangir i.e Salim was son of Jodha begam so she was called Mariam Zamani ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r280895365-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Tom of Marium Zamani -- Lasting Resting Place of Marium-uz-Zamani Jodha Begum", "review": "The final resting place of Akbar's wife and Jahangir's mother, Marium-uz-Zamani Begum. Large sandstone structure with intricate carvings covering its outer walls. The architecture is a combination of Islamic and Hindu styles, which had gained popularity during the rule of Akbar and Jahangir. The interior part of the tomb are segmented by a grid of crisscrossing corridors and like most Mughal tombs, Mariam's grave lies in a vault below the surface of the tomb. It is not all maintained by the government. The structure was originally a pleasure pavilion under Sikander Lodi who built it in AD 1495. Open daily from sunrise to sunset, the ticket cost 100 Rupees for foreigners.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r281779742-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Mariam Tomb", "review": "A place which is historical and valuable, ticket rates are Rs 5 and close to Sikandara, you must see this tomb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r297252579-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 2.0, "title": "No information No sign", "review": "No information No sign No light the most important that you pay fee ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r298876424-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Beautiful and historic", "review": "There are times in India when the need for peace and space is required and we were lucky to arrive here early in the morning when the place was quite deserted.  The buildings and design are truly beautiful and quite extensive; as ever, having notes about the history will help fuel your imagination and enriched your experience. There are times when it is good to have a guide - either real or written, and certainly I would recommend this here. We liked the notes in this instance as it is a place where you can linger at will, in shade or sun, and enjoy the magnificence and stories.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r284191393-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "good!!!", "review": "It is the final resting place of Akbar's wife and Jahangir's mother, Marium-uz-Zamani Begum and quite a place to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r312917603-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "A different architectural style", "review": "This tomb and its history fills in some gaps as a tourist pieces together the leaders of the mughal empire.  The architectural style is different than many you will see in India- no large central dome, and dozens of archways in long hallways.  When we visited it was completely empty, which, of course, caught the attention of the one lone local who wanted to guide us through the property for a fee.  Don't bother with a tour, just go and read the entrance plaque, and enjoy the ambience.  This site will take only about 30 min.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r149542134-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Just by the fort", "review": "We didn't know about this one till we drove out of the fort.  Uninspiring.  Don't bother, unless you have time!  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r152832191-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Jodha bai", "review": "It is said that Akbar build this tomb so all of Mughal's can buried here in together but unfortunately it wasn't happened. So now Jodha is buried here. As usual nice architecture. the only problem is its locations. Little bit far away from agra. So not highly recommended but if u have time do visit the tomb. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r496231647-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "TOMB OF JODHA", "review": "The location of this spot is a bit far from central Agra, and there is so much history to see and visit inside Agra itself the this place is kind of unknown. It is a huge beautiful complex with amazing garden and lawn. It was said to be built to bury the family members of the king.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r498416974-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Also known as Tomb of Jodha", "review": "Located a little off the path this is where Akbar's favourite queen Jodha ha been burried. The time taken to visit this place is lot more", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r497098213-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "A decent place, can be avoided if out of time", "review": "This is the tomb of the most famous queen of Akbar. Some people also know her as \"Jhodha\". This is slight off the tourist circuit of Agra. Will take easily 3 hours of ones time, including travel from city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r478458376-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Mariam Zamani!!!", "review": "The Tomb of Mariam Zamani is opposite to Sikandra Tomb. Agra. The place is a very big beautiful architecture and garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r519940934-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Around Agra ", "review": "Mariam-uz-Zamani was the Hindu consort of Mughal emperor Akbar the Great and the mother of Jahangir. Her tomb is situated near the tomb of Akbar and built by Jahangir in memory of his mother. The square tomb is situated inside of a Mughal garden. The centre of the ground floor houses the cenotaph of Mariam. Exterior of the building was constructed by red sandstone. It's a place of tourist interest in Sikandara near Agra.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r522119364-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "beautiful resting place of Jodha Bai", "review": "The tomb is just a km away from the tomb of Akbar. It is situated on the Delhi-Agra National Highway, near Fatehpur Sikri. The tomb of Mariam-uz-Zamani is the resting place of Jodha Bai.The tomb is square and stands on a huge garden. There are many massive pillars, arches, and vaulted ceilings that are built using brick and mortar. The significant thing about the tomb structure is that it looks the same from the front and back. This is unique among the Mughal structures.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r576005699-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 5.0, "title": "Beautiful", "review": "The tomb of queen jodha is beautiful and peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r542539912-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 3.0, "title": "Tomb of Jodha", "review": "It's dedicated to Jhodha Bai and bear Akbar's tomb and surrounded by good ground enjoy with friends .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r563368048-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}, {"point_of_interest": "Tomb of Mariam Zamani", "rating": 4.0, "title": "Tomb of Jodha Bai - Wife of Akbar", "review": "This place is close to Akbar's Tomb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297683-d3657827-r651641587-Tomb_of_Mariam_Zamani-Agra_Agra_District_Uttar_Pradesh.html"}]