[{"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesome and unexpected experience", "review": "I have been to this cafe twice and to share it is a wonderful amalgamation of old village structure house converted into retro looking cafe. The ambience perfectly makes u nostalgic about the old veterans of Bollywood and Hollywood industry. It was unbelievable to see an almost dead philips gramophone playing such nice music on old records. The best part is short and crisp menu which has everything to taste and cherish. Loved the bruschetta made out of normal bread base. A must visit recommendation....", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r627712456-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Idyllic location and great food!", "review": "Came across this cafe on the internet before we hit it last week. You'll get what you see on the here and more. Absolutely loved the location and vibe of this place. Great ambience and simple yet delicious food. It's managed by the local village community and ably supported by Shipra and her husband. More power to them! A must visit on your trip to Lansdowne.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r628092123-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesome place", "review": "Awesome place with awesome food ...remarkable work done by amit n Shipra ..hats off to u guys ..its a must visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r629401933-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Just the perfect quaint little cafe", "review": "Engrossed in the beauty of this cafe, it is definitely I must stop place when you are visiting the hills. Taking you back to old memories with an awesome collection of books and music. They serve one of the best cold coffees I have had in quite some time..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r630201471-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit place !!", "review": "We bunch of 5 friends visited this fabulous place on the way to devprayag...", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r629272853-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Rustic cafe in the hills", "review": "This is a must stop if you are headed to lansdowne. This is a mule-shed-turned cafe with a great feel. With songs playing on a record player, vintage photographs and a spread of collectibles from all over the world on display, this place is one where you can spend hours and still want more. The hosts are very warm and make excellent and engaging conversation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r635497825-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Feeeelll", "review": "If you are someone who gives preference to feel over anything else then you should give this place a try. 40 minutes drive from Lansdowne. Visit this place while reaching or leaving Lansdowne as the roads on this route are better and can be taken while coming from / going towards Kotdwar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r636319738-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing, amazing, amazing", "review": "The beautiful Cafe which was established to generate the employment for local villagers is amazing. The food was nice and prepared fresh and their nachos were to kill for. The ambience will give you a feel of early 60s with all those movie posters and a record player (yes there is a working record player at this place).", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r637471914-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Outstanding place to visit!!", "review": "Strongly recommended!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r600944679-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit..", "review": "As suggested by my sister, I visited the cafe and it was totally worth. The cafe is beautifully made. You can go there, sit, relax, read, chat, spend some peaceful time. The owners of the cafe are so friendly. I had a great time there. Totally a place worth trying.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r649885161-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Cool place to hangout", "review": "A very small cafe on the highway, with a very small menu. We were 6 of us and we literally ordered everything there on the menu. The food was great but took time as there was only one person who was doing everything but he said there were others but have gone somewhere.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r618036401-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Superb offbeat must visit place !!!", "review": "We visited Lansdowne trip cafe and we met humble couple Shipra and Amit ,running that cafe with unique concept of involving a community. It was calm, vintage and lovely place to hang out. Food was delicious. We liked the place so much and would like to visit again and recommend this place. All the best to you both. :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r620103060-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesome place ", "review": "It waz amazing to visit this place. Neatly kept. On road. Simplicity with reasonable rates. Ludo game was a great time pass. Must go place to hangout with friends or couples... 4.5* rating", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r606193194-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A quaint little cafe with a quirky retro vibe!", "review": "I visited Travel Cafe (twice) with my family in the first week of October. As beautiful as Landsdowne is, it doesn't seem to have too many exciting eating options. But Travel Cafe more than makes up for it. This small blink-and-miss roadside cafe is an offbeat wonder one would absolutely regret to miss. Run by a young and lively couple, it has a small menu, but each item is fresh and delectable. From bruschetta to the banana smoothie, the local cooks get everything just right! Not to mention that it's neat, comfy, and damn reasonable. Lansdowne certainly would lose some of its magic without this charming cafe. Good going, Shipra and Amit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r622791504-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Thank you Shipra and Amit!", "review": "Landsdowne for me is equivalent to this quaint little cafe and the absolutely wonderful warm couple that created it. Meeting Shipra and Amit in this little Haven was nothing short of therapy for me. Serious. I took this break right after I discovered hypertension! And I have found my cure. Its a trip which will always be a part of my travel itenary every few months. The experience is enriching yet simple. A lesson on how to uncomplicate life, a lesson you learn... effortlessly. All you need to do is slow down and absorb all the goodness there is...", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r622834794-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Trip Travel Cafe", "review": "A quaint little cafe on the left hand side on your way to Lansdowne. Small enough that you blink and miss, but if you gaze instead  you'll realize this place is big enough to keep you intrigued and interested for long. Everything about this 'once-an-old-mule shed' is very interesting, for whatever you see around has been carefully curated and  hand picked by Amit and Shipra the proud owners. Everywhere you look there is an antique. The wall hangings, the books the radio, the record player, the chakki, the traditional garhwali utensils, the table tops and rest of the stuff you'll lay your eyes on has been collected by Amit and Shipra over the years. Restoration has been kept to a minimum so most of these items are in their original condition. Make it a point to look around while you wait for your snacks. Ah...Snacks a simple yet doable menu prepared with patience, so please don't be impatient while you are served. The maggi, salami sandwich and Ginger Honey tea is what I had and I was delighted. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r622907843-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Truly Unique", "review": "This Cafe was different. It had Coffee/Tea and couple of Snacks to offer, but more to that, the way it has been setup is unique. Loved the collection of items, food was yum, we loved being there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r623068248-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Everything at single place ", "review": "Visited here after a long time,You guys renovated everything very well also the antiques and collectibles are very fantastic. You can get coffee and other snacks at a single place at a low cost must visit there a beautiful place is waiting for you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r587761513-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Thank you Amit and Shipra", "review": "This place is super awesome. We really liked everything there. A small cafe with enough options and unique ambience. Cold coffee and maggi is must to try. Worth trying other options as well. We ordered many of them  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r623152213-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A unique Cafe experience amidst the hills!", "review": "Loved halting at this beautiful little cafe, built in a mud hut which was once a mule shelter. Loved the old-world charm created by its warm and friendly hosts who gave up their city life to built a new one in the hills! This cafe currently supports five local families who work there. (as we were told). Definitely worth a stop on your way to or from Lansdowne!!! P.S. do try their banana smoothie.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r622936377-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quaint and off-beat cafe near Lansdowne", "review": "A vintage radio and a gramophone player that works! Lots of exciting collectibles that you can buy. Cold coffee, lime soda and chicken sausage sandwich to eat, and extremely friendly hosts Shipra and Amit. The visit here was our highlight of the Lansdowne trip. It's a bit of a detour but worth every minute of it. Especially liked the part when we were being shown around old photographs and other antiques with Simon and Garfunkel playing on the gramophone. If you're in the vicinity of Lansdowne then do visit this place. Especially great for couples, you'll make a couple of new friends, trust me.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r589493951-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "More than a cafe", "review": "We visited the cafe during our visit to Lansdowne. A must visit for those who want to be a traveler not only a tourist. Though they serve the best cold coffee in Lansdowne, and other light and healthy foods, what attracted me the most was the human touch. The hosts Sipra and Amit has transformed an abandoned stable into a beautiful cafe with fantastic collection of travel books, a good collection of old music records & many souvenirs. A paradise for creative individuals. Above all, all of the employers of the cafe are from the local community, thus contributing to prevent exodus in an area with a relative lack of jobs. If you don't visit this place when you visit Lansdowne, you sure will miss a lot.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r589663793-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quaint little joint in the middle of the pine trees..", "review": "Awesome food, great ambiance, loved the concept and very welcoming hosts....  A must visit if you are in lansdowne.. Just sit back and listen to some vintage music ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r590315301-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Happy to have discovered this cafe in the hills", "review": "Lansdowne - Travel Cafe looked totally unassuming but once inside, we realised why its rated so highly on Tripadvisor.com  A few bean bags and some moodas to sit – a small souvenir store with a lot of funky, kitschy and unusual gift items – a clay oven – a gramophone record player and vintage prints of Elvis and Beatles – its something that we would never expect in Lansdowne. We were pleasantly surprised at this great find this time. The kitchen was small and they took their own sweet time to prepare the food.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r591330835-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Must visit place on the trip to Lansdowne", "review": "Unique ambience with antique things, great food, and lovely hosts.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r592314849-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Must visit Travel cafe", "review": "If you are in lansdowne then tarkeshwar temple and travel cafe are not to be missed. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r592339899-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A cosy corner enroute Landsdowne", "review": "True to its name, the travel cafe is where u stop to grab a bite or a beverage and chat up with the wonderful owner couple and fellow travellers..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r594538563-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Vintage cafe/ superb food and service/ cool concept", "review": "This unique place is run by a very friendly and interactive couple who have renounced urban life and have moved into the clean fresh abundance of hills. The decor is vintage and classic. The ambience was lovely with posters of music gods and a vintage record player playing a classic records. Its tiny , hence more personalized service. We played a game of ludo while sipping hot heavenly tea. We also had maggi, yum grilled chicken salami sandwiches and cold coffee. The service and food is perfect. The host,Shipra and Amit are naturalists and they also own a piece of land behind the cafe that Shipra showed us. Beautiful valley view, mangoes n pomegranates growing in the wild. Also, id like to mention that this part of Lansdowne called DEVIKHAL ( its actually before you reach main landsdowne) is more beautiful  as it is rather untouched compared to the main town offcourse. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r599108842-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Bliss in Lansdowne", "review": "I went to Lansdowne for New Year's and hell yeah it was the right decision. One day was enough for Lansdowne. For second day we were confused if we should visit this cafe as it is approx 20km from the city. So we contacted the owners to ask how to reach the place. They were so generous to offer us to join them from city to the cafe and back once they are done with their work. The place was lit. You can truly spend whole day at this place without getting bored for a single minute. Lots of books, old movies tapes, games and awesome cup of coffee are more than enough to keep you busy. A must visit place. Three cheers for the owners for all the thought and hard work put in for this cafe.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r552014505-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Bliss in the mountains", "review": "The café has everything a traveler looks for. Awesome food, amazing curios, damn neat decor and to top it, a great location. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r557480449-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Lansdowne a virgin hills", "review": "Away from din and bustle of town, Lansdowne trip travel cafe is a same place I was looking for.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r575332556-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Best ambiance and best kind of people.", "review": "If you're a travel enthusiast, this is the right place for you to meet like minded people. The food is really light and healthy something you'd want while traveling. And last but not the least the hosts were the best. They are highly motivation kind of people who have actually opted to follow their dream and passion instead of getting squashed by the societal obligations.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r589453591-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Worth a visit.", "review": "We drove a 17 Km for the cafe and worth a drive it was. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r576375382-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Beautiful cafe", "review": "if you are visiting near Lansdowne then you must visit here. well themed well decorated cafe. I love the Mil stone specially  .", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r581598734-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Best Cafe in Lansdowne", "review": "But for Google maps & the precise description of location on trip advisor, you may completely whizz past this cafe without even noticing it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r581739920-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Beautiful cafe... excellent food... Awesome time...", "review": "Visited this cafe recently after reading about it. I was pleasantly surprised by the excellent food & their unique decor. It was cozy, it was so artistic. There was a real record player! I fell in love with it & visited it again after few days! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r583077985-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Super Time", "review": "We stopped bye the place for a cup of coffee and ended up spending quite some time. The hosts Shipra & Amit are extremely friendly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r587557446-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 3.0, "title": "Travellers Nest", "review": "So I recently land up to this beautiful place in Lansdowne called Lansdowne Trip - Travel Cafe. The best part of the place is friendly and helping owners (Shipra & Amit). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r585215266-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Lansdowne trip ", "review": "One of most memorable trip.... That too a bag Packers trip... We both took a train (mussorie express)  from Delhi(9.30pm ... It reached kotdwar at 8.30 am next day.. We had booked a hotel prior to arrival.. So got freshen up.. We took a Share sumo ₹70... Till lansdowne... Transport is not a problem.. We told the driver for the local sight seeing.. He charged 800... 6 points.. And took us back to kothdwar in the evening... Come back before 5pm... We visited sidh bali mandir at kothdwar in the evening... Beautiful scenic beauty.. I returned as I had to travel to Rishikesh next day... Early morning.. ₹100 share Sumos.. Amazing trip all together ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r531450729-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "It is travellers cafe", "review": "Most extraordinary time we had there . Our whole trip to lands down was not a great one. We came to know about the travel cafe and that was the only good thing we did. Small classic super ambiance nice people lots of music good food and best way to end our trip. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r533949909-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesomw", "review": "Small, tiny yet awesome. We wondered whether a detour would be worth and realised, fully worth it. What a decision. Guitars, books, old gramophone records, all maintained and on display. Handicrafts on sale, we indulged in some Maggi, coffee, etc and loved the time we spent. Did the stopover on the way back from Lansdowne. Not to miss if you wish to hit a library cafe amidst the beautiful ranges of Lansdowne ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r534983064-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A must visit travel cafe!", "review": "Up in the hills, on the way to Lansdowne is a small and beautiful travel cafe. It is a great place to be at after a long drive. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r535091300-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Worth travelling 22 km from Lansdowne!", "review": "We visited as a group of 12 friends. This quaint, rustic cafe stole our hearts the moment we saw it, with its retro charm (the gramophone playing vinyls in the background only made it better).", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r546450340-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit Cafe! ", "review": "Lansdowne isn't a commercial place and you won't find many places to dine & chill, but then i came across to this cafe and instantly fell in love with it. It's a short drive from central market and offers an incredible experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r537954677-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Come here to take back home a story worth sharing", "review": "If you don't visit this place when you visit Lansdowne, you sure will miss a lot. It is set in a village with rustic old vibes, books to read, a wall to admire and gramophone playing in the background, one just cannot find a better place to chill! The maggi and the nachos salad were mouth watering. Also, don't forget to say Hi! to Mukesh bhaiya and Durga . Do take back home a souvenir before leaving the place :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r546834060-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "The perfect place for serenity", "review": "This place came as a surprise to us. We were not expecting something this in a quite place like lansdowne. The owners are doing a great job by restoring an old place and thereby providing services to the community. The food here can give a run for money to all the cafe chains in Delhi. The homely feel of the place added to the calm music records running in the background and just opposite to the place are hills; we were supposed to visit there for an hour or so but we stayed there whole day. For one day you can visit lansdowne and do sightseeing but just keep one day for this place to sit back and feel the air around you. Food was awesome specially nacho salad and coffee. A must visit place and a great experience we had here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r551168228-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Perfect Getaway", "review": "With great interiors, antique showpieces and unmatched warmth, this place is definitely a must visit. Soothing and calm, this place will also offer mouth watering food. The maggi and the coffee is a must try. The place has unmatched positive vibes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r546925531-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A pitstop for every traveller en route his journey...", "review": "I visited the cafe with my friends recently for a story sharing meetup. The ambience and the hospitality shown by the owners and the locals was heart warming. There is a beatific trek alongside the cafe to Devikhal village. The food offered was a gustatory delight and the stories shared created a special bond between me, Devikhal and it's people. A bond, that will stay with me for a long time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r546438605-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Best place in the hills..", "review": "So.. we happen to stop on our way back from Lansdowne to find this cute little cafe. at first sight, it's a mud house right next to the main road. we parked and stepped in to find some of the best hospitality and ambience.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r494779197-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quaint refreshing stop over", "review": "A small, well maintained, great ambiance Cafe, which will relax you and remind you of yesteryears. Sit, relax, chat, listen to music and watch the birds... Food choice is limited, but taste is great. Recommended stopover to or from Lansdowne. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r496181289-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Take your Time at this place", "review": "Please take time out and visit this cafe, not just for the sake of visiting it but for experiencing it !! The owners will surely make you feel like home and you would love to sit and just chat with them. This one is straight out of a dream and you would cherish every second spent there. As for the food ! their cold coffee and sandwiches are godly !!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r498040555-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Tranquility at its best", "review": "a small quint cafe in the lap of nature run by an amazing couple who believe in making people happy by providing them a great time and great food. Superb hosts they are.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r498433758-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Explore the unexplored!!!", "review": "Good People", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r501610665-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Beauty in simplicity", "review": "Visited the cafe while returning from Landsdowne. The place is just \"AWESOME\" , it is simple yet beautiful. A place to just relax and enjoy nature. It is modern yet very \"desi\". The music, food preparation, hospitality is just amazing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r501665516-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Setup towards community welfare", "review": "A beautiful setup in midst of a serene environment which contributes towards community welfare as well", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r503201055-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 1.0, "title": "Faux and Pseudo", "review": "We went for lunch and nothing to write home about.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r512153817-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Full of surprises & beauty", "review": "I must say visit to this Café was the best part of our five-day drive in Uttarakhand last week. We take so much proud in what Shipra and Amit have done. They both are marvellous people. The way this small café is designed and operated is commendable. We visited the café, relaxed, had nice food. The primary reason you go to mountains is to relax and spend time with locals and the nature. Do visit this place without fail. Best of luck to the team Landsdowne Trip - Travel cafe", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r530547472-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A Must Visit place - In the middle of nowhere!", "review": "A quaint and a majestic cafe, literally in the middle of nowhere. Revisit childhood memories with their classic yummy maggi, soothing timeless music and a book. Brownie points to the route leading to this cafe. Hats-off to Ms. Shipra and her husband for managing this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r489273672-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 1.0, "title": "Not worth a visit", "review": "The place is away from Lansdowne and a let down when you do visit. The staff is nice but not chatty or well-informed. The owners  live in Delhi. The palce is made to look quaint but right in the middle of teh market so no view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r489492537-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Peaceful holiday", "review": "I have to say, we didn't expect what we experienced, a surprise cute place out of nowhere. We were really impressed with the theme of the cafe which is nothing we have ever came across. Few of our friends are already planning a visit to the place during there road trip . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r490117651-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A quaint tranquil place tucked away in the mountains.", "review": "A must visit if staying in Lansdowne or en route Pauri. The only place which assures fresh food and little knick knacks to pick from. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r491660820-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Serene Summers. ", "review": "Please visit. It's a place worth 100s of visits. First of all, the location is so calm and beautiful that we didn't wanna come back home. Made a road trip.!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r492074973-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Peaceful", "review": "Beautiful scenic location with some amazing food and retro collection of music and movie archives. Worth a visit if somebody is around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r492898664-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Great atmosphere, location and food", "review": "I'd been to the cafe on June 11. We'd ordered sandwiches, omelettes, bruschetta. The menu was very small but the food was delicious.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r494166504-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quaint Peaceful, view as life goes by...", "review": "Quaint Peaceful is what can describe this place, you can hear nature and occasional truck bus passing by... had Maggi and tea year back while returning via this route Kotdwara year back. I longed to come back... this time around I was back with laptop got into meetings aka WFHills mode :) 3G/4G did not give much problem and sipped couple of nice herbal tea's... it was just great experience... surely wil be coming for more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r494750293-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Lovely little cafe in the lap of nature", "review": "I was on a very short and maiden trip to Lansdowne with my buddies. After searching for a while I got a link for Trip Travel cafe, which I personally believe was a very good idea to visit.. though the cafe is like 15 km ahead of Lansdowne on the Kotdwar-Pauri highway.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r494767879-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A place to unwind", "review": "This was my second visit to Lansdowne and I regret why I couldn't visit this cafe the first time. What an amazing place simply WOW. A perfect drive to a beautiful cafe. Everything about the place is great starting from the food, ambience, location. A must visit place if you are in Lansdowne or nearby. Talking about the must try their sandwiches, honey ginger tea and pasta. Cheers guys great work!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r457252548-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "An Explorer's Nest on the road", "review": "The highlight of the trip to Lansdowne was the visit to the cafe. A nice themed cafe in an offbeat spot...loved the decor, the photo frames the vintage items on display and the guitar off course.. We jammed on some numbers and took many photos.. The food is great , ambience is great and we get to see our food being cooked.. Great work guys.. Will defintly visit again and recommend it to others..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r457149062-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A cafe-visit one will cherish for long long time!!", "review": "A day before our trip to Lansdowne and we accidentally came to know about this cafe on internet. And in the very first sight it absorbed us in its plethora of antiqueness, simplicity and creativity in its stuffs.The location was also very amazing.One can also capture sights of some amazing birds. And other than this what really impressed us was their hospitality.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r457117345-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Offbeat location but relaxing and enriching time", "review": "This is a quaint place some miles away from proper Lansdowne. However this offbeat location has much to offer in itself. Stacked with knick knacks like an some musical instruments, LP vinyl records, small handicrafts and a myriad of books it is a place where you can spend quality time whilst having a sumptuous meal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r459610201-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "HEAVEN IN LANSDOWNE..", "review": "Place is obviously pretty awesome especially the food and the gesture of people in cafe is terrific....Hats off to shipra for running such a lovely cafe in Lansdowne...i wish i could get the same quality food in Delhi as well....Perfection at its best---Travel Cafe...This place is so calm and specially for lovers .I would 200% suggest everyone to do visit this place....", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r457757642-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "In the middle of nowhere, you will find everything", "review": "The food, the ambiance and the vibes of the place are the perfect add-on to your trip to or from Lansdowne.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r472322095-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Vintage Vibes", "review": "It was a wonderful experience stopping here for maggi and tea. I visited a week back over the weekend, and made a stoppage here for snacks and ended up spending over two hours at this location. The place is littered with vintage stuff and memorabilia - from old records to books to posters and old timey knick knacks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r462653508-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Put Travel Cafe on your \"Must visit\"  list!", "review": "Make this trip folks!The ambiance is unique,,,the colours the decor like lovely old doors, the Rustic bits, the plants,  in all: \"Everything\"! Including Jimi  Hendrix looking back at you.These  owners are at Peace and content with the world ...you reflect.They inspire others to do the same. In season Mukesh the attendant who takes good care of you spoke of joyous crowd that over flow onto the road. Hopefully will visit again and maybe this time see Jim Morrison share space with Hendrix?", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r473315948-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A cute little world !", "review": "I had heard a lot about this place before coming to Lansdowne this summer, and everything was exactly as good and more. I spent around 4 hours there with my group of 10 fun individuals, dancing for majority part of it to all the amazing 90s songs there are, singing while someone played the guitar, getting smashed multiple times in my very own saap sidi (snakes and ladders ), and last but the not the least being the subject of the most insane April Fools day prank (for which I do have to thank Amit and Shipra, the owners, for being such awesome hosts!).", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r474400820-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Must Visit Place ( If you are Near lansdowne)", "review": "Found About this place on Tripadvisor. being a Lover of Art, Music , Good Food and Ambiance, i liked the cafe from the pictures. we were at Tip in Top at around 5:30 and i called Shipra ( owner of the Cafe) to confirm weather they are open or not. It would take normally 30-35 mins from Tip in Top Point. I thought it would be difficult to find out the place, however Shipra texted us the directions, ( Also you can navigate from google Maps) The cafe is on the main road itself, The moment i reached there and i saw the cafe. i was like this is my type of Cafe. We ordered Maggi and green Tea and started exploring the Cafe. Cafe is basically a small village House , Maintained properly along with an Open Kitchen. they have small Collection of Books ( Library) , Ludo & carrom to Play Aorund. one can always play Old Bollywood songs there. I loved the Place. Surprising the food was also Good. I would highly recommend to visit this place if you are near lansdowne.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r473976115-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Weekend Getaway", "review": "It is the nearest hill station from Delhi. The drive from Kotdwara (foothill) to Lansdowne is quite steep and scenic. The Garhwal Rifles has put signboard by painting the directions on rocks. Lansdowne is 81 km from Pauri and about 250 km from Delhi. The drive through Blue Pine trees on hills near Lansdowne is a wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r395892966-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Incredible experience", "review": "This place is breathtaking. A very small place but it will mesmerise u . The food menu is very limited but whatsoever it is finger licking and they would share the recipe if u ask for !!The staff was enthusiastic . The ambiance  would take you to a different world only if u don't expect a 5 star property", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r417344046-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Nostalgic", "review": "It is a must visit for travellers, location is awsome and peaceful. Food is good, we 6 friends in total and everyone had a different choice my favourite was chicken sandwich, totally loved it. For me it was a nostalgic as they had many things like old record player and cot which reminded of my village which I very much miss in delhi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r419393654-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Beautiful place with beautiful memories", "review": "The cafe is really a must visit. Perfect ambience and yummiest food. Set up in a beautiful and serene place, Lansdowne it is indeed a great and inspirational start up. With a limited menu, no compromise is made on the items quality. Each item is just too good to have and not to miss. Apart from this the cafe has nice interiors and add on games, books and antiques to keep you busy and enjoy. Special memories with this place. Wishing loads of luck to the cafe to prosper and grow more as it deserves it all. :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r422716089-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "unique collection, awesome food, close to nature!!", "review": "we friends really liked the ambience...too good to be here.. food was amazing..nachos n salami sandwich n even the tea...", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r433543687-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "More than tea and sandwiches- a pleasant surprise ", "review": "This is not a cafe but the owner's love story with all things vintage and interesting,which he proudly displays in the cafe. From old records, books, colourful crockery,furniture pieces to posters it's all there and much more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r448530244-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "2 day trip to Lansdowne.", "review": "Hi reader,", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r449245970-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "New Jeans in old packet", "review": "Finally, I got a cafe which is so different yet so similar. It is beautifully designed in a hut. The location is so nice and it's one of the must go places in Lansdowne. It also sells some of the things in cafe at affordable rates. The food is also good and the rates are very price friendly. One must go to this place if they are visiting Lansdowne. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r455590362-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A trip down memory lane!!!", "review": "We found this place just scrolling through TripAdvisor and trust me it's a definitely a must visit..really good food and homely experience!!! Nachos salad a must try...I would suggest u visit this place on ur way back to Delhi/Kotdwar/Meerut from lansdowne as it's a wee (approx 17 Kms) bit out of town, on the Kotdwar-Pauri highway..A quaint little place just to unwind!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r456319743-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Alice in Wonderland!", "review": "If Lansdowne is a wonderland, this place is our Alice, encompassing several adventures within its limited space. First of all it is in middle of nowhere, secondly it is rustic yet very trendy and last but not the least it creates an atmosphere where one can unwind. The sitting arrangement is comfy and the numerous artifacts (be it the record player, sitar or photographs) lying carelessly makes it more of a nostalgia shop. Excellent escapade for those who just like gazing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r457111412-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A great thought", "review": "A very thoughtful and noble idea at a place where there is nothing to do.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r377616353-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A hub for Antique Lovers", "review": "Recently I stopped by at this cozy place set up somewhere in a small village near Lansdowne. Before visiting the place I had read about it & seen the pictures shared on the net by travellers. Indeed the place is a must for antique enthusiasts & travel cafe lovers. I loved the seating area that houses pics of Bob Marley, Marilyn Monroe, Beetles, etc. There is a small antique shop that offers a unique collection of stuff from across the globe. I picked up a fish shaped antique lock, a one of its kind on my visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r376113605-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A wonderful thought , Beautifully implemented.", "review": "Had read about this place online , and had to take 10Km detour to reach it, but it was totally worth it. Really loved the concept and the thought behind the place and its decor. I loved the concept they have of sending out letters , all you need to do is to write and they post it for you . they had old records from movies like Abhimaan , Anand  etc. combined with lot of interesting books (they also had comics like chacha chaudhary :) ). Although i was full but i still tried the pomegranate tea and Sandwich , they were simply amazing .They also have an antique shop which is also quite interesting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r379289172-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Revisit to chilhood memories", "review": "I along with my friends visited this place and we had no idea about how it is gonna be. Trust me it was one of the bestest time that we spend at travel café during our Lansdowne visit. In mid of the proper village , relaxed atmosphere , soothing old and timeless music and excellent hospitality. We simply spent 3 hours without even realising.Had awesome tea , could not try the sandwiches which was praised by many visitors , but I guess I need to go there again to try those ;). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r386861039-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit when in Landsdowne", "review": "In the beautiful village of Devikhal is located this fascinating cafe. What a wonderful thought has been brought into reality one can know instantly on reaching the place..A beautiful view of the valley sitting on the bean bag listening to Rafi songs a chacha chaudry book in hand with a Maggie as a add on in the chilly weather ..Oh man who wont love it..Yes this place is so unique with antique collections bringing back our own childhood memories..It is so well maintained run by two wonderful people Shipra & Amit ..lovely couple with like minded ideas bringing a modern touch to the village without affecting the original natural beauty around..They have this great people Mukesh & Durga..All of them take care of this place as ones own kid..and that reflects in the place..You can buy certain stuffs thereby promoting the skill of the very own villagers and also helping the lovely cafe to grow up ..Thank you trip advisor for letting us know about this place..we ended up making two new friends sharing our great memories of childhood..A place to chill & relax unwinding all the stress..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r387483188-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Best place to visit if you are planning to go to LANSDOWNE..", "review": "First of all i would like to thank the owners of this cafe that you guys have done an incredible job by making such an awesome cafe out of a place which actually has nothing in in terms of built fabric.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r387859537-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Hidden Gem!", "review": "I read about this place on Trip advisor under things to do in Lansdowne and found it interesting. Yes, it is a detour to get to this place and when u arrive you may be a little disappointed in the first few minutes about the effort u put and what the place turns out to be.... But wait! Explore this small place, learn what all it has to offer, from historic artifacts to travel books to a music record player to yummy food, and you will start to love the place. The time we spent here just flew and I really wished we had more time. It's a place to laze around, read travel books hear classic bollywood music, sip their lovely tea and munch their interesting snacks. From their limited menu, do try the Nachos salad, it's awesome. The man running the place, along with his helper, is a warm and friendly host who will make u feel at home instantly. Must go if any of the above interests you..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r390970427-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit for your lansdowne trip", "review": "was told about this beautiful cafe by friends we made at our hotel. visited it with them. It is a perfect place to enjoy great food alongside the most enriching music of the by-gone era, played on records. Very warm hosts and great hospitality. The food (snacks basically) is amazing and vegetables are so fresh. Been to every cafe/resto in Delhi and I'm yet to have a Nachos salad as good as this cafe's. Had chicken salami sandwich and tea also. Great music collection both english (rock, jazz) and old hindi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r335304146-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Wonderland! 💙", "review": "I so loved this place! One of the many reasons of traveling to Lansdowne was the excitement to see this Café too! I traveled alone to Lansdowne, and, with the help of the contact number on TripAdvisor and the really sweet owner, I reached there quite easily!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r392543698-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "A good eatery in Lansdowne", "review": "Had read rave reviews about this cafe before going to Lansdowne in Feb (great weather to be) and had to force the three others to visit while on the way back. And boy, do we regret it? Not even a bit!!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r393107142-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Must visit", "review": "Pleasantly surprised to find this awesome cafe in a remote place like Lansdowne - Must visit. By visiting this cafe, you will end up creating ever lasting memories!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r389600277-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Alls well that ends well.", "review": "the best part of the trip, was to spend time with my friends at this cafe. the chicken salami sandwich, must try. the location, cudnt be better. and just while your friends are chitchatting, take a moment and go for a stroll at the backside. you'll know the wroth.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r341336935-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Must Visit", "review": "amazing place to visit, infact the best restaurant in the entire area. menu option is limited but cost wise and ambiance in terms of hill cafe is really good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r349854278-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Speechless..  Shud b d tagline", "review": "My journey to Landsdowne dis time landed me at a place which by all means deserves to be in my memory for ever. Heard about it on TripAdvisor- the reviews urged me to take a detour and make a visit.  What initiated as a quick stopover actually made me stay there for four hours that too seems too little time for a place like this. Beautifully n lovingly nurtured by the owners n run by villagers what a unique concept for ecotourism. And not to forget their private antique collection.  One can sit and listen to songs on a gramophone -  a long forgotten luxury.  And yes you get to buy such amazing artifacts collected from all across the country.  And then they have sumptuous food on the menu Nachos salads,  pastas that too in Hills truly awesome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r347875528-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must stop by on your Trip to Lansdowne", "review": "A great pit stop, amazingly handcrafted cafe..!! Do try the pomegranate tea and Chicken Sausage Sand-which..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r341856345-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Great Place!", "review": "This place is about 23KMS from Lansdowne Cantt Market. The only Cafe worth spending time with great food and few options for Drinks. Tastefully done interiors. Met Amit, he Ideated the place with his impressive collection of Antiques and LP's he is also a very good company and has a lot of knowledge about the local Fauna of the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r365131654-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A must visit place ", "review": "Good place to sit ,relax and enjoy music .", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r361697896-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Much sought after place", "review": "Me and my wife visited Lansdowne Trip and Travel Cafe on our way back to Delhi from Lansdowne. Found it on Tripadvisor and it was worth a visit. Carefully done up place which is though small but has the warmth. The antiques and souvenirs section is very nice. Kudos to the couple which is doing their bit for the local community as well. Finally a place to \"Hangout\" on NH119. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r366782604-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Great Place to Visit!!", "review": "I and my friends visited this cafe which is located nearly 25kms from Lansdowne Cantt . It is a beautiful place to chill and enjoy the amazing view of the hills. I thank  Amit and Shipra for serving us with good food and drinks. You guys are doing a great job for the village community . Cheers!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r367706484-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Only hidden gem in the lap of nature", "review": "This place is situated 25 kms away from the main market.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r375065863-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Innovative place and warm hosts", "review": "I highly recommend this place when you are in Lansdowne. This place is fusion of tradition and modern with eco friendly environment. Tasty food and amazing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r316243558-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Great place to visit", "review": "Its a beautiful cafe to visit, the music, the calmness and food all is very good. The maggi and the sandwiches were the best. The only issue is that they need to sort out their google maps issue as it becomes really difficult for people to find this cafe. This place is a must visit and must see.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r316250354-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Great place to visit with friends!!", "review": "This is a great place to hangout for a few hours. Great food. A bit difficult to find as of now and might get a bit crowded sometimes. I made my profile only to rate this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r316076980-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing experience... Lovely place... Special thanks to the owners", "review": "We came across this place through trip advisor and due to amazing reviews decided to go the same check the place for myself along with my family. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r316832235-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quaint little place", "review": "A must visit for any traveller to Lansdowne. Ideal stopover enroute to Kotdwar from Lansdowne. Very quaint little place with an amazing collection of records and books on display with an ancient record player playing some music from the past. lots of bean bags to lounge on . We had a soothing cup of green tea with an international standard of presentation accompanied with some awesome chicken salami sandwiches which was a refreshing change from the regular roti dal routine. This place also has a huge variety of trinkets to be purchased including some awesome pottery and masks all the way from Nepal", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r321777253-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing place", "review": "Such an amazing place. The place can be divided into two parts: One the seating inside, which has such a lovely ambience with bean bags, Hollywood posters, English classic songs in the background. The second is, the seating behind the café, serene calm beautiful valleys, one can sit for hours there. Coffee & sandwich in the middle of the lush green set up, just awesome. Loved the food, the coffee, the hospitality. Its a must visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r317001804-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "must visit place, if nt visited then u have really missed sumthin amazing", "review": "Awsm place nd hospitality of owners is amazing. Really dnt miss this cafe, this is the place which cannot be described you can just feel it by your own.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r322830166-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Great Place", "review": "I was in lansdowne around the diwali break of 2015. Discovered this place on trip advisor and decided to go there. The owner was extremely helpful in proving useful information on the surrounding areas. The cafe offers great beverages and outstanding service. Highly recommended for people traveling to Lansdowne, or Pauri or any other place on this route.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r326507380-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesome trip...", "review": "I used to go through the another route to Lansdowne but when i come to know that on the road from kotdwar to Lansdowne NH(119) have a awesome travel cafe I instantly fell that I have to go there with my friends. When I reach there the hospitality given to me was excellent. The owner was very polite with us and we enjoy our time that we spent there. Very nice experience.... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r328744545-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 2.0, "title": "Disappointing", "review": "After the big hype about this place on TripAdvisor, I decided to take the detour to break here for lunch. Even though the guy on the phone warned us not to expect any real lunch, we were totally disappointed. There was barely anything to eat or drink. A couple of items available were made with packaged, processed foods. There was no toilet either. It is definitely not a place for the weary traveler.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r334183306-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Finding Neverland", "review": "As I got close to the destination the lust to enjoy the never ending journey intensified, I just wanted to get into the Trans of this never ending journey. i enters the cafe & mother nature's lullabys put me right into the desired trans. The universe conspired & travel Cafe, The Neverland was there just for me .... The frangrance of freshly sprinkled earthern floor, wood and the pahari dialect of hindi soothe my senses imeediately.... As i get settled & started observing the surrounding the memories of Malgudi Days took me to a visit in the past..... I saw an old Radio, a antique Paddock lock, vinyl records but these were not the souvniers but a part of my life which have been left behind in the Mad Race....sudden Urge to relive that left behind life made me write 7 post cards..... Hmmmm... writing this review & reliving it again....", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r286275340-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Quite simply a superb freshening experience!", "review": "We list down this place from Trip Adviser and we went there specially to check out the antique collection and honestly, we stumbled upon this hidden GEM. Intrigued by the Bob Marley poster and plenty of other music paraphernalia on the wall, Collection of some excellent books.  The quaint, but cozy interior and excellent collections of old times. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r289747561-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "The Wanderlust has got me ....", "review": "Travel cafe is one of the places one should really visit when in Lasndowne. They have a huge antique collection and amazing framed posters, some on sale - some for show.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r300130015-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Stumbled upon the Antique collection", "review": "It's a nice place to sit and gather your thoughts. It gives you a calm place to relax with beautiful views of the mountains.We ordered different type of tea's, which were quite tasty and made even better with the great conversation with the owners. It was like stepping back in time still has the old time feel. Owners are doing a great job.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r289751757-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A hidden heaven in Lansdowne!!", "review": "I really appreciate the couple who have the guts to travel all the way from delhi twice a month to maintain this \"small world of their own\".Its a brilliant place to vist and you can sit chit chat relax.The best part was that lit cute monkey which these guys rescued just to save him. Loved the souvenirs there...keep up the good work guys. Will always visit this cafe whenever im in lansdowne..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r289990223-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Offbeat & Rustic Concept! Must visit place in Lansdowne.", "review": "This cafe is something you cannot really expect in mountains. Its great to experience something like this. I don't know how to put the experience in words but I must say, if you are in Lansdowne, you cannot afford to miss this cafe. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r305628860-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "We fell in Love with the Travel Cafe", "review": "We discovered the Travel Cafe on our last day in Lansdowne and thought we would  go check it out and stay for half an hour but we ended up staying for 3-4 hours.Totally fell in love with the place! The best part was that not only did they welcome us but also our puppy. We lazed around listening to old music, reading Chacha Chaudhary and sipping on pomegranate tea( which by the way was amazing!) The view and the trek from the cafe was superb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r304583588-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Pit stop of my bike tour!!", "review": "We went out to visit tiffin top but ended up reaching travel cafe, the ambience n calmness made us stay there for 3 hours....the maggi cooked for us was the best part, it made our trip!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r311163289-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Awesome!!!", "review": "It's a beautiful cosy little cafe in devikhal some 10-15kms away from Lansdowne.. We really enjoyed our time there with good service, good food and some really nice music.. You can carry your own beers and have a good time with friends while you meet other travellers.. A must must visit in Lansdowne..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r314825313-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing cafe with equally amazing views", "review": "On my way to lansdowne, we were told about this alternate (more scenic) route to reach our destination. We stopped at this very inviting cafe near devikhal and could not help but take pictures of the view and the cafe. Also got the chance to meet the owner who is a travel enthusiast and an amateur photographer. He had many stories to tell about his adventures in various wildlife sanctuaries and how he built this cafe just to help the local village find a place on the map. We even went back to the cafe on our way back and picked up a few knick knacks as souvenir. Great place with Great conversation..", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r265409435-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Surprisingly Awesome !", "review": "Amazing place based on an equally amazing concept where you can read travel journals, find wonderful souvenirs and antiques to carry back home, enjoy nature at its best..a must visit :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r269729507-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "A hidden jewel", "review": "On my way to Lansdowne recently, I stumbled upon this hidden gem. Built in an alcove, Lansdowne Trip Travel cafe will take you through the rabbit hole and into a place which is clearly specked with wanderlust. Full of eclectic things collected and displayed very tastefully, reflects what a travel buff the one who conceptualized this place must be.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r265470248-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing place...!!!!!", "review": "A  beautiful ambiance, with travel journals and very cute souvenirs from all over.  you should visit this place with some spare time so you can go for jungle walks with Mukesh. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r270564935-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Rustic Cafe....!!!!", "review": "This cafe lives up beyond the expectations of the tourists visiting there....The ambiance is just cozy and comfortable....the location is just relaxing....The host of the cafe....Mukesh is a wonderful fellow...The concept by Amit is just awesome...His efforts to help the villagers for having a better livelihood thru such innovative concepts is highly appreciable..One can spend hours together sitting and sipping coffee here and can even buy some wonderful antiques and souvenirs as memories to take back home.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r279411280-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "An amazing cafe!!!", "review": "Beautifully done interiors and an amazing collection of antiques, this cafe is certainly a must stop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r280420395-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "What an amazing place! ", "review": "Owned by a Delhi based couple and run by localities this is among one of the most amazing places that i have been to.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r281511751-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Simply Memerizing........!!!", "review": "On a routine hill station trip you expect to see some bad roads, curvy drives, tiring journey and you bear all of this for amazing landscape that awaits a picture perfect shot. But what if you get all this even before reaching your destination???", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r281038790-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Weekend attractions ", "review": "Clean, green and  beautiful hill  station near  Delhi..best place to visit in  weekend's and  if you just  wanna relax  in  lap of nature. Not  so  much  local  attractions  like  manali  and  shimla but  got  few places to  visit  like  lake, church temple and army  museum.Mobile connectivity is  poor at some  places . personal vehicle will b  recommend as limited   local  transport  is available  due  to  cantt  area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r282401246-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing Place to Visit", "review": "Hi,", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r243994167-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 4.0, "title": "Superb collection of travel books and antique items.", "review": "If u in in this area, do visit this, it is something very different from usual coffee shop or a typical souvenir shop. It has a superb collection of travel books and antique items. So if you are interested in these types of things then it will be a great experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r244106941-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Unique Concept", "review": "Takes you back to history.... Lovely place to hang out over a cup of coffee..Amazing collection of antiques.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r244115083-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 1.0, "title": "Hidden in Village", "review": "This cafe is located far from lansdowne town, it may be valuble for those who wants to visit rural places", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r284995904-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}, {"point_of_interest": "Lansdowne Trip - Travel Cafe", "rating": 5.0, "title": "Amazing Concept, Interesting Place", "review": "This is an amazing concept, really liked it, very different from usual shops you find on every hill station, en route to Lansdowne on Pauri highway (take left from Duggada T point, this route is far better and scenic, road quality is superb, wider and full of beautiful spots vis a vis to other route, other one is rough and very narrow). The thing which i liked the most is the collection of Travel books and magazines. NO Rocket Science...... just sit, have a cup of coffee/tea and read as many travel journals as you can and the most imp thing, do visit the Devikhal Village (back side of the Travel Cafe') view is breath taking, you can also go for a small track into the forest, charges are very nominal, contact Ganesh (care taker), almost at the same height of Sattal this place is a birders paradise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g1208973-d7289611-r245245518-Lansdowne_Trip_Travel_Cafe-Lansdowne_Pauri_Garhwal_District_Uttarakhand.html"}]