[{"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Popular Heritage Hotel", "review": "Previously this place was a mansion but now it has been converted into a deluxe palace hotel known as Merwara Palace.This hotel has around 36 well maintained deluxe room and 9 exclusive suites.The other amenities include huge gardens,a ball room overlooking Ana Sagar Lake,Multi-cuisine restaurants.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r471573839-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Popular", "review": "Bachchan Ji Ki Kothi is popular in Ajmer. good place for everyone .we can say this is like heritage.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r479443271-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "Needs maintenance...good view", "review": "We went there to check it out at early noon, and the view from there is very good. You can see the entire lake from there and click some good pics...but the place needs upkeep, and almost nobody has any answers for any questions...It's huge, but not maintained properly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r435236355-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Good...", "review": "It was great experience to visit here because it is related to our history. Great view of lake from here. It is a well maintained and clean place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r556257051-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Inappropriate luxury", "review": "This magnificent building, built in the tradition of British colonial architecture, but decorated with an Indian flavor. It draws attention to itself as soon as you walk from  Nasiyan Jain temple to Ana Sagar lake in the place where Daulat Bagh is located. It stands on a hill on the left and is surrounded by something like a fort wall with battlements. Now it is a luxury hotel by Indian standards, but I have no idea what  can attract aserious man even for a relatively long stay in such city as Ajmer - dirty and crowded with pilgrims. But, for those who still come here, the hotel looks like it could, in addition to comfort within, offer great views of the lake itself, Daulat Bagh and Aravali mountain range, however, in latter case  constantly covered either by haze or veil, which forms the normal for lowlands mode of humidity and temperature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r499112429-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Its more like a Hotel Cum Wedding Place", "review": "Its a classic place, Built by British, Nice views, near the lake, worth a visit, We visited for a wedding which took place here. Overall Decent place and worth a visit if you like colonial buildings and beautiful scenery,", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r584465603-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Kothi", "review": "Bhagchand ji ki koti is classic place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r488784329-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "need better maintenance and training of staff", "review": "this place can be a jewel in Ajmer if it is well maintained. The people managing it need to maintain it much better. The quality is not what one would expect from a place with a local reputation as this one. The building is historic and can be very well done-up. The proximity to the lake and its sauna fauna is another asset that can be built upon. Again Ajmer is a dirty city, so this property gets side effects of this fact. But this place is gated, and it can be well kept if the management can maintain t better and improve quality. The locals will find it awesome because they might not have much to compare it with especially given its history and grand architecture. But the opportunity is lost at this property. It can be plain awesome, yet it needs to do a lot to be even very good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r399643070-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Merwara Estate", "review": "Be it Marriage Part , stay or a Birthday party or for tourist stay- Stay  gives a Palace feel and Hill  TOP location  gives a great feeling to be there", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r647292392-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Attend Marriage of Brother", "review": "A good place to stay there , best place of ajmer for marriage purposes , as famous its costly too with the amenity", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r612026147-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Majestic location - Absolutely facinating wedding venue!!", "review": "Awesome location, next to ana sagar lake.. the whole place is an out of the world location.. it was the venue for my sister's wedding and i think it could not get better.. awesome venue for the big fat wedding.. rooms are huge with all the facilities.. the location with aravalis.. lake and also the dargah nearby unmatchable!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r184164419-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "Lake view is awesome, everything else is waste of time", "review": "The place is build on a small accent very close to the Subhash Udhyan. The place has serious parking issues specially during an event. Avoid driving yourself if you are not a decent driver as the place has 2-3 sharp blind turns, although the management appoints a person to help you with the same. It has a Hotel, a Restaurant and is mainly used for Wedding parties. The food is not very good and services are pathetic. But the rooms are breathtaking, specially the new rooms are just awesome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r244354474-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "It seems it is more of a marriage place than  a visiting place", "review": "We had gone to see this place but some marriage was happening there. Could not gather much historical connection just that owners sons have now converted it into Hotel which is known as Mewar Palace. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r188984671-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Nice place to stay and enjoy.", "review": "A very picturesque building overlooking the Anasagar Lake and greenery.  The place is converted into Merwara Palace Hotel with accommodation and boarding facilities.  During the marriage seasons, the premises are rented out for Dinner/Party/Celebrations.  However, only vegetarian food is served/allowed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r226179233-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "This Kothi[Big house] used to be owned by Seth Bhagchand Ji The richest man of Ajmer", "review": "This Kothi [Big House]used to be owned by Seth Bhagchand Ji.He was the richest man of Ajmer .He sold it off because of loss in business it seems like a story when you see this magnificent building Lake view from here is awesome Its marble structure is beautiful one can imagine how well this family must be living in its good times Its worth a visit any day", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r258207572-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "Just view", "review": "Been to this place 2 times recently. Once due to wedding and once for dinner. It's a good grand view and overall scenic view. Food and other service is okay nothing gr8 or recommend and it's a pure veg place. Try once if interested but do not expect too much apart from view or so.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r247544409-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 4.0, "title": "Great place", "review": "Don't know how the service gonna be during regular visits as I was there for a wedding ceremony. The architecture is awesome and the maintenance is really good. Care should be taken at blind turns", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r260851857-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Converted into a restaurant now", "review": "goes by the name hotel merwara estate now..has a nice hotel looking towards ana sagar lake..i would suggest this place to stay if you are visiting ajmer", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r330959794-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Place more for Marriage", "review": "I had being to Ajmer many times and everytime I would be here its pre occupied for Wedding ceremony. More of a very very beautiful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r262691405-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "Classic Architecture", "review": "You can have a view from Subhas Udyan, as the Kothi is private property and used for private functions", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r334133031-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 5.0, "title": "The only heritage huge palace!!", "review": "it is a monument like amer fort in jaipur ... we were given elephant and camel ride ... royal dinner there in the royal restaurant ... !!!  a monument not to miss on your visit to ajmer", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r119820165-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "If you are around, poke your head in", "review": "As far as sights go, it is actually much nicer than Dargah Shariff, but not worth making a stopover in Ajmer because of it. The carved columns look impressive, but if you have seen one photo of the place, you have seen it all, there is nothing apart from a line of columns. There are tons of beggars though (far more than elsewhere in India), and as a western tourist we felt even more on display than in other towns. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r120144821-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 1.0, "title": "Went for lunch...Food and Service was Awfulllllllllllllllllllllllllllllllllllllllllllllllllllll.... Terrible experience", "review": "Went for lunch...Food and Service was Awfulllllllllllllllllllllllllllllllllllllllllllllllllllll.... Terrible experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r120159260-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Bhagchand Ki Kothi", "rating": 3.0, "title": "Grand place but below par food and service", "review": "The hotel is quite grand with amazing entrance and building.. but seems it does not have proper management. The food is very avg. The service can be extremely slow too. Needs improvement in almost all departments. Such a good property should be better than this", "url": "https://www.tripadvisor.in/ShowUserReviews-g317096-d1205673-r128259036-Bhagchand_Ki_Kothi-Ajmer_Ajmer_District_Rajasthan.html"}]