[{"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 2.0, "title": "Absolute Waste of Time", "review": "Entire from KAUSANI to Almora today, we reached Binsar Wildlife Sanctuary hoping to have a glimpse of some Wildlife.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r583813782-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "End of the road", "review": "No, this is not a place for picnic or wild animal viewing spot for paisa vasool.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r577572340-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Absolutely Marvellous", "review": "A very nice place which give A  distant view of Himalaya. There are many small trails in the sanctuary where you can explore the nature", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r582139676-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Extraordinary Jungle walk and a few birds", "review": "I visited in May and we walked to the top part of the Binsar forest named zero point from where we were supposed to get a mesmerizing view of the Himalayas, but we were unlucky. Do not go there at the end of April through End of September. Chance to see the picks are very less. But, you can enjoy the walk through the jungle and while coming back, our guide offered an excellent walkway through the jungle to trek back to the starting point which was the KMVN resort at Binsar. We will long cherish the thrill fun excitement and experience we had while trekking through the jungle. I also was able to view some rare birds and captured one or two. Overall an amazing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r587441752-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Walk in the jungle feel", "review": "Narrow road leads up to the KMVN Binsar which is also the end of the 'road' for cars. Walk through the well paved paths in the sanctuary.. Very quiet except for the birds and the whispering of the winds. Great place to breath in some fresh air and enjoy a nice long walk. Recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r582941628-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Wildllife Sanctuary situated in Kumaun Hills", "review": "Binsar Wildllife Sanctuary is situated in Almora in Kumaun Hills,about 30 Kms away from Almora.It is very rich and famous for its flora and fauna .It is also very famous for Sun Set and Sun Rise.It has dense forest enveloped with many special trees , even many people call it second valley of flower when red flowers are blooming in month of March, The sanctuary has Oak trees at the higher and  pine tree  in lower altitude.It is a perfect place for Bird watchers .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r600188757-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Mother Nature in all her glory!", "review": "It is a beautiful place where Mother Nature blossoms in all her glory. The sanctuary is a densely forested area comprising mainly of century-old oaks and other trees such as pines and rhododendrons. As we visited in June, sadly we could not see much of the rhododendron flowers. However the lush greenery will soothe your soul. We were fortunate enough to view Himalayan ghorals. Langurs are in plenty :P. Wild boars were sighted near the TRH during night but we could not see them. You have to pay entry fees at the sanctuary gate, thereafter travel 11-12 kms to reach the gate of KMVN TRH Binsar. Motorable road stops there. From there, there is a 2-3 km jungle trek to Zero point where one can view the Himalayan peaks. Although we could not see any wild animal, but the trek in itself was fulfilling. The trek passes through dense jungle and the path is wide and manageable.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r587648819-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Untouched!  The most quiet place in town", "review": "Loved the wild life sanctuary. Did see many animals but the jungle and the Mountain View’s were breathtaking. After reading Jim Corbetts - Man Eaters of Kumaon,  we could see how the man eaters walked the jungles. You feel like you are there and the leopard or tiger will jump out of the bushes. A bit scary but fun!  We truly enjoyed it ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r615027651-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Walk to zero point", "review": "Nisar wild life sanctuary is famous for its panoramic view of Himalaya. Best viewed from zero point which is 30 minutes walk from the place where you can reach by vehicle. Need to buy ticket at entrance. Entry will be closed by 5pm except for those who booked room at hotels inside sanctuary", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r650156767-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Awesome place", "review": "The wildlife sanctuary is a treat for nature lovers .. the bright red rhodendendrons add so much colour to the jungle that it mesmerises you. The view from the zero point is spectacular and the walk through the sanctuary is healing .. the silence interrupted by the calls of the birds add to the charm of it. There is nothing to do there except to just disconnect and unwind walking through the unspoilt forest and admire the Himalayas on a clear bright day. Will definitely go again!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r498505563-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Must visit", "review": "A visit to Binsar isn't complete without a trip to the wildlife sanctuary. the sanctuary was essentially built to protect a species of oak and isn't about wild animals, etc. However, nature lovers would love it for the beauty of the hills and the thick forests. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r497432158-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Safari Trail", "review": "Reaching Binsar Wildlife Sanctuary is a task, it's a long drive up the hill and the roads are bad.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r531117942-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Wildlife Sanctuary without Animals....!!!", "review": "35 Kms. from Almora,Wildlife Santuary is a beautiful,quite and wild Himalayan mountain destination surrounded by abundant garlands of alpine flora,ferns hanging moss and many species of wild flowers,tourist can feel close to heaven,it is located on the height of 2412 meters,and it inhabits oe than 200 birds species,it offers an excellent view of Kumaon hill and 300 Kms. panoramic view of the Himalayan peaks from the zero point and sunset is worth watching,it was established in 1988 the entry fee for the forest is INR 150/person and for taxi INR 250/car, a guide on this trek is must for the tourist because it is very much possible for one to get lost in the forest,but do not expect animals to see in this forest,its rare chances,only government rest house and forest rest house is available to stay here,but no electricity or modern facilities available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r535284632-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "No leopards👎 great trek👍 Himalayas view point 🗻", "review": "On entrance  there are Boards on which it is written that you will find Wild Leopards , don't harm them ! But literally speaking we didn't saw a bird let alone Leopards . But still we had a great trek . You can go by car till halway of the sanctuary after that you have to go on foot for About 1 or 2 km . After that u will reach Zero point where u can see Himalayas but we couldn't due to bad weather . Way till Zero point was like a fairytale with green big trees all around , pleasant breeze , mysterious roads and everything ! So go only if u luv trekking otherwise don't go . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r535815680-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "mini picnic at outskirts of Almora", "review": "I had heard a lot about this wild sanctuary part in kumaoun region & luckily got a chance to explore while returning from hometown.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r548368844-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Most Popular Wildlife Sanctuary", "review": "I went to Binsar Wildlife Sanctuary. Binsar Wildlife Sanctuary is home to as many as 180 species of birds such as eagles, woodpeckers, monals etc. Jackals, Red Fox, Grey Langurs, Black Himalayan Bear, Chital, Himalayan Goral and Wild boars are a part of the wildlife at Binsar. It is great place to go.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r549485278-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Binsar Forest Retreat is a wonderful resort excellently managed by a very charming family of naturalists, Pallavi and Pr", "review": "Our stay of 4 days far exceeded our expectations. The rooms allotted to us were tastefully decorated and very comfortable with great views of distant snow- capped peaks of the Trishul range and the surrounding forest with oak, pine and rhododendron trees (which had started blooming). The property is a naturalist’s paradise and with Pallavi’s help, we spent a lot of our time on the decks listening to the forest sounds and photographing the large variety of birds which frequented the resort, as well as the animals around it (including a number of Barking Deer and the rare Himalayan Goral). ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r566578072-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 1.0, "title": "Complete waste of time and money.", "review": "Binsar Wild life sanctuary is a complete waste of time and money. They charge Rs.150 for adults Rs.75 for kids and Rs.250 for Small Cars and Rs.500 for big cars. Not well maintained narrow roads leads you to the walking road where you need to trek for around 2 kms . You don’t get to see any animal. Just a nature walk. If you are in mountains any walk can be nature walk. So please don’t waste any money here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r570379766-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Mesmerising beauty of The Himalayas!", "review": "Binsar is one of the most beautiful yet under-rated destinations anybody can visit in Uttarakhand. It is a must go-to for all the nature lovers, hence you should update your bucket list. An adventurous road inside the forest takes you to the zero point. It holds amazing scenic beauty such as the view of the Himalayas. Binsar is definitely a place to visit and explore for atleast 2-3 days. This place is a bliss for the eyes and all the photography lovers, so don't forget to carry your camera with yourself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r419737778-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "On top the mountain and the world", "review": "On top of the mountain and the world  is what you feel when you are driving thru winding mountain roads on a steep climb from BINSAR of about 10 kms. to reach  top of the mountain and feel close to nature and heaven . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r483374660-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Beautiful place", "review": "Excellent remote sanctuary near Almora. Please go to this place if only you and people accompanying your really love nature, appreciate solitude and have the respect for peace and tranquility. It is not a sight seeing place to be ticked off in list. We had seen groups (usual tourist) coming there for the purpose of sight-seeing and spoiling the tranquility and purpose of such a wonderful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r426003623-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Binsar wildlife sanctuary ", "review": "Though we did'nt spotted any wildlife animals there but still we enjoyed up travelling till there . While on way we spotted a dog named as SIMBA(AS PER LOCALS TOLD US) . He was the alone living animal there . We did trekking to the zero point and while on our way th weather started opposing us . But still we managed to reach up and stay there for 10 minutes and had to return back early . We also enjlyed eating up maggi after reaching the trekking area   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r484382769-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 1.0, "title": "Wild life sanctuary ", "review": "Nothing any wild life in Binsar even not found birds only monkeys was found in whole wild life sanctuary, wasted of money & time to see this.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r489810833-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Less of a Wildlife Sanctuary", "review": "It's located on top of the hill. However, it's more of a dense jungle in the hills rather than a wildlife sanctuary. Tourist guides who are supposed to guide for bird watching are very egoistic about their rates. Entry fees is 150 INR per adult. Car fees separate. Go here only for the terrific and unparallel views of the Himalayas, which can be seen only on very clear weather days. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r490136016-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Simply Majestic", "review": "Majestic, calm, peaceful place. It's on kind of rain forest and will give you that feeling when you trek through the forest. If you want enjoy the local wild life then you need stay limited guest house available inside the forest. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r490832799-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Great", "review": "I start from Choukori with Tarun Joshi my guide and driver with his celerio.I stooped at patal Bhubaneswar Joshi come with me in side cave he has a very good knowledge about this place.Then we start for Binsar ,Joshi took jungle road after passing  Dhaulchina , he is really a good guide cum driver I enjoy the road through sanctuary.After paying rs 625 We enter the core area. I had booking in trh binsar.Then Joshi offer me to go to zero point with him.He knows every thing.I enjoyed again the journey with my family.Next day at 5 30 am I go to jungle again and watch many birds and a marteen also.The jungle is superb i enjoy it.also thank ful to joshi for his guidance.you can contact{95 68 037822}him for family tour of uttarakhand he is brilliant.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r491666028-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Jungle and not wildlife", "review": "We had visted this sanctuary in the month of may 2017 and stayed at TRH Binsar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r494192266-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Beautiful place - more signs will help navigate around better", "review": "The terms wildlife sanctuary could be misleading here. It is a beautiful forest and great for walking, but do not go in expecting to see a lot of wild animals. There is an entry charge of Rs 200 per person (If i remember correctly !!) and then you get to drive through the forest all the way to the top. Vehicles do not go further than the Forest rest house. It is advisable to take a guide to explore all the view points, as there are no signages if you want to walk about.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r323563670-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Zero point trek -  awesome view of  Himalayas", "review": "To enter in to the sanctuary there is an entry fee.unlike other wild life sanctuaries no jeeps are available. one has to arrange their own vehicle. after traveling for about 7 to 8 km in the forest with  thick foliage ,oak and other tall trees , the vehicles are not allowed further. One has to trek 2km to reach the zero point. Although the sanctuary talks about wild animals none of them are seen during day time.Even birds are not seen during October . some languors are  visible. now and then.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r323908650-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Awesome one day visit.", "review": "We are on our winter vacation and at Almora. We had planned for a one day visit to Binsar wildlife sanctuary and zero point. For this we booked a car from Almora. The rate was Rs.1200/- to and fro. It took around 1 hour to reach there. Sanctuary entry fees was Rs.150/- per adult Rs.75/- per child upto 12 yrs and Rs250/- for car. From the entry point to zero point it was 11 km. The car will not go till the last point. Last 2kms you will need to walk. From zero point you will have clear view of Panchachulli, Nandadevi etc etc. Really awesome view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r334601534-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Offbeat Uttarakhand..amazing road trip ..fantastic wildlife sanctuary & panoramic views!", "review": "our road trip consisted of Bhimtal - Almora - Kasar Devi - Binsar - Jageshwar Dham..", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r340833041-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Wildlife sanctuary without wild animals", "review": "Its a dense forest.It has govt entry fee of rs 150per person(adult) and rs 250 for vehicle.Private vehicle is must to reach there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r356255005-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "One night at Binsar", "review": "In our honeymoon (Feb 2015) we stayed one night at Binsar and it was really an amazing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r338810054-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "“Offbeat location..amazing road trip ....", "review": "Binsar wildlife sanctuary is a dense forest on the high plains...no wildlife..only langurs.... if you are lucky you can spot something early in the morning. The forest in itself is quiet nice and big full of pine, cedar and oak trees....you get splendid views of the Himalayan range from various points of the forest...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r367791066-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "A MUST DO FOR NATURE LOVERS", "review": "Stayed at Binsar TRH in midst of the jungle for a couple of days. Driving upto the TRH thru forest was an enjoyable adventure in itself. One should be a careful driver & the vehicle should be in an immaculate condition. Of course a good weather is a must to enjoy fully.Trek to zero point which is 2 kms from TRH completes the experience. Though we could not see any wildlife or flora as mentioned in few sites but it's a great getaway for city dwellers & I would love to come here again & again. Yes TRH is very well maintained & staff & meals served meet the purpose.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r373924028-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Beautiful Place but NO Animals", "review": "A very adventurous road takes you to Zero Point in Binsar Wildlife Sanctuary. It is a steep and narrow road, one has to be very careful while driving on it. There are NO animals in Sanctuary and if you are very lucky you may find a few Langurs. The journey and view is beautiful and worth enjoying if you are a nature lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r385712645-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Only second place from where you can see 300 km stretch of the western Himalayan ranges incl. the Trishul to Panchula", "review": "A place for nature lovers and trigger happy cameramen! No electricity. Beautiful cycle tracts for mountain biking that you get on rent at the KMVN forest rest-house. The only place that you should stay at whilst in Binsar. Gets you closer to nature and only place in Binsar from where you the Himalayan panorama unfolding in front of your eyes. Food is good and so is the hospitality. No public transport, so take you own vehicle or hire one.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r400235122-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Very Peaceful with Great View with great view on a clear day", "review": "Binsar Wild Life Sanctuary is best if visited on a clear day. One can get mesmerizing view of snow capped peaks of Himalayas. Not much of wild life as such but if one has patience, it is possible to spot lot of birds. Early morning is best time to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r281277300-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 2.0, "title": "Nothing much to see", "review": "You may find a lot of chirping and occasional views of langoors and birds. Roads leading to the top hill are under construction at some points. Ask me and i say that its not worth paying 2000. There will be guides available for tour if you want but i personally find it a waste of time and money.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r279851603-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "peace !", "review": "travel to this place only for the peace.. one can trek through the numerous trails and get lost in the quiet nature with only the chirping of birds for company..or you can gaze at the stars so clear in the sky and wonder at anything & everything...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r307288980-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Binsar - Jun 2015", "review": "It is Binsar forest rather than Binsar wildlife sanctuary. If you are expecting to see some wildlife (e.g. Leopard, bear, deer etc), you will be disappointed. We could only see one Hanuman Langur and I guess that is not a difficult find. Even we could not see birds as well. So, from wildlife perspective, it was a flop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r287859512-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Visit to Binsar Wildlife Sanctuary", "review": "We went in the afternoon after a day of rains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r284215649-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Wildlife", "review": "Nothing wild is visible in the sanctuary.  Good for trekking.  Can enjoy chirping of birds, monkeys.  View from Zero point is excellent. Total trek to and from takes about one hour.  One should go preferable at early morning.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r285278393-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Peace........serenity........tranquility", "review": "The place is lush green, peaceful and very calm. Apt location to get away from the maddening rush and spent some time with yourself. Having said that, it's not a place to spot wild animals rather good for forest walks/trekking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r316249294-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "View Himalaya", "review": "Binsar wildlife sanctuary is full of greenery and natural forest.Variety of trees are there.Highest point is close to 2500 metres above MSL.Vehicle can go upto 10 km from sanctuary gate and thereafter one has to walk uphill for about 2km.to reach Zero point.After reaching Zero point one can have a magnificent view of Himalaya.Various peaks can be seen from this place especially, Nandadevi, Trishul,Nandakot and Annapurna(Nepal) and few others.View of Himalaya from this place is better than Kausani.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r316789725-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Awesome trip ... calm n peaceful... !!", "review": "Remarkable 4 day trip on bykes and car  ... group of 8 friends... in the arms of mother nature... !! Peace and calmness everywhere... mild coldness ... fresh air... perfect road trip and sight seeing... !!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r317533759-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Wildlife sanctuary sans wildlife!", "review": "nothing much to see in the wildlife sanctuary. you will be going around and around very eagerly to see any animal. We could spot just 2 or 3 deer's. Others than that nothing could be spotted. it is better to visit jim corbett park rather than visiting binsar if you are really wanting to see some animals and wants to experience the jungle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r243293248-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Forest experience!", "review": "Binsar wildlife sanctuary is a dense forest on the high plains...no wildlife really..only langurs....perhaps if you are lucky you can spot something really early in the morning sometimes....The forest in itself is quiet nice and big full of pine, cedar and oak trees....you get splendid views of the Himalayan range from various points of the forest...there are two ways of experiencing the sanctuary. First, you can visit Zero point - the high point or observatory to view the snow covered range....you will need to walk 2 kms one way in the forest to reach the zero point... In my opinion you get the same views from various other points in the forest...one being very close to KMVN resort in binsar....so no point of treking all the way to zero point...we opted for the second way....saw the views from a clearing next to KMVN resort....and then went for a jungle trek with a guide....he took us deep into the forest ...showed us the various wild herbs growing in the forest....told us about the flora and fauna....spotted some birds for us...overall the experience of being in the thick of the forest was awesome....now for the charges....entry into the sanctuary is Rs 150 per person, Rs 250 for the car...and the guide charges are Rs 300 for a short jungle trek....!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r321964146-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Awesome", "review": "I hv been to Switzerland, so very very limited places can make me feel  d wonder of nature ! And yes ..Binsar MAGIC worked !!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r247396330-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Lonely Forest", "review": "The Binsar forest is good to see sunset in the evening. It is approx 7000 ft\" from the sea level, its also known as high altitude forest in Kumaon sector of Uttarakhand.But there no animal can be seen here, the entrance of the forest is INR 150/-per person, car entrance INR 250/- just waste of money & time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r268042993-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Wildlife santuary .", "review": "If u visit to Binsar wildlife santuary there is nothing much to see.but the if u love the nature u will have thrill.u must stay one night at KMVNgovt. resort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r243800915-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "A walk in woods", "review": "I liked the different varieties of plants which are otherwise not seen in Delhi. Somehow varieties of birds were not many. Also the guide was not much informed. The binsar river was quite dirty which spoilt the beauty of place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r269837198-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Beauty wow wild life nonexistent", "review": "Binsar sanctuary is 12 hrs drive from delhi . Beautiful forest of rhodendron (bhuransh ) pine and cedar . But wild life non existent we took a detour from the main road into the dense forest with a local guide but an hour n a half in dense forest saw nothing just few local birds . On the top is kumayun vikas nigam guest house which serves buffet lunch dinner and a tea stall just outside which serves maggi n tea . There are a few heritage properties in the forest namely grand oak manor, Binsar retreat , mary biden and khali estate if you want to stay in the middle of jungle in  solitude in beautiful but very lonely surroundings, nearest tea stall would be 15 km. If you enjoy jungle you ll like Binsar( wild life?? ) sanctuary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r272735245-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "One of the Best Packages provided", "review": "Hi All,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r272664917-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Nature calling.", "review": "The mystic aura of dense forest which is a combination of both pine and oak tree located above 2000 meter above sea level giving one an exciting experience of being with oneself in midst of wildlife and beautiful birds sanctuary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r273053607-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "M'i'yst-ic", "review": "This place at this point of time is nothing else but green. On a more lighter note I can say had my trip been more than a day or two even I would have been covered by moss!!  But seriously the great pine trees n saal were just a treat for a soul fed up of city life. The place is about 30 km from Almora. The tragic part is no bus service to the place deep inside the sanctuary. Entry ticket is INR 150/- for Indian national and 250/- for LMV. The place called zero point is 13 km from sanctuary gate and it's all filmy and magnificent. Though at this point it's not possible to see the view of entire mountain range but still it was great. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r221348833-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "A great Hike", "review": "I like to walk and the walk to the Zero point of Wildlife Sanctuary was worth it. It took us about 3 hrs to reach the top but then we took many halts on the way. I think the best experience ( if you have the strength to walk 25km a day) is to walk around the sanctuary. There are some places on the way which are amazing but you can figure out such places if you take a cab. There is a KMVN hotel in the sanctuary which is reasonable to stay in, though it does not have electricity.Its near the zero point and has a great view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r227844694-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Non existant wildlife but amazing forest", "review": "If you come to binsar to look for wildlife, you would be disappointed....there is hardly anything...for that matter, birds are also very few and you really struggle to glimpse them....BUT, the forest is awesomwe..extensive pine, deodhar and bhuransh(rhodendron) trees are found all around and the treks through the jungle is breathtaking...you need a guide to take you through these treks...Come to binsar sanctuary only if you like treks in forests.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r274337362-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Awesome experience", "review": "The beauty of Himalyas, tranquility of the place, you can really feel the mother nature. Along with all these, you can enjoy the magnificent view of peaks like Trishul, Nanda Ghunti, Nanda Devi, Nanda Kot. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r234057795-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Refreshing but not very eventful ", "review": "You go to the Binsar Wildlife sanctuary expecting to see some animals but at the most you see a cow and if you're lucky maybe a buffalo. However, the trek to Zero Point is extremely refreshing and peaceful and so it is worth going once.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r236511660-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Good peaceful place", "review": "It is really good. The track to zero point is wonderful. We had seen some birds and enjoy the beauty of the dense forest in early morning. It was really good to have walk till zero point. From it, you can see the panoramic view of the himalayas (Kedarnath, nanda devi, trishul etc) if clouds not present. We had stayed in TRH Binsar and saw the sunrise with all the top most peak of himalay in indian region. It is really nice place to see. If you have enough time don't miss to go this place. Prior booking required for Stay.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r237612258-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Beautiful!", "review": "Stunning lush green forests, with fantastic panoramic views of the snow-capped peaks of the Himalayas, Binsar wildlife sanctuary is a large forest reserve nestled in the Kumaon region of Uttarakhand. Treks through the forest offer a great opportunity to spot wildlife (including leopards), several birds and excellent views of the 'snows' as well as of the verdant Shivalik hills that extend magically into the horizon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r238225303-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Best place in UK", "review": "Really it nice to visit the Binsar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r241804982-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Nice weekend destination", "review": "We went there as a group on a weekend. This was not a much planned trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r161663279-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "binsar wildlife resort", "review": "dont go there if u r expecting to see wildlife but the sight of snow peak mountains is awsome.  before entering the santuary u hv to buy tickets at the forest check point.  signages are not good inside but it is nice to just walk around", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r162622899-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 3.0, "title": "Nice and quite, Only had an encounter with Langoor Monkeys and wild wolfs", "review": "I like the trekking part and the captivating and eye feasting views of the enchanting hmalayas. You can see number of peaks from a single point. This is really worth the trek but I think Deoban near chakrata, has a much better view of these ranges.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r243049426-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Rishikesh to Binsar Route", "review": "Binsar wildlife sanctuary is no doubt a wonderful place with all the peace and tranquility.  The whole stay at Club Mahindra resort was relaxing . The difficult part was reaching there. Our journey  started from Chandigarh with a night halt at Rishikesh. The next part was difficult and confusing. Confusing because the Google maps mentioned the journey time around 7 hours but it took around 11- 12 hours. None of the reviews at internet mentioned this time factor. So if planning for Binsar be prepared for a exhausting journey.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r162685010-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "mother nature cradles you", "review": "the sanctuary does not boast of animal sightings but is is told that leopards prowl there. Zero point has clear view of trishul and nanda devi peaks(the weather has to be good). lots of trekking routes and one can stay at KMVN/Binsar retreat/khali estate etc. go there for absolute peace and tranquility. u will not find electricity there but the resorts are very comfortable. check the entry timings (generally during sunlight hours) at the sanctuary. carry a powerful torch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r177867982-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Perfect adventure / leisure", "review": "Panoramic view of Himalayan belt from Binsar is a must view. Trekking to zero point is an adventure however I found people walk only a short distance and come back. Trek till zero point to have real trekking and adventurous fun. Mahindra resort has a property little away from the wild life sanctuary but it is very comfortable stay and good food. For those who love nature, it is a must visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r186218576-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Binsar - 28 January 2014", "review": "I drove to Binsar on 28 January 2014. Birdlife was poor due to snow fall a few days ago; but it being a sunny and warm day, landscape was great. Visited Khali Estate too. Attacking some pix.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r192721218-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 1.0, "title": "Just not worth it", "review": "The Binsar Game Sanctuary is just not worth the trip. Why they charge 150/- per head and 250/- for the car cannot be understood. No signage, no information, no birds, no wildlife, a decent view of the snow clad peaks. The walk to zero point has no meaning what so ever. The shop at the entrance has very unfriendly and unenthusiastic staff. Stay away totally.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r188348117-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Fantastic experience", "review": "I visited Binsar along with my family and friends . The uniqueness and pure unpolluted atmosphere made the location immediately likable. The view of sunrise and sunset was just fantastic. The majestic peaks in the distance were like a garland of gems strewn in front. The location, accommodation of KMVN, food and staff was all above expectations. In any case in such environment one should not look too much for comforts. There are great treks which are not too tough.All in all i had a great experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r203322854-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Nice experience if u r close by", "review": "We were staying at club mahindra so went early in the morning - 7am to the Binsar sanctuary. Ideally one shd b there by 630am. Road onside is 9 km and very bad / takes 45 min to reach guest house. From there it is 90 min two way journey. Lovely panoramic view of the Himalayan ranges and 5-6 peaks - trishul, chamba, nanda devi, mrigthal etc. and glaciers clouds cover the peaks by 930-10 so go early. Lovely trek in the woods and rhodendrons. Can see the odd wild animal including leopard apparently - but v wd have got scared if v actually saw one. Take a guide - charges 300 for the family but worth the trivia he shares.  U can also carry food and have a picnic there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r204248719-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Binsar,and The Binsar Retreat - Awesome Beauty of Nature.", "review": "Paradise ! Awesome flora and fauna.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r129433501-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "In the leopard land.", "review": "At a 10 hrs drive from Delhi and about 90 Km from Nanital diving though steep pin bends u reach this place. From the sanctuary gate it is a 10 KM drive via a v. narrow road to a 7500 ft high KMVN resort where we stayed.. Weather is fantastic with night/early morning coldish in June end. Days are pleasant. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r133973644-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Best Himalayan View", "review": "One of its own kind of sanctuary. KMVN Guest Lodge is most preferred stay option with no frill facilities and pure veg menu. There is power supply only for 2 hrs in evening to recharge phone, camera etc. Brilliant location to get mesmerized by Himalayan view, one can easily spot snow line in the entire view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r146467032-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Binsar, a perfect place to experience pristine unexplored nature, awesome and uninterrupted Himalayan view, wildlife and freshne", "review": "We had an amazing experience with family  in Binsar, just around 38 kms from Almora this is a perfect place to spend a weekend with family and friends in the serenity, purity and beauty of raw, wild and untouched nature. A lot of opportunities for all to capture nature and Himalayan range lead by massive Nanda devi group of peaks, panchachuli peaks, bandarpunchh peaks, trishul peak, maikotli and many more. Explaining Binsar in words is really not possible, one has to actually see it to believe it. Lots of options to stay there from Kmvn(govt rest house) to pvt properties.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r142180183-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 2.0, "title": "Quiet, no crowds, not much wildlife", "review": "This was a childhood dream.  Always wanted to go to Binsar having read about it in many stories.  The place was quite for sure...away from the maddening crowds at Corbett. But it turned out to be a big disappointment. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r151450394-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Awesome secluded place.", "review": "I love to visit less crowded places in india.Binsar is one of them.Untouched and exotic. Take time off 4-5 days as camping and other activities are must do.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r159408890-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Binsar Sanctuary- A not to miss attraction", "review": "A walk in the Sanctuary to the \"Zero Point\" is an experience in itself.  the chilly weather coupled with forest atmosphere, with a varierty of never seen kind of trees would be  things to remember.  The KMVN resort in the sanctuary has a nice viewing gallery and should not be missed.  The travel however is through a very narrow road and you should engage an expert driver for this journey.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r61165156-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "truly amazing experience", "review": "Binsar wildlife sanctuary is simply out of this world. Very calm, serene, peaceful and fantastic views of the Himalayas. If you really want the complete kumaon hospitality i would strongly recommend going to this pretty village called Gaunap which is a 2-3 km trek from Binsar Zero point. I stayed in the village having decided to forgo my room booking in a KMVN (Kumaon Mandal Vikas Nigam, govt tourist rest house) and i think one of the best decisions i made. food, hospitality , views and of course away from the maddening city life. Must visit i would say", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r64047263-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 4.0, "title": "Binsar- a scenic paradise", "review": "Take a break from hectic schedules of daily life, relax and rejuvenate in lap of nature ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r124042750-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}, {"point_of_interest": "Binsar Wildlife Sanctuary", "rating": 5.0, "title": "Binsar - Forest with Snow capped Mountains at height of 8000 ft", "review": "We had been to Binsar around 3-4 years back.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297686-d639918-r68395464-Binsar_Wildlife_Sanctuary-Uttarakhand.html"}]