[{"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A great place to explore", "review": "Chaubatia Garden was a great place to explore. The place exposes you to various kinds of trees- Apples, pine, cheddar and lovely flowers as well as great views too. Our guide told us about the various trees and plants. It’s advisable to take a guide who will charge a nominal amount for their services. You have to walk a lot so ensure you wear comfortable clothing and shoes with strong grip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r599428303-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Scenic and nature at its  best!!", "review": "Chaubatia is situated away from the city. You have to drive for6 7 Km from Jhula Devi temple. drive is through hills and road is narrow and not so good. You can see beautiful views during your drive to this place. Chaubatia is Govt. owned garden of local fruits spread in very vast area.   Park your vehicle and take guide. I advice all visitors to take Guide, he will charge Rs 200/- fixed . Without the guide you will not be able to understand anything. He will tell you so many interesting things which you will miss if you don't hire him. You should be wearing comfortable clothing and shoes for going inside as you need to walk a lot that too on down slopes , steps . Its  like trekking inside. You will see great views and perfect for photography.  A perfect place to see the nature at its Best. You will see pine, deodar, snake plant, Mica stones, willow tree, apricot tree, variety of Apple trees, Walnut tree, Pear tree etc. At this place you can see 200 variety of apples.  Its like trekking inside this place. You will be walking on the Mica rocks. At the end of the garden you can enjoy refreshments also, though the place is not well maintained.  Dont forget to take guide with you for better appreciation of garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r599436047-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "apple garden and forest trek.", "review": "poor maintained, ill marked, no guidance. no parking. roads also not repaired. only little bit maintenance is due to location in cantt.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r618672467-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Wonderful gardens with lovely views !", "review": "Chaubatia garden is a wonderful sloped garden, with tall trees to greet you, numerous flowers and fruit trees to welcome you, and views of Himalayan peaks to wow you ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r616421423-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice garden, shady guides", "review": "The garden was quite lovely when I went, which was in the rainy season. I did the steep hike around which was worth it. Lots of pretty flowers and trees around. But I wish I hadn't taken a guide. He abandoned me in the middle of the garden when it started to rain and walked on ahead. I was having such a hard time navigating the steep in the weather, had to ask other visitors for help. Don't hire the guides. They're not worth it. They just point out the flowers and trees. Unless you're really into botany, do the hike by yourself. Stop at the little cafe to buy some local mango pickle and black salt (the juices and wines are too sweet,) and buy fresh apples in season from near the ticket counter. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r604072314-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A Walk through the mountain.", "review": "This is a Goverment owned botanical garden popular for apples and plums. I lovedthis place. It was green, silent and beautiful. We had to walk inside the garden which was about 1 km and got chance to see closely many unique flowers like torch lilly and ripe plum fruits on trees...walking in those mountain trails felt amazing. This place is a Must for a Nature or Mountain Lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r608355725-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Summer Break ", "review": "We paid a visit to Ranikhet and Chaubatia. In fact Chaubatia is further 9 kms ahead of Ranikhet at a higher height. The place is very quite and have a few good Hotels / Resorts to Stay. Sunrise and Sunset is very beautiful to watch. One can also visit Local Pickle factory in Chaubatia to pick Burans (local fruit) Juice, Jams etc at a very reasonable rates, the best part is that all this is locally made at this place. A 2 hrs drive (one way) to Kausani and back will also give you a very good  driving experience, from dense pine forests to open paddy fields at Someshwar.  The Ranikhet Golf Course is also a must visit location.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r660237847-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Guides need to be professional", "review": "Chaubatia garden is maintained by Horticulture department of State government. They have about 340 gardeners and other staff to take care of the farm and nursery. The department has opened a cafeteria which sells natural products like various juices including that of Rhododendron. Make sure you are purchasing the right quality from there. Government has outsourced that is fine but cannot allow selling of poor quality products to the tourists. Although all products are with FSSAI certified labels but when used you can make out the difference. The department has 12 guides who usually wait at the entrance gate and charge you INR 300/- for garden visit and INR 600/- for deep forest visit. But you don't get any receipts. They also lure the tourists in the pretext of selling essences of pine, nilgiri and eucalyptus. Not sure whether this is allowed by Government tourist guides. Ideally there should be outlets with good quality products for such items. The deep forest visit is worth of one hour to know about medicinal values of trees, herbs and shrubs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r652721908-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Poorly managed, no sign boards", "review": "We have visited this place while returning from Ranikhet to Delhi. We wanted to have a quick look at the garden but you cant see anything without a guide. there is no sign board and no clear passage for garden from entry. Finally we could not see anything.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r637150287-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Little trek in the gardens and forest of chaubatia.", "review": "We took the garden tour with services of guide Mr. Deepak Bisth. Showed us Pine, Cedar and Oak trees explaining their features. One can see the dense jungle from here though we didn't take the jungle trek highly recommend though if you have time. Had refreshing rohendroon juice at the end of tour. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r641112150-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "aka Apple Garden", "review": "It is a 1 km walk to this garden, which comprises of fruit plantation. Only attraction here is  a store selling locally made products like squash, jam, chutney, etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r587192213-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A visual delight", "review": "This is a govt. Orchard. It has a sloping path around the hills and a gorgeous view of the terraces. A full round will probably take about 2 hours. We just went part of the way and came back. Not recommended for people having knee problems or trouble walking as the stairs are quite steep. We did not go in apple season so the apple trees were all covered up. They also have a small shop selling locally produced juices, chutneys etc. Which are quite tasty. For 10rs per glass they will mix u up a fruit squash for tasting. I particularly liked the litchi. You can also hire guides for a walk of the garden or a hike in the nearby forest. Their rates are fixed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r588298398-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Its quite huge!!!", "review": "Must visit to enhance your knowledge on trees and fruits. It also gives u a beautiful surrounding views of Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r586560414-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Refresh mind & spirit", "review": "A temple with a beautiful story to go with it,and a garden which makes you want to give up city life and become an organic farmer. Must visit places in Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r586233490-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "A Garden View", "review": "The Visit was a bit disappointing. The walk through the Forest and to the garden is not very comfortable. There is not much to see expect some Apple Trees which were covered and some Flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r592049756-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Nothing much to see", "review": "Has lost its charm and  apple crop. Monkeys confront you as you walk through the Orchard. Guides fleece you for doing nothing at all. Give it a miss. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r592627074-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Must visit", "review": "Chaubatia Apple Gardens are a must visit place if you are planning to visit Ranikhet. Spread over more than 100s of acres, it's a part of bigger and denser Ranikhet range of jungle. Start early in the morning, take a guide (charges ₹200 for almost 2 hrs walking tour). You will see a variety of trees and many breathtaking views of himalaya. Apple, apricot, almond,....So many herbs too. You can buy fresh fruits, spices, juices and herbs from Govt owned fair price shops on returning.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r594167336-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Be careful with Guide", "review": "Most of the Guides are fake. They will take INR 300/- or 600/- for a just 1.5 km trek as part of Wild Adventure trek. They don't know much about local flora and fauna. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r549424675-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A fantastic place.", "review": "Was privileged to have spent a couple of days at this superb cantonment hill station. Great views in pristine surroundings made this one of our best holidays.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r596253116-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Only go in apple season", "review": "In apple season you will get apple there. In other season you will get nothing, only dry apple trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r550409286-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Excellent Place to visit", "review": "If you like the flora ~this is the place to visit - be prepared to walk up and down over a KM at least. it could be tiring  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r598076499-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Part of Ranikhet tourist circuit", "review": "This is a horticultural garden where various fruits are grown especially apples,pears.This garden is part of tourist circuit  of Ranikhet and falls under Ranikhet Cantonment Board.It is full bloom in summer with fruits hanging in month of august and september.The garden is surrounded by forest and the trail leads to a dam.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r570472924-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful Garden", "review": "Visited during non apple season, so could see only apple flowers, but still its enjoyable location to see apple trees which are located on hilly area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r570656049-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Ordinary garden ", "review": "Since years I have heard about this garden that it has many variety of fruit trees. I visited Ranikhet specially to see this garden but I found nothing special there. Season may be it’s reason. But we got to see few fruit trees only. With small fruits on them. Small apples which just started to grow and small lemons. I wasted my day on it. I will suggest not to go to this place in a month of may. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r585677350-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Beautiful place spoilt by humans", "review": "I have visited the place multiple times and at different times of the year. It used to be a beautiful place which has now been spoilt by the people visiting the place. The fruit trees are unkept, the flowers are scanty and there are packets of chips and empty juice packs scattered at places. Had the place been kept tidy, it would have appeared far better than what it is now. Still it is place which can be visited for a walk in the fruit orchard.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r578029205-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Chaubatia Gardens", "review": "A must go place and feel the ranikhet valley beauty and for sure a walk in the hills is very refreshing. For kids it's a unique experience to see the variety of flora..apple trees and flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r582792605-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Great views on a clear day", "review": "You may get great views on a clear day from Chaubatia gardens - we had only nice walk around the field. Please note this area is under military control.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r583599040-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Excellent Orchards brings you close to nature", "review": "Chaubatia gardens are multi fruit Orchards managed well by Army base, beautiful flora and fauna, walnut, apple, almond and peach tress, lily gardens, credible walk through the forest, guide helped us to know the place well. Guide is must to explore, A must if visiting Ranikhet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r504979538-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Morning walk in chaubatia", "review": "It's very beautiful garden near Ranikhet Cantt area. I started my morning walk from Alka hotel went to there to see the morning beauty of this garden. It's perfect place to entertain with friends and family too. There were some trecks as well where you can treck if you are crazy for trekking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r585435541-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Good for enjoying natural beauty ", "review": "The garden is well maintained and the guides are also interactive and good natured. The path can be tough for old people or people with arthritis as it has stairs and steep slopes. Other than that the experience was good. There is a canteen also there which offers decent food. And juice stands which offer refreshing juices. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r586090951-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "a must visit with a guide", "review": "we visited this for almost few hours and it was the best part of ranikhet trip , and dont go to forest without local guide otherwise it will only trees and bushes for you . lots of knowledge can be gained there and be alert when you exit some guys will come to you to sell you some natural herbs but they are not worth it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r510811445-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Waste of Time", "review": "No need to go. Simply waste of Time. Apple Garden was empty as there was no apple season and no other things to see in garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r529480484-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place to visit", "review": "This place is very near to Jhula Devi temple. Managed by the Govt, this is an apple orchard spread around 265 acres of land. If you want to visit this place take out good amount of time and do hire a guide. When we visited this place, apples were already plucked out. Hence, the trees were bare.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r530415007-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Damp squib", "review": "The flora at HolmFarm Heritage where I was staying was much better than Chaubatia. This place is O K for those staying in hotels in city. Nothing extraordinary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r530856556-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nice garden: must visit in Ranikhet", "review": "Chaubatia garden is located very near to the Ranikhet main town. One can enjoy the plantations there along with the beautiful green valleys and mesmerizing hills. Also there are several flower gardens.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r533646761-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nature on height", "review": "Chaubatia is famous for its apple garden on the highest point of Ranikhet which gets maximum snowfall in the area in winters.If you are really seeking nature then you must come here in the lap of natural forest on the top of queen of kumaon hills, Ranikhet. Chaubatia is the crown of the queen....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r539444510-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Better hire a guide ", "review": "It wasn't Apple's season when reached here. So couldn't see much. It's a vast place should hire a guide to take u through deep Forest. Better to visit in season when u can see Apple's n all.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r532611829-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Very basic jungle ", "review": "It's basically a poorly maintained jungle which once upon a time may have been a garden. The army guard stationed at the gate told me himself that he was surprised people come to visit. BTW need to submit ID like driver's licence at the time of enterance at army encampment/gaurd. Don't spend more than 20mins. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r542106453-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Abode of Gods with take your breath away", "review": "Chaubattia (height of around 7200 feet above sea level) located at around 10 kms south of the cantonment town of Ranikhet. After visiting U.S.A. and many countries of Europe that includes Switzerland, I can confidently say that it is undoubtedly one of the most beautiful places in the world. It is famous for its apple orchards too. In Chaubattia sighting a tiger at the back of your house was a common sight and hearing his roar was an everyday affair. Once a tigress walked for around 100 metres beside us as we slowly drove our car in route to Chaubattia. There was just a car door between us that prevented me from jumping on my seat but still it was scary yet most thrilling experience.  Miraculously, there has not been a single incident where the fierce cat harmed any human. People there have deep faith on JhulaDevi (Goddess Durga) and there is a temple called JhulaDevi Mandir where they religiously bow.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r547781901-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Not impressed", "review": "May be mid of June is not the right time to visit orchards, but still it's a shabby place with bad guides. It can be avoided.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r493902055-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nothing Exceptional", "review": "Nothing exceptional, bit over hyped. Best part is actually walking up till the garden. Over crowded with cars and tourists.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r500571797-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Apple and Plum Orchards @ Ranikhet", "review": "Huge terrain full of apple , plum orchards. many herbs and medicinal plants all around. the entire area can be covered within 2 hours. There is a refreshment point. Please do not forget to carry a document as a proof of your identity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r495078523-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Best place for photography", "review": "We visited here in June and unfortunately we could spot Apple. Hardly we can see green Apple on one tree. This space is best suited for photography as view was ultimate here. It attracts the people who loves nature. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r496209367-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place!", "review": "We visited government apple garden and Jhula Devi temple. The apple garden is very nice place with beautiful views. It requires walking about 1 km in itself so elderly people should avoid. You can see beautiful flowers like torch Lilly and other, devdar trees, walnut trees etc.. Local food corner available but substandard food quality.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r499705520-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "An apple orchard with nice view.", "review": "The place is developed by govt of Uttarkhand and in Military Cantonment , you have enter restricted area with permission of armymen. The place is very big( if you are interested in jungle trail). But for us with a young child, we went for garden tour only( most of you will agree on this only). We took a guide ( will advise  if you want to really understand the place) which helped us with some good photography too. There were net covered apple trees, local fruits - apricot, Chestnut, green almond. And yes Devdhar and Pine trees too. There is a nice view of Himalayas and on a clear day , you may get view of whole Nanda Devi Range. There is small garden at top with white and pink Lily and water Lily too. Enjoy the beauty with good garden trail.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r500076703-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Apple Garden", "review": "Got to know about many plants & trees from the guide we hired. Very knowledgeable place to visit with family. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r495653128-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Drive through ", "review": "This is an army cantonment and not open to public. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r502344778-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place, good attraction near Ranikhet", "review": "This is very nice and well maintained garden, a sort of orchard. Full of variety of trees, flora and fauna. It is more famous for apple trees. It is a wonderful experience to walk here.  Worth visiting. It is recommended hiring a local guide.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r487561728-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Pristine.....", "review": "Worth spending 2-3 hours...You can start from the conventional starting point or also can go reverse way - which we took.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r490690594-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Paradise Lost", "review": "I have lived in Ranikhet from 1972 - 1975. What a glorious garden Chaubatia was. Full of fruit trees. Plum, Alexander Peaches, Apples of many varieties and even Morello Cherries and Apricots to name a few fruit trees. Now the garden is in ruins all the old fruit trees are dead. It is so sad . The Uttrakhand Government must take step up and take steps to rehabilitate this garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r492897025-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A must visit place...", "review": "This is not a regular garden where you will find meadows but it is Asia's largest government botanical garden. One can see the variety of medicinal plants, and fruit plants of different species. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r489985378-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Scenic Orchid", "review": "Beautiful scenes of orchids. Trek around the garden, see the greenhouse, know about different trees and plants. When we there it was drizzling,so it was more beautiful n relaxing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r491144770-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Ranikhet's best attraction!", "review": "This place is one of the attractions of Ranikhet tourism & is very well maintained. This area comes under Ranikhet cantt & the army check post keeps original id proof to be returned later when you go back. While coming to this place the highly revered & prestigious Jhoola Devi Temple comes as a surprise as it is also main attraction of Ranikhet. Chaubatia is situated at the high mountain & views of Himalayas are stupendous from here. Mount Trishul is seen in full glory & might along with other peaks like Nanda Ghunti & Mrigthuni. This place is actually a botanical garden where hundreds of varieties of medicinal, fruit & other plants are researched & grown. It is like roaming into a very beautiful big garden where a lot of gardeners working all around. Fruit trees of apples, apricots, Kafals (local fruit), Peach, mulberries, plum etc are found in abundance here. Inside a shop is there where fresh fruit juices, squash, jelly's & jams are sold fresh at a very less price. This place I believe is the best garden in Uttarakhand where so much variety of trees & knowledge is available. Must visit while you are at Chaubatia!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r493000222-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Fruit orchards", "review": "Chaubatia is 10 km from ranikhet in army controlled area, so ID is must. This is fruit orchards spread over few km. From Jhula Devi temple to chaubatia -10 km Thick forest road will enthrall your journey. Luckily you can spot some wild animal on the road also. The adventure seekers can take the jungle trek which is a thrilling trek thru thick forests & if lucky you might spot wildlife. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r488232361-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Botanical graden", "review": "This place is a botanical garden where you can see large variety of medicinal and fruit plants of different species especially apple trees. It is very well maintained. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r491490603-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Beautiful landscape", "review": "Worth a drive up. This is a must-see in Ranikhet. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r456794055-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "If only u like trek", "review": "There is a long long trek around the garden with plantation and villages around .At the entry gate there is a shop wherein you can buy local stuff sweater ,hat ,gloves and pickle and local masala and juices", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r461355592-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Rather a damp Squib", "review": "The walk is nice, but the fruit trees are almost missing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r493417270-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Chaubatia Garden", "review": "It's around 9 kms from ranikhet in cantt. area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r468630640-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Beautiful place but needs to be visited only in spring season", "review": "It is an apple garden and a forest walk attached to it. You can get a guide for 500 bucks and wouldn't miss any spot on the trail.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r452049769-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "TOTAL waste of time", "review": "if you are a tracking person and love this adventure then should go otherwise its very far off from entry point and a total waste of time if you are unable to walk till the end ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r493227183-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Walk in a wonderful garden", "review": "Be sure to obtain a guide and go for a jungle walk also. Bhalu dam is located some distance away. It's advisable to wear proper footwear and avoid littering the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r479752342-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Largest Government garden", "review": "A very large garden with several plantations of apples, peach, plum, apricot, etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r464285580-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Good for long walk", "review": "The best part is you walk through the green. It feels like you are in one never ending garden with trees and lots of greenery all around and you can keep walking. There is very little chance of getting lost as there are enough workers in the garden and they'll guide you if you do get lost.  Did not sight apple laden trees though.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r414425052-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "wow...jaw dropping landscapes and views", "review": "sprawling with plants and trees...worth a visit..it has something for every age group...you can go deep into the forest as well...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r479883845-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Damp Squib, pretty much", "review": "Not a lot to see if you have been through Mukteshwar. Didnt see any point in going all the way to just look at few orchards and apple tress here and there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r413363584-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Go for Jungle walk", "review": "Must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r487351493-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Quite famous as the Apple garden!", "review": "Having deposited the Id to the Army at Jhula Devi temple, we went to Cahubatiya garden, It was worth vising there. We had natural bottled fruit juices as the refreshment shop over there and also bought pickles from there. You should have 2-3 hrs to visit the garden properly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r480001586-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Waste of Time", "review": "It is complete wastage of time to visit in Sept - Oct as it has only dry trees... Best season is in May June when you can see fruit on trees...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r415567713-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Lovely walk in a beautiful orchard", "review": "A lovely walk through beautiful trees and flowers. Stop for a rest and sip some juice at the sales counter with a lovely view of the entire orchard.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r424927016-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "no sense", "review": "a long walk at the place to see only some of apple trees is non of any sense.Just a waste of time.One thing which is good is the variety of pickles and jams can be purchased at there", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r430485142-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "When Orchards are empty trek in the Dense Forest", "review": "Take a guide and a trek into the Forest if you arrive after September as there will be no apples in the  orchard  and can trek up to Bhalu Dam", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r432939682-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Over hyped", "review": "It's better to skip this place in October as there is nothing to be seen in the orchard.The roads leading to Chaubatia are scenic. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r435485587-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place but with no apples", "review": "Chaubatia Garden was famous for Apples but now you wont find any apples.But dont get disappointed its a nice place to visit for trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r429670697-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Would ne nice in winters", "review": "- Nice and huge apple garden. Visited in winters so not much plants with apples. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r446443129-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Good for One Time Visit", "review": "It is not a great garden with lot of different plants and flowers.. Trees in Apple garden were closed with nets to avoid plucking of fruits.. The toilet is patethily maintained. there is government shop that sells juices and pickles and the prices are decent.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r391955346-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Not just the apple garden", "review": "Chaubatia is more than just the apple garden! Its a scenic little village with some beautiful trails around the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r388953533-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Season for Apple orchid to blossom is Aug", "review": "The trees were all drained of leaves and not much to see. The shop there at the end Himalaya products had good apricot chutney and juice must to buy due to great taste ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r448845094-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Orchards and Flowers", "review": "It's one of the attractions in Ranikhet. You can get to see a number of fruit trees and flowers here. You have got apple, peaches, plums, apricot and many others here. It also have got very beautiful flowers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r392715422-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Good to visit once", "review": "It was a nice walk through the garden with various species of fruit and flower trees. recommended visit during summer if you want to see the ripe fruits", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r394575801-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Could have been better organised and maintained.", "review": "The place is a Government maintained garden spread over 6oo Acres of land. It showcases the Flora of Kumaon region and you will get to see large variety of trees, shrubs,grasses and herbs in the area. You need to take a guide at the entrance of the garden if you are interested to know the details about each types of plant there and their medicinal usage. The place is infested with monkeys and entire effort of the staff there seems to be focused on saving the fruit bearing trees from them. Saw nylon nets wrapped around apple trees to protect them from monkeys. The Guides there would try to lure you in buying medicinal herbs from them. Do not get trapped. It is amongst very few places of interest in and around Ranikhet hence you should visit else just chill in your Hotel rooms.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r395314096-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "beautiful garden", "review": "This place is beautifully maintained, with apple trees, flowers and many other trees and shrub varieties. It's exciting for kids to see how apples grow and how it look like seeing them hanging from trees. a must visit when you are in  and around Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r397788194-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Chaubatiya visit", "review": "In peak season of June, there are many good options in Himalayas. If someone goes to Ranikhet, Chaubatiya is one of the attractions having orchards and dense forests. one should not miss this place while around this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r397234293-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Please dont waste your time here. ", "review": "This place is not at all worth visiting. There is nothing to do or rather nothing to see here. We were unable to see a single apple in here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r408494531-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Lovely place", "review": "Full of apple trees chaubatia is a nature lovers delight. There are hundreds of Apple trees laden with fruit  -  a sight i have nit seen elsewhere. The view of the himalayas from the  chaubatia garden is excellent. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r412360921-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Not a good option in Aug-Sept", "review": "- This must be a good garden in season of Apples. But could not find anything interesting in this season, when all the apples are plucked.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r412326954-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A different experience ", "review": "Around 1 km Walk through forest with fruit gardens. One can see apple trees,  almond tree,  walnut tree, apricot tree,  and other varieties. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r382519206-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "natural beauty", "review": "A one should go to rejuvenate them self and feel the freshness of the surrounding. See the plums trees, apples and flowers. Have the adventures experience of forests and all..  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r382149301-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Apple garden full of flora", "review": "We visited this place with a group it is a trail you walk down for around 300 feet viewing hilly flora and a garden with Apple,apricot and plum trees ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r383871807-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Fruit Trees at Chaubatia", "review": "Visited the Apple Graden at Chaubatia.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r385156078-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Govt garden", "review": "Its a very well located big garden with lots of fruit and flower trees. You can buy local juices n jams from there. One need to walk to explore the whole garden..Heard the views are amazing from here, couldn't get one from here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r385243846-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "It is 15 acres fruit orchard.", "review": "A Must visit place for nature lovers. It is a beautiful place with fruit trees and you also get to see herbs growing in natural surrounding. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r386283654-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Wonderful Wilderness", "review": "Chaubatia is a lovely piece of wilderness filled with medicinal trees and is a horticultural treasure trove. We walked through the forest area with an excellent guide and was thrilled to discover some unknown facts about trees and how they help us sustain life. Walking through the Chaubatia freshness was a mindblowing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r385143861-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Great Views - fruits and flower garden", "review": "It turned out to be better than we thought -with great views of orchards and fruit trees. We drank fruit juice and bough burnash juice for home too. Lovely track. Must visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r384800605-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "nice place", "review": "take a guide as he will be able to give you a good information on the flora. nice apple trees and other plantations. a must visit place", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r375839190-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Nothing really..", "review": "Nothing to see there ....apple trees are covered with some nets for protection. Just like a forest. Nothing appreciable there. Guides misguide you with some jadi booties. Do not buy they at all.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r386945357-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "ORCHARDS AT CHAUBATIA", "review": "Well spread out, government owned, well maintained orchards. The variety of fruit trees is quite large with many different varieties of apples including FUJI etc. But a few points to be noted. Though the nature view is great, the up and down incline is quite steep. On exit route there are stairs laid out, but the steps are very high and therefore very troublesome for old and very young visitors. An overall good experience if you have no knee problems and can walk a good deal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r376637653-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nature's grace", "review": "Very peaceful and greenish place. A very live view of the great himalaya Interact with nature, many fruit. plants like plum, peach, apple, chestnut, almond. You can get pure fruit juice at the entrance. I suggest buransh juice a must. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r377678410-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "lovely informative trek!", "review": "This is an amazing place. We had a nice trek in the forest/orchard there with our guide who was really good and we did end up learning a lot. I think the most memorable part for me was when he showed us a carnivore plant which was still digesting a worm!! If you have oldies in your group then this is NOT the place for them as the climb down and up is pretty steep....but people with relatively good fitness can do this trek quite easily. Also buy their preserves from their special shop there...honey, apple jam and rhodo juice is yum. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r378136331-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Charm informative ", "review": "Visited this nice place with family...in fact the majestic view of this pretty charming garden could well be relished in winters or a bit clement weather when the flowers and variety of numerous fruit trees are laden with specific species. ..However the wide range of fruit trees spread in thousands of acres speak volumes about the chaubatia garden...hire a guide to get all useful information regarding the medicinal value of plants falling en route journey into garden and collecting information regarding various fruit trees...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r378951271-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Didn't like this place", "review": "Few apple trees and apricot trees...not worth watching. Guide is must which is totally unnecessary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r381013648-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A field Day ...", "review": "Me my husband and my 7 yr old daughter visited Chaubatia, Apple Garden . It was a field day all the way... There were fruits in almost all the trees which made my daughter very happy. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r379305512-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Rustic garden", "review": "The tour of the orchard entailed a walk over rough terrain to see a wide variety of Himalayan fruit trees, especially the apples. Our guide made the hour-long botanical tour very interesting. It was exhausting but good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r378586422-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Fruit Garden Chaubatia", "review": "One time visit place but not that good. Just walk around and look fruits hanging on trees and some medicinal plants, and at the exit you can buy some fresh fruits at very reasonable price. My suggestion is to take a guide along with you to enjoy it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r388054949-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Want to visit this terrible place ?", "review": "Was excited to see this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r381071324-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Awesome Experience", "review": "If you are a plant lover like my father you would fall in love with this place and if you are not a plant lover like me, you will watch the place in amazement with you jaw dropped during the rest of the time spent in that place.Choose  a guide, no need to be costly like the 700 rs package but at least try to hire him for the forest show because you would learn some awesome things which is impossible without a guide.   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r366741840-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A Fun Learning Experience", "review": "We visited in April so the apples were not yet ripe but other than that there are variety of plants and trees you can learn about. Do take a guide with you, it helps to know about local flora. A good way to feel close to nature and learn about indigenous floral species. Must visit !", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r363561341-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Must come here", "review": "Chaubatia is a govt Apple orchids where number of research made on New variant of Apple through hybrid process. Myself and children have gained knowledge about all though a local guide Mr. Umashanker who explained is in proper manner. Every one who are visiting here in Ranikhet must visit here with one local guide to make visit fruitful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r381259943-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Must see", "review": "Kids love this place with a walk in jungle is must. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r368901741-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Good but April/May is not the time to see", "review": "The place is in Army Cantonment area and is known for Apple garden. There are guides available for Rs.200/- but you really don't need them. Though april is not the month to visit as the fruits are very small and only in bud stage so its difficult to make out, nevertheless the view is excellent from the gardens. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r366232649-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Muskhil Waqt Rhino Sakht", "review": "Ranikhet is a must visit from Nainital. Its enroute to Kausani. The greenery of this place entices ones mind and heart. A view of the Kumaon Regimental Center with its moto \"Muskhil Waqt Rhino Sakhth\" widens our chests in pride for the brave soldiers of the legendary Kumaon Regiment who have been defending our freedom with their blood. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r373071130-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "The only place worth visiting in ranikhet.", "review": "10 KMS uphill 2 ranikhet were dese beautiful gardens which wre once made by d British n now boast a beautiful view in d ranikhet army cant...its worth ur tym only if u r a lil active...its a walk..actually a mind soothing walk through d gardens...to our help der r many restaurants and juice shops in d way...beautiful himalaya peaks r olso visible during d walk...so overall its a gr8 way 2 cherish our nature...best tym 2 visit is d spring season though dres nt much prob in visiting at any tym of d year...keep travelling.. manav!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r374398426-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Good", "review": "Nice place to visit. Better if visit in winter season.When we went there there was nothing to see.So we were disappointed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r375399932-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "good in month of june when trees ae blossomed with apple and other fruits", "review": "shuld take guide he gives good information. buy apricot juice and apple chutany from here. burnash drink is also good there. 15 km away from ranikhet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r375057373-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Even in winters,  this Orchard was worth a visit. ", "review": "Although we went here out of season, and the Apple trees were bare,  there were some amazing views,  as well as great info about the medicinal plants and perennial trees. I definitely want to return here during the season,  when the fruit bearing trees are in full bloom.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r337627026-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice Picturesque Location", "review": "This location will sure add some mesmerizing snaps to your Photo Album..You may skip the guides there & opt for a self walking tour. There is a government run \"Food court\" inside, which offers decent meal at economical price. It is barely 100 mtrs if you walk towards the right side from the entry point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r374385400-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice", "review": "Chaubatia is an Apple garden and situated at the top of ranikhet  it is approx 8-10 km from sadar bazaar and scenic place ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r349604118-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Orchards...", "review": "We visited Chaubatia gardens twice once in Dec when all fruit trees had shed leaves..and again in April when you can see buds of apples, pears etc..but could not see fruit laden trees.. You could enjoy fruit juices from the sale outlet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r347626297-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful mountain views,unfortunately,the apple orchard was barren in December", "review": "There are locals who double up as guides.You can take one,he will explain everything about the apple orchard for Rs150.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r338872192-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Best place in Ranikhet", "review": "Best scenic location in Ranikhet very near to nanital and almora  and definatly must visit in Ranikjet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r375468849-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Calm, serene and beautiful", "review": "Chaubatia has avery famous apple garden. The route from Ranikhet to Chaubatia is very beautiful. Since this is a cantt area, there is a totally different feel to the every thing in the area. The place has been maintained very well and gives hat old era feel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r338072510-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "You Can Skip Chaubatia if you are in Ranikhet", "review": "Chaubatia garden which is situated in Ranikhet is actually not in best of the condition. I visited it in the Summer of 2015. The way to chaubatia from Jhula devi mandir in beautiful , However you can avoid it if you are running short on time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r355592508-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "National botanical garden ", "review": "You can see different type of fruits as well as different type of preparation of hybrid fruits . here they will explain you how you can grow two  , three or more  different fruits on same tree . you can also view different type of natural flowers , tree , leaves as well as there usage . good for trackers as well view of Nanda devi  Himalayan range is available. Only one thing important to remember go in June - July as  fruits are fully matured on tree . otherwise you will see blank trees there ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r359345835-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice, but overrated", "review": "The gardens are nice, but the pathway is very slippery and dangerous for kids; since the place is promoted as a eco-tourism site, safety must also be ensured.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r360363071-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Awesome surroundings", "review": "Must visit place in Ranikhet. Had visited this garden on winters, so nothing much could be seen except snow.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r319944089-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Quiet and Pristine", "review": "One needs no guide to visit this place. Just get down and walk from your left, take a round, see nature and at the end visit the shops (buy jam honey etc) and come back. If you know the trees its great, if you dont know then too its ok (if you need guide-bargain)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r359941844-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Ranikhet's prime location to visit", "review": "Chaubatia is Garden with dense forest. It has herbal plants, trees, Fruit orchards and many more. I love this only place in Almora district where I wish to return again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r317907043-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Apple orchards", "review": "We were unable to see any apples in the orchards. If one visits within 15th August one can see apples. None the less the place is very beautiful inside dense forest. One has to enter into the army zone, hence all details are recorded at the check post. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r320554360-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Good for jungle trek.", "review": "This area had apple orchard with lots of other vegetation. But very seasonal. But opt for the jungle trek and this one is awesome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r322605874-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Amazing Place", "review": "Must visited place to see the various plants, to know their uses and to see how grafting and budding is done. Definitely need a guide to visit the Orchard. Rate for guide starts from 200 for Orchard garden visit, 400 for Dense Forest Visit, 700 for Bhalu Dam Visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r359435294-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Cahubatia Gardens", "review": "Located about 10 km from Ranikhet, this place has plantation of apricots, peaches, chestnuts, and almonds and is famous for apple orchards. With a wide variety of Himalayan flora, it also offers the picturesque views of snowcapped Himalayas. Apart from fruits, one can buy fresh juices and artisan honey from the garden store on the way out.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r321104785-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Pointless in the wrong season", "review": "Visited in October last week - mind you this is out of season for the place. And good lord - the place was terrible. Well, what do you expect from a grove in the off-season where there are are only bushes all around and not a single flower or fruit to see. Other than the flowers/fruits, there is absolutely nothing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r321523348-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Apple Orchard!", "review": "Chaubatia has awesome views.. had it been a little more green.. it would be a perfect sight! No apples, no greens.. yet, the place was lovely. :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r330865280-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Its good", "review": "Its good and beautifull. Kids liked it and enjoyed a lot over there. Provides good sight and is enjoyable. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r328914477-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Chaubatia Garden- a must visit place!", "review": "Good Place to enjoy the nature! Also if you visit the place during june mid you can see apples,peaches etc. There is also a sale counter which sells freshly plucked fruits from the garden. A must visit place if you are going to ranikhet! As it involves walking a lot it might not be suitable for small kids and aged people!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r288728330-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Dec 2015", "review": "Very green, but December is not the right time to visit. markings on trees are missing, the local guides are out to fleece customers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r335339374-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Botanical garden at Chaubatia", "review": "There is a vast orchard of defferent fruits like apple palm etc. It also has some forest area . One has to hire a guide to visit this place as visiting the forest alone is risky as you may be lost . here and also forest area .  It has a juice shop having juices made of these fruits just when you enter . We purchased many bottlles of juice for us and for friends.They were also letting us taste the juice.In may the fruits were very small .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r333460418-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A beautiful experience", "review": "The Chaubatia orchards are a vast expanse of various fruit gardens. It is very picturesque as well but make sure you travel during sring to enjoy the beauty to the fullest. Also dont forget to buy the local squash and pickles from there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r288783473-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Visit to Nature", "review": "I think, this is Apple Garden area. It's good to visit this place with local guide and he will give very interesting information about local plants, herbs etc. Also they sell fresh juice, jam etc. Good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r303628826-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "great garden", "review": "totally loved it. nice garden with lots to learn about plants and trees. take a guide though. has a few stairs as well. so might want to reconsider with elders.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r308971381-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Garbage dump ", "review": "Sheer dirt around you one doesn't understand what's there to see or enjoy. Why can't the authorities put some benches for visitors to sit at strategic points where they can enjoy the nature, sip a cup of tea or coffee, grow some tree flowers and make the place a picture postcard.  I don't understand are these places so dirty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r305014630-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Truely a Queen's Meadow...", "review": "The journey to the place from Nainital was very tough.... the roads were so good.... but the journey was very tiring... But once there.... u r enthralled by the beauty & the charm of the place... what a climate.. very cool... It reminded me of Patnitop.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r308566495-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Great park well maintained .", "review": "Great park  beautifully maintained with flowers and greenery . Its a good adventure if you wish to visit the Bhalu dam as well as it  is around 2.5 kms trek from chaubatiya. All in all a must visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r316015756-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Green and peaceful", "review": "this is a really beautiful place in Ranikhet and gives majestic view of the hills. must visit. you can see a wide varity of the fruits trees here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r317785749-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 1.0, "title": "Zero Sum Experience", "review": "There is nothing left of Chaubatia fruit orchards, period. If you are serious about seeing anything of interest or experiencing some peace and quite, this is not the place to look for because you will end up cursing yourself for the time and effort wasted reaching this place. For the reasons unknown all the apple trees are dried up and there is nothing to see or experience that is not available elsewhere in Uttarakhand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r316234371-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice attraction!!!", "review": "Though Ranikhet itself is full of natural surrounding views, but chaubatia is a manicured garden in natural heaven!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r311701033-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "good time pass", "review": "Chaubatia is a botanical garden and one can see various fruit bearing trees and other flora over here. It also offers some nice views. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r283811241-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Apple orchids.. time waste", "review": "No point visiting this .. nothing to see just a walk which is tiring. Yes you can buy good natural fruit juices, jams and pickles.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284083116-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Must Visit", "review": "Nice place to visit!!! Like the eateries and disliked the garbage, which people throw at the vicinity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r285242034-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "good place to visit", "review": "very good location, right in mid of jungle, beautiful view from the location. Awesome fruit's trees to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284617974-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Good scenic place but ill maintained", "review": "It's nice scenic place full of greenery. however,it's upkeep and maintenance needs drastic look at.Entry is army secured but inside is thru local tourism department. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r285820775-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Worth visiting", "review": "Worth visiting Chaubatia for seeing lots of herbs and apple garden. Really enjoyed the various type of fresh juices available here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284599065-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Amazing & nice palace", "review": "This garden is full of beauty you can visit here with family to spend a spiritual moment........", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284941287-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A good orchard", "review": "It is a popular place to visit. Do not take a full taxi. One can easily use share Taxi from Gandhi Chowk or Mall Road( near Meghdoot Hotel) for Rs. 20 per person. Also visit Jhula DEvi Temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284196192-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Visit to Chaubatia", "review": "excellent place for finding so many varities of trees,birds etc. We enjoyed a lot. We bought many types of fruits and squashes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r280128266-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Breathtaking sight of the valley!", "review": "This garden which is also an apple orchard is just a few kilometers from the Jhula Devi temple...Smell the scents of the forest as you walk down the path leading to the garden and fill your lungs with the pure air. Find a spot for yourself and you can easily sit for hours not getting bored of the sight of the valley. Visit the garden during sunset and watch the sky change colors from pale blue to orange and red giving way to ink black... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r280304704-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful garden.", "review": "Chaubatia is home to apple orchids and other flora & fauna. The walk through the apple orchid is very refreshing, but we visited in June first week it was too hot to walk through. Beside apple, you also get to see almond trees and different types of flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r281284220-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Chaubatia garden", "review": "An absolute delight to nature lovers. Enthralling beauty and extremely informative. A visual treat and visit to d dense forest is must but with a guide. Kids also had a whale of time :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282619709-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Garden is a must visit", "review": "The only atttraction is the Garden. But that too is not the same as it used to be 20 years ago. The area is maintained by the Army hence  the only good part to go to Chaubattia from Ranikhet is the drive. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282294086-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Place to visit if you are nature lover", "review": "Good track inside the Apple Orchid. Liked the Litchi and Buransh juice sold at shop near the Apple orchid. However the taste of packed contained (which we brought from the same shop) was not good. It seems too much of preservative has been added in the packed juices.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282039511-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Terrace Garden", "review": "Nice Terrace garden here", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282020143-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Apple orchards & gardens", "review": "The place is known for its apple orchards & other fruit bearing trees but you need to be there at the right time which is aug-oct when the fruit ripens else you'll end up with merely the orchards without apples. There are govt run shops selling fruits at reasonable prices. There are guides available but they charge too much and its difficult to bargain bcoz they are a union type. Still you can try your luck and once again be careful , there are lots of monkeys. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282626309-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "must visit place", "review": "wow!.chaubatia is govt. owned \"orchard\"jungle-it is actually not an orchard it is very very wast agriculture site,you can imagine the maintaince of the orchard-govt.style.but do visit the jungle trail-avail a guide Rs.250/- near the parking stand and be careful about the dangerous trees/plant which the guide will caution you about do not take any chance definitley they are dangerous plants your whole trip mood will be spoiled once in the jungle it is awesome dedicate minimum two hours for the jungle trail-the initial 50mtrs or so are not in proper shape but once in the jungle you will forget,and enjoy,the beauty of undisturbed nature at its best.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r284237330-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Not upto the mark", "review": "We were very excited ehile going to the Chaubatia, but on our way to Chaubatia, while talking to visitors returning, we got an overview that this place is not upto the mark. The walking route to chaubatia is very slippery and it is very dangerous. Further, one has to treck around two long kms. on zig zag mountain path, so that when we reach the actual place, we get exhausted. After reaching the garden, we came to know that there is no such thing to see except the certain types of apple trees and some flower plants for which the craze was not much.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r287064051-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Beautiful fruit plantation garden, rich Himalayan flora and a picturesque view of Himalayan peaks.", "review": "About 10 kilometers from Ranikhet and quite near Jhula Devi temple, this is a fabulously beautiful horticulture and fruit plantation garden. A walk through Chaubatia garden shows you plantations of apricots, peaches, chestnuts, almonds and of course this place is famous as apple orchard. This beautiful place offers a very wide variety of Himalayan flora and the guide tells you about so many varieties which one can admire and wonder at the variety nature offers to man.On a clear day one can have a picturesque view of snow capped Himalayan peaks from this place. One can buy fresh juices, fruits and artisan honey in the garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282777117-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Blissful!", "review": "A walk in these orchards is definitely not worth missing. Do take a guide along if you're going for the first time to know about Apple, apricots, peaches, almonds, walnuts and Buransh plantations. After the walk do sit and enjoy juice at the government run outlet outside.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r277509777-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Must visit if you are in Ranikhet", "review": "Chaubatia is a botanical garden situated around 6-7 kms from the city center, this place has lush green forest, sagwan, pine, apple and litchi orchard apart from herbal garden, please take a guide from the etrance as without them it would not be a good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r274951938-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "A small trek", "review": "seems like an overhyped place. maybe the time we visited - it was not the season of fruits. Its a small trek of around 1 km around the orchard where you get to see various fruit trees. The trek itself is an pleasant experience. There are two shops which sell juices and squashes extracted from these fruits. That can be tried.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r278438076-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice garden of apples trees", "review": "Garden of apples trees spread around entire hill. Good to visit during your stay. One got to know the many apple varieties as well as other botanicals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r278431770-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Just Another Govt Run Orchard", "review": "Its just another Govt rund orchard. Nothing special to see here. The only good thing is that you can buy the orchard produce at a very economical price and the juice, jelly outlet offers some authentic produce.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r277808207-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "hyped", "review": "Don't know what I was expecting but it was definitely not a short walk of being shown some trees and flowers. The guide was nice and enthusiastic but was constrained but the so called orchard. Bad facilities. At least expected to be able to taste/buy locally grown fruits/products. A small cafe at the end of the walk     has maggi and rajma/chwal on the menu and some pretty bad locallly bottled juices.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r278457169-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Worth a visit", "review": "The garden is worth a visit as it offers breathtaking views of the Himalayas with Apple , Walnut and Almond farming. Good variety of Flowers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r282946277-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Over - hyped", "review": "Well, as we reached Ranikhet, almost every one suggested to visit this place. I had high expectations from this place. Over-all disappointing as it was too hot in after-noon and with lot of walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r279003537-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "apple garden", "review": "we went to apple garden but this time we did not find any apple there.this is the of session ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r266176903-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Must visit place in Ranikhet", "review": "We did little know about the Chaubatia Garden. It was our hotel owner who suggested it and we decided to visit. And it was really worth a visit. We were sceptical to see charges for the guide. But still, we decided to go ahead and then the information we got in 20-30min walk was just amazing. The guide gave us very good information on trees, fruits and other facts around it which made the walk interesting. The view from the garden was also amazing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r268800740-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Waste of time", "review": "I feel the place is not worth the visit, at least not in April. I could hardly see any fruits or flowers. Its a complete waste of time. I would rather suggest Haidakhan temple as it is  quite decent and the view from the temple is quite scenic. I would rate it as the only place worth visiting if in Ranikhet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r264176097-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A must visit", "review": "Beautiful with a variety of flora ! A guide is a must for amateur nature lovers.It was an educational trip for us because we saw many trees-deodar,weeping willow,oak,pine,etc. We also saw many flowers.Drank various juices like buransh which we had never had before.Absolutely amazing and green.You may also buy fruits and juices or squash there at really low prices.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r279867835-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place", "review": "Its a very nice place with mesmerizing views of the hills and valley. The canteen outside the Orchard, offers very reasonable fruits, which are directly picked from the orchard itself. The road to Orchard is also very good with a lot of greenery. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r278903480-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Botanical garden", "review": "Its a botanical garden about 20 minutes drive from Ranikhet. The same is situated in cantonment area. Primarily its a fruits orchard and can be avoided if you are short of time, visit only in the Apple season i.e. June-July thats it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r268803231-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Nothing to see beside some fruit trees", "review": "Just a 15 minute walking through dusty trek and a restaurant in last. Not much parking space and no need to take a guide as you are not going to study Botany.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r279521946-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful Apple Gardens !!!", "review": "We took a tour of the apple gardens. Although there were no apples but the whole place is beautiful and spread across. The guide was nice and we did see some other fruits.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r268978751-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Drive through Jungle", "review": "The drive is good small sightings of Deers/Rabbits etc are common. Bigger sightings of Panthers, wolves etc is not very often. The Walk through the Chaubatia Garden is good. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r270555862-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Visit during apples season", "review": "Its a long walk if you are interested. Best time to visit it is in July-August when orchard has fruits on trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r237201898-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Apple garden (and research center)", "review": "Visit this place if you are visiting ranikhet from july to september. Visit only if you are ready to spend 1-1.5 hours here. taking a guide is recommended. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r272928016-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Dont miss", "review": "Excellent views from this place. Though garden didnt have much to offer during our time but must be beautiful in winters.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r274580295-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Lush Green Orchards", "review": "The apple orchards are a must visit. Hire a guide to take you on a guided and informative tour of the orchards. Must visit place in Ranikhet!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r273280991-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "for nature lover", "review": "Chaubatia is well forested with Pine nd Oak.no other hill station offersvsuch a grand panoramic view.the souvenir of this place is Rhododendron Squash .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r244355747-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "HERBAL GARDEN...EXCELLENT A MUST VISIT", "review": "Well I visited this place with my friends,its really a unique experience.It consists of all kinds of herbal plants,trees and various other trees. I would recommened every traveler to hire a guide before entering the garden which really helps to know thee detailed information of every plants and trees.Overall the best herbal garden I have ever seen.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r273290661-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Worth a try in Apple Season", "review": "Chaubatia will be in your way to Ranikhet if you going Ranikhet from Nainital so better ask for the directions. It is in the army area so there is an entrance fees to enter in the area. It was a very informative tour for us. We hired a guide available there which was worth of coat and informative. Saw and got to know about a lot of medicinal plants. There is small shop for Juices, Pickles and Jams which is worth a try. We bought few bottles of Rhododendron Squash.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r239490613-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nice place", "review": "The place was a hill-top and also had a apple orchard. The time we visited it was full of snow from a recent snowfall and the place was looking pristine.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r247300911-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Have to see it in apple season", "review": "It's approx 10 Km from Ranikhet mainly famous for Apple , Nature lover have to go there and very famous for picnic spot it's comes under army area, there is some small shops who sells different type of fruit  juices which is pure and fruit jams , pickles also available in shops", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r246301332-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful", "review": "Place is blocked and army allows entry only after depositing some identity document to ensure, people return. Gardens are good and it's produce is available for sale as well. Products are organic and priced appropriately. If one is in Ranikhet for more than a day, he should visit Chaubhatia. It's an additional drive as it's not a through way, but it's worth it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r249374932-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Between the Nature of Fruits", "review": "Nice spot to visit but only during April and May. This is time when we can get fresh local fruits. In March we can enjoy the blossoming flowers. In winter we can enjoy the garden with snow cover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r247195755-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Botanical Garden", "review": "Its a total fauna rich place... u need a guide to know about the plants... if you are not having botanical knowledge..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r217378438-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Chaubatia Garden", "review": "Supposed to be good hen in flowering and fruit season but we went in march where it was like shrubs only. There a local guide are there who takes you to jungle walk or garden walk. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r263739315-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Visit it any time of the year", "review": "Kindly go in case of flowering or fruits season as you'd be welcomed only by the bushes & dry trunks of the trees. We went their in the Feb end week. The places gives you an insight of different fruits, plants, flowers. Also, not to mention its on the hill, so plenty of up & down travel will be their. Take any item from their local shop & also, try different juices available their. Take the guide as they are govt owned.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r256514243-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "More than the Orchids, jungle walk is more intersting", "review": "This time of the year you will view only stems of the tress (apple, apricot, etc). No need to pay the fees (Rs.150) for the orchid walk as you may be disappointed for a 10-15 min week. However, it would be worth to take the Jungle walk (Rs.200--but do bargain) and if you have the whole day best is to take the walk till the dam (around 4 km trek). Jungle trek is light and would take around 1 h (to and fro). Taking  guide is good. After the trek you can have a fresh juice (apple, etc) in the restaurant the snow clad Himalayan mountains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r262252431-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A gift for the Birders", "review": "This is a place where you can find a lot number and type of birds as there are number of fruit trees in all over.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r219943353-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Take the forest walk", "review": "Nov is not a time to visit apple orchards but dont miss the forest walk... its not a wild or deep forest but you will admire the beauty / greenery / woods at this place much more than any other hill station since Ranikhet is a cantonment area, which means nature is in its pristine form.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r227469784-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Not as good as hyped", "review": "Chaubatiya is known for fresh apple and a walk amidst the jungle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r223175524-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Nothing is there", "review": "I have been to chaubatia 22 years back and  i enjoyed the apple garden there . But recently when i was there last week there is nothing . Its  a good place for the natural beauty and photo . Rest there is nothing . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r222836183-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Worth seeing", "review": "Chaubatia gardens is 10 km from Ranikhet above a height of 7000 ft.its a government run Fruit research institute mainly Apple orchard.There are many varieties of apples,then peaches,plum,apricot,cherry,pears,chestnut,almonds,variety of flowers,orchids,trees like oak,pine,willow,Devadar,rhode drown,other medicinal plants.its in 600 acres of land but only a 1/4 is open to tourist.August is plucking season of apples.Step farming is done here.its good to have guide who can explain to you all about the flora and fauna of the place.Picturesque view of the snow capped mountains can be seen on a clear day..at the exit they have a small snack bar com shop where they sell fruits,juice,jams and artisan honey...worth buying especially Rhododendron juice.its good if u can watch sunset from Chaubhatia .Adjacent to Chaubhatia gardens there is a forest through which you can go for trekking and reach Bhalu Dam.thats really a good trek for nature lovers.would advice to carry  water bottle wherever you go...cause u have to walk up and down the mountain", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r225829256-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Must visit if you are in ranikhet", "review": "Chaubatia is basically apple orchids.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r223403403-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Informative", "review": "It was a very informative tour for us. We hired a guide available there which was worth every penny. Saw the apple tree for the first time . Got to know about a lot of medicinal plants. The small canteen over there turned out to be a real treat...we had rhododendron juice and bought few bottles for home. Do give it a try!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r226204359-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Walk around the garden", "review": "Its depends fairly on the time of year one visit here. In the mid of year this a place to visit the so called apple garden, other wise please avoid.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r233920856-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Excellent Plums..", "review": "Worth a visit to look at the gardens. The garden showcasea a mind boggling variety of trees. It also offers a fantastice view of the mountains. Do take a guide for full understanding of the garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r210889792-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Great for Walkers", "review": "Focus on the dense forest walk...the orchard walk is only worth doing if you have children with you, for then they get to see different fruit trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r211786641-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Must see", "review": "Excellent opportunity to get close to nature in the Dense forest of CHAUBATIA, the", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r212977947-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Botanical Gardens spread over the slopes", "review": "Chaubatia is the Botanical Gardens of Ranikhet. If you are staying in Ranikhet do go visit. Take a leisurely stroll up and down the slopes of the gardens. There are a lot of fruit and other trees to walk among.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r211624318-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice roads all the way to Chaubatia", "review": "Road leads to Chaubatia is very beautiful as it passes through cantonment area. You get good view from this place, If you are with kids you can directly go to govt. canteen and little ahead to see just view and save yourself from tracking with kids!  Ask the way to govt. canteen to just see view!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r211446601-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "natural view but nothing much more", "review": "natural hill apple garden.it is asia's big garden.variety type of apple trees here and variety of plant and trees here.2-3 km walking hill path in start to end. avoid garden tracking with kids.u can direct go to canteen.in here many type of herbal plant here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r211621980-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "only for juice", "review": "best part of the place are the flowers and the canteen at the end of the walk u get to enjoy the plce if u have a good and talkative guide with u", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r213015191-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Lovely for a Walk", "review": "A lovely place to walk in - not very demanding or challenging - for that, do the `forest walk'!  The gardens are full of fruit trees, and you could see birds around, if the time is right.  There is a nice restaurant nearby, serving snacks and juices, including the rhododendron juice - in season, I suppose!  Worth a visit, if in Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r212787849-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Delight to Eyes !!", "review": "Lovely, beautiful, charismatic, spectacular view !!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r205975668-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "For knowledge and views ", "review": "This place is basically interesting for the people who want to gain botanical knowledge. Guide will tell you about each and every species of tree and plants grows in hills. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r215482205-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Chaubatia Gardens(Kalika Forest Rest House)", "review": "Ranikhet was a wonderful experience for us. We reached Kalika Forest Rest House, which is 13km above Ranikhet. There are two well-furnished big, warm, double bedrooms with attached bathrooms. Kitchen and kitchen-help are provided, but we are required to bring along our groceries from Ranikhet or Tadikhet village. Each room has its own fireplace and food is cooked on wood-ovens. The Rest House is situated within a dense forest and if you are lucky you may even spot a jungle cat. Close to the rest house(within walking distance) is the famous Kalika Temple, where the faith of the people is preserved by the venerated Goddess.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r216571960-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice place", "review": "A beatiful place and believe each season will have something to offer for the visitor. The place is well maintained and a definite place to visit oif u r at ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r206273751-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Great Place to check and taste fresh local juices", "review": "This place is great if you want to see and taste local fruit juices, jams etc", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r207089980-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "It Gives Insight Into Local Flora!!", "review": "1. It is a government garden that boasts of being largest hill garden in Asia.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r208180782-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Jhula Devi the Temple of Bells", "review": "One of the must do activities in Ranikhet is to drive up to the even more scenic and unspoilt Chaubatia! Enroute do a short stopover at the Jhula Devi Temple. As per the information board outside, the temple was established nearly 700 years ago and locals firmly believe  the 'Devi's' grace still protects their livestock from wild cats which roam around these forested areas. What sets it apart from other such local shrines is the humongous number of bells that festoon it's perimeter wall as well as the courtyard inside. You can find bells of all conceivable shapes and sizes! For a photography buff it provides some amazing shots. The popular belief is that gratitude for any wish granted by the deity has to be expressed by tying a bell and judging by the number of bells this seems quite the right place to make a wish! Even if you are a sceptic like us, go ahead and spend just Rs 50 to buy a bell at the stall outside and tie it to partake of the happy vibes of the place and for the sweet travel story it makes!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r207082011-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "chaubatia gardens having orchards and other plantations", "review": "these are the apple orchards known as the chaubatia gardens having many other high altitude plantations,trees ,fruits also apart from apple orchards, jhoola devi temple is also situated nearby,one of the tourist attractions, you can also purchase juice jams and squash from local shops", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r209095599-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "great drive through the forest", "review": "the forest is great , take packed hot tea or have it there , just get down the hill and listen to the sound of silence.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r209103150-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Below expectation", "review": "Don't go expecting to see a well laid out garden. To my mind it was a waste of time. Very uneven and poorly laid out area. At best it is a good research facility not a showcase for the flora of the region", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r210041984-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Chaubitiya Garden a government operated apple orchard", "review": "Chaubitiya Garden is a must visit place in Ranikhet. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r209269273-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Refreshing Nature trail", "review": "Liked the lovely nature trail through the orchard. Saw varieties of birds & monkeys and plants. In May, we did not see full grown apples but there were many small apples on all the trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r163467254-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A must must visit", "review": "this place has a 365 acres land areas. You will see apple orchards , peaches ,plums and other varieties of fruits . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r163268682-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "excellent trekking", "review": "excellent trekking, views of apple trees and a shop to taste and buy apple juices, jams, squashes, organic products and much more. Good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r209532703-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Beautiful place", "review": "A simple place for people who like to go for a mild trek and learn a few things about the plants and trees of the region. The view is excellent and the garden is very well maintained. The canteen at the top is a bit disappointing because its cramped and has very little to offer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r163100023-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Quiet and Serene", "review": "This place is good for trekking and long walks. There is not much to do except to enjoy the calm natural surroundings. Those who want to get away from humdrum life of city to rest and relax, this is ideal. There is small Ranikhet town near Cantonment where people let out rooms. One can bargain for the rent and stay for longer time. It is good for writers, painters, photographers  and retired prople to spend time amid nature", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r163855204-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "excellent", "review": "Please take a guide as they will very courteously show the place and also educate you on the trees, jungle etc. They dont charge much..just 100 to 200 bucks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r181770862-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Apple Orchard", "review": "This is a apple orchard where the Government of India has a research institute. The sight of the snow peaks is amazing. However a guided tour is provided by Government authorized guides which in my opinion is not worthwhile.(thats my personal opinion). The place is infested with monkeys so please be careful when you move around and take care of your valuables.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r184132768-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "God's adobe", "review": "A beautiful place with the view of snow cladded mountain peaks of badrinath, nanda devi, trishul parvat, etc and simultaneous view of valley...if you are lucky enough you can catch glimpse of tiger walking beside you...thankfully I was in the car :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r175753498-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Ranikhet", "review": "Enjoyed walking on the trails especially the one to Chaubatia.which were there was a helpful guide to show me around. The trails are not to difficult and gives one the chance to acclimatise to the thinner air. Ranikhet is a very clean town possibly due to the prescence of the famous Kumoan regiment who are all very smart and very friendly to speak to when you meet them.   Its possible to be a temporary member of the Ranikhet club for a small fee where I was made very welcome ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r186976063-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nice calm walk in Chaubatia gardens", "review": "This is a nice place to spend 2-3 hours just walking. You can decide to go down a little bit close to Apple orchards. There are also some govt shops selling juices, squashes etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r190688635-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Walk Around & Have fun!", "review": "Take a walk around the apple garden & forest areas. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r133500253-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice place for nature lovers", "review": "This garden has a variety of flowers and fruit trees. Since this is an apple orchard, variety of apples are available. You must visit this place on a sunny day to enjoy beauty of surrounding hills and valley. Not much for kids on account of playing or eating. But still one of the good tourist attractions in Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r188287620-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "botanical gardens", "review": "The road says\"The animals have the right of way\" , saw a large variety of plants, bought some saplings, and fruits", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r135525459-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nice place", "review": "Please budget 2-3 hours to cover it properly. Taking a trek from Hotel West View will consume half a day. The walk is wonderful through quiet road maintained by army in between semi-jungle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r141455589-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Peaceful and non-adventurous", "review": "If you are somebody who like peace and quite do visit this peace. It is non-intrusive and serene. There is honestly nothing much to see except a lovely temple and an apple orchard which too makes sense only if you go in the season when they have apples. We went in October and there was nothing but monkeys - loads of them!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r143739599-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Good if you are nature lover else not a place for you", "review": "lot of bird, herbs, fruit garden in season, forest.. good place for nature lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r142263504-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "The garden with just a few flowers", "review": "Maybe I landed in the wrong season. There were very few flowers. Beware of agents selling fake ayurvedic herbs", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r144526976-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Serene", "review": "nice and serene place, away from the market (which is still very calm as compared to NCR :P) and without much mobile network. We stayed in Chaubatia... KMVN rest house and had a great time. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r142180645-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Exceallant Picturesque Snow capped peaks of Himalaya Range View", "review": "The small hilly town Chaubatia is 10 Kms from Ranikhet in Uttarakhand State of North India.Renowned for its Apple Orchads. It was developed as cantonment during British time,due to its very nice location. There is a nice Botanical Garden at Chaubatia as a centre for horticulture research. . During my visit ,I tasted a special dark red colour syrup,  known as \" Burush\" ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r159088226-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "May be a good attraction;only when Apple trees are in full bloom", "review": "Nobody should visit this place after the apple season(Apri-May to June-July/Aug).I went there in Oct2012 and was really shocked to see almost skeletal apple trees.If at all one  interested in seeing apple orchard in Uttaranchal/Uttarakhand then it's better to head towards Mukteswar. There are huge orchards on the way to Mukteswar from Bhowali.View from the Mukteswar Temple is worth taking the drive up the hilly terrain.I would advise to take taxi if one is not very much comfortable driving at such a height.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r150355749-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Excellent experience", "review": "It wss a great experience. One needs to visit to really appreciate. The orchards are so green- wish we had taken some lunch to have a picnic. will revist definitely next summer. Also, it felt like a perfect day to just listent to the wind and the rustling of the trees and enjoying a quiet walk with my family.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r131871458-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Chaubatia Garden", "review": "Again, Month of may turned out to be a wrong time. No apples, No great view and it was hot to walk around.  If you are too tired dont opt for the walk with the guide. It is long and boring. The view from the edge, next to the canteen was good though", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r130526227-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Apple Orchards", "review": "There are a number oif varieties of apples in this Government run orchard. Take a guide if you want to learn about the flora and fauna.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r130718871-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "A decent sight", "review": "the place has a nice company/apple garden as they call it. A good scenic place, you can see the terrace farming of apples, apricots, etc various flowers for acres all together. They also sell squashes & juices which were really nice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r131877219-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice half day tour from Ranikhet", "review": "The 3 Km drive to Chaubatia is great, with lush green surroundings. A short hike in the orchard takes you to the hill top restaurant where you can sit for some time, enjoy a cup of tea and hot pakoras, with the nice mountain breeze. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r132785929-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Nature walk at its best", "review": "It is better to take a guide with you here. Guides are trained on the flora and fauna and will take you through the orchard as well as the forest. The entire walk will take you around an hour to cover both the areas. Interesting things to see are the 2-in-1 plant, \"bichhoo\" grass, the chestnut & apple trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r132812753-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Awesome treck to apple orchards", "review": "Very good guides with fixed govt prescribed rates", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r133254727-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "knowledge trip", "review": "quite a rocky terrain - be sure to wear mountain boots! This walk is not for the faint hearted - 265 acres of land among rocky mountain high with exotic plants & a cute cafetaria at the end of it serving, among other thngs, Maggi! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r132964855-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Nice walk through apple orchids", "review": "Chaubatia is home to apple orchids and other flora & fauna. The walk through the apple orchid is very refreshing, though not for faint of hearts. Beside apple, you also get to see almond trees and different types of flowers. I'll let pictures do the talking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r133413607-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "A great place to explore", "review": "Chaubatia Garden was a great place to explore. The place exposes you to various kinds of trees- Apples, pine, cheddar and lovely flowers as well as great views too. Our guide told us about the various trees and plants. It’s advisable to take a guide who will charge a nominal amount for their services. You have to walk a lot so ensure you wear comfortable clothing and shoes with strong grip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r599428303-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Scenic and nature at its  best!!", "review": "Chaubatia is situated away from the city. You have to drive for6 7 Km from Jhula Devi temple. drive is through hills and road is narrow and not so good. You can see beautiful views during your drive to this place. Chaubatia is Govt. owned garden of local fruits spread in very vast area.   Park your vehicle and take guide. I advice all visitors to take Guide, he will charge Rs 200/- fixed . Without the guide you will not be able to understand anything. He will tell you so many interesting things which you will miss if you don't hire him. You should be wearing comfortable clothing and shoes for going inside as you need to walk a lot that too on down slopes , steps . Its  like trekking inside. You will see great views and perfect for photography.  A perfect place to see the nature at its Best. You will see pine, deodar, snake plant, Mica stones, willow tree, apricot tree, variety of Apple trees, Walnut tree, Pear tree etc. At this place you can see 200 variety of apples.  Its like trekking inside this place. You will be walking on the Mica rocks. At the end of the garden you can enjoy refreshments also, though the place is not well maintained.  Dont forget to take guide with you for better appreciation of garden.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r599436047-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "A Walk through the mountain.", "review": "This is a Goverment owned botanical garden popular for apples and plums. I lovedthis place. It was green, silent and beautiful. We had to walk inside the garden which was about 1 km and got chance to see closely many unique flowers like torch lilly and ripe plum fruits on trees...walking in those mountain trails felt amazing. This place is a Must for a Nature or Mountain Lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r608355725-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "apple garden and forest trek.", "review": "poor maintained, ill marked, no guidance. no parking. roads also not repaired. only little bit maintenance is due to location in cantt.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r618672467-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 2.0, "title": "Poorly managed, no sign boards", "review": "We have visited this place while returning from Ranikhet to Delhi. We wanted to have a quick look at the garden but you cant see anything without a guide. there is no sign board and no clear passage for garden from entry. Finally we could not see anything.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r637150287-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 5.0, "title": "Wonderful gardens with lovely views !", "review": "Chaubatia garden is a wonderful sloped garden, with tall trees to greet you, numerous flowers and fruit trees to welcome you, and views of Himalayan peaks to wow you ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r616421423-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Nice garden, shady guides", "review": "The garden was quite lovely when I went, which was in the rainy season. I did the steep hike around which was worth it. Lots of pretty flowers and trees around. But I wish I hadn't taken a guide. He abandoned me in the middle of the garden when it started to rain and walked on ahead. I was having such a hard time navigating the steep in the weather, had to ask other visitors for help. Don't hire the guides. They're not worth it. They just point out the flowers and trees. Unless you're really into botany, do the hike by yourself. Stop at the little cafe to buy some local mango pickle and black salt (the juices and wines are too sweet,) and buy fresh apples in season from near the ticket counter. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r604072314-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Guides need to be professional", "review": "Chaubatia garden is maintained by Horticulture department of State government. They have about 340 gardeners and other staff to take care of the farm and nursery. The department has opened a cafeteria which sells natural products like various juices including that of Rhododendron. Make sure you are purchasing the right quality from there. Government has outsourced that is fine but cannot allow selling of poor quality products to the tourists. Although all products are with FSSAI certified labels but when used you can make out the difference. The department has 12 guides who usually wait at the entrance gate and charge you INR 300/- for garden visit and INR 600/- for deep forest visit. But you don't get any receipts. They also lure the tourists in the pretext of selling essences of pine, nilgiri and eucalyptus. Not sure whether this is allowed by Government tourist guides. Ideally there should be outlets with good quality products for such items. The deep forest visit is worth of one hour to know about medicinal values of trees, herbs and shrubs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r652721908-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 3.0, "title": "Little trek in the gardens and forest of chaubatia.", "review": "We took the garden tour with services of guide Mr. Deepak Bisth. Showed us Pine, Cedar and Oak trees explaining their features. One can see the dense jungle from here though we didn't take the jungle trek highly recommend though if you have time. Had refreshing rohendroon juice at the end of tour. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r641112150-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chaubatia", "rating": 4.0, "title": "Summer Break ", "review": "We paid a visit to Ranikhet and Chaubatia. In fact Chaubatia is further 9 kms ahead of Ranikhet at a higher height. The place is very quite and have a few good Hotels / Resorts to Stay. Sunrise and Sunset is very beautiful to watch. One can also visit Local Pickle factory in Chaubatia to pick Burans (local fruit) Juice, Jams etc at a very reasonable rates, the best part is that all this is locally made at this place. A 2 hrs drive (one way) to Kausani and back will also give you a very good  driving experience, from dense pine forests to open paddy fields at Someshwar.  The Ranikhet Golf Course is also a must visit location.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679030-d2721882-r660237847-Chaubatia-Ranikhet_Almora_District_Uttarakhand.html"}]