[{"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Magical Bells welcome you", "review": "take a paper, write your wish, buy a brass bell and tie your wish to the bell, leave it at the temple for Chitai Devta to read it and fulfill it,", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r621670852-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bell Temple", "review": "Not very far from almora city. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r619641263-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Seeking Divine Justice", "review": "Golu Devta temple in Champawat, Chitai near Almora [~9Kms] is one of its kind temple based on the folklore of scion of Rai dynasty of Dhumakot around 15th century AD. People of Kumaon and nearby places have immense faith in the help one can get for relief from any kind of pain, humiliation and injustice. A large number of petitions are hung/strung up by desirous appellant throughout the year. It is wondrous that people of all faith use crumpled papers to stamped paper for submitting their grievances. The thousands of hanging bells are seen in the complex as offered by satisfied devotees.  The mystical and incredible faith in Golu Devta, considered to be an incarnation of Gaur Bhairav[Shiva],  is seen to be believed. Easy to visit from Almora town by bus or share taxis which are available during all day/evening. For devotee puja materials are available in stores nearby and afterword one can break fasting in food stalls. During Dussehra a large number of devotee come to pay their respect. Currently many such temples dedicated to Golu Devta can be found in Kumaon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r632057085-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "lovely bell temple, really naughty monkeys ... beware", "review": "Incredible bell temple , very close to binsar, please beware of the monkeys there they are really something ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r626976459-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai golju devta", "review": "Loved the location easy to reach by own vehicle. Good transport connectivity to the area. Bells in the temple are main source of attraction", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r622693059-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Unique bell temple", "review": "Very near to almora and must visit. Thousands of bell hangs here pointing wishes by devotees. With each bell there is a paper in which wish is written. I found out most wishes were for having children", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r635937027-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Sacred temple intertwined with local folklores", "review": "Chitai temple is a locally sacred shrine for Golu Devta, a deity associated with several local myths and folklores. Within 10 kms of Almora, this holy place receives a lot of footfall and devotees hang bells to seek divine blessings. As usual with several temples of the Himalayas, monkeys are abundant. However, there is nothing much to explore in terms of architecture, historical or archaeological importance etc. (for that visit Jageshwar). If you are travelling to Binsar / Dhaulchhina from Almora or vice-versa, Chitai Golu Devta temple can be a halting point. There are several eateries around, but all are vegetarian. Try the local pakoda-like fry, the chutney is lip-smacking. There is no parking, but you can always find ample space to park your car beside the road around the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r642175600-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Nice Temple", "review": "This temple too is quite old and is located right on the highway. There are over 10000 bells tied in this temple and is really amazing. Worth a visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r577405995-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Out of the box experience!", "review": "Yes this is a very unique temple. As the saying goes that whatever you wish for (Mannat) , write it on a paper in the form of a letter maybe and then tie it. Your wish will definitely get fulfilled. Do carry a paper and pen when visiting this temple and please beware of monkeys!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r567682305-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "A Letter to God Temple of Lord Gollu", "review": "Very famous temple in Lord Gollu in Almora District. There are many temples of Golu Devta in Almora but this Chitai Golu Devta Temple is the most sacred one. There are many bells and letters to Lord Gollu Devta, even copy of government documents to as wish to complete. A must visit temple in Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r648962781-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Divine & positive vibrations.", "review": "It was wonderful to be back here after so many years. I felt the positive energy in abundance. We had a peaceful darshan, our Pooja items plate seller walked us all the way into the sanctum with the plate of offering  to ensure that we don't get troubled by the monkeys. The monkeys could play havoc with your plate. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r657831562-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Something different!", "review": "the temple is dedicated to Golu Devta who delivered justice to all. The temple has multiple bells and devotees have written their wishes, pleas and problems on papers and hung it in the temple. There are mean monkeys here so be careful with food and Prasad thalis. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r658160170-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Communicate with Golu Devata with bells & letters", "review": "GOLU DEVTA CHITAI TEMPLE is on the way to Patal Bhubaneswar temple. Golu devta is considered to be the incarnation of Gaur Bhairav or Shiva is quite popular in this region, story of Golu Debata is some what mixed mythology with local folk story. This is a big temple and a big queue was in front of us , mostly with offerings.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r579597454-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Ancient temple - Lord of Justice", "review": "Like other temples, this one also has a story associated with it. This temple is of Golu Devta, the lord of justice. As per the belief, the devotees write their prayers on a piece of paper and tie it in the temple and seek justice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r587536807-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Noisy", "review": "We went around 11 in the morning. The place is full of monkeys. It's more of a temple where people tie bells & ask for their wishes to be fulfilled.If you are religious,do give it a try.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r588204039-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Beautiful temple ", "review": "A must visit temple as have never seen such a clean n beautiful temple will view of bells all around ..must take pen n paper with urself..we cn write letter of ur wish..n place it dere..m very positive waiting for my wishes to b fulfilled", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r581369743-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "One of the must see place", "review": "This place is a sign of kumaoni culture. The deity was the king of Uttarakhand and use to travel by his horse and was a brave warrior. People show their respect to him and wish for their good. Very strangely the temple have thousands of bells of different shapes and people right their wishes on stamp paper and hang it their and when the wish come true they come and remove any paper and thanks the god for it. Lot of marriages also takes place here.                   The only thing the government and the custodians have to do is to controls the terror of monkeys who snatch everything from the devotees which sometime also end up in biting the devotees and accidents for of the scared devoteesz", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r592759994-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "excellent tourist place", "review": "Chitai Temple is dedicated to Golu Devta .The temple is one of the popular temples of Lord Golu.It is considered as the god of justice.Per day hundreds of believers submit their wishes on paper in his temple. They think that the Lord of fairness will accept all requests which are made with a clean conscience. When the wishes are fulfilled, devotees express their happiness and gratitude by tying bells around the temple premises.The temple looks distinct and extraordinary with the presence of numerous bells of all sizes. Lord Golu’s shrine is placed at a position from where one can see amazing vistas of Himalayas. It is a must visit place which would introduce the visitor to a different kind of religious practice and devotion.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r598879556-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "If you are going through a legal battle, this is where you should come!", "review": "Chitai Temple is a temple dedicated to Golu Devta, the lord of justice. It is a belief that if you have a court case going on and you tie a bell with the wish written on the piece of paper, the wish will be granted and you have to come within an year of your wish being fulfilled to tie the bell again. It was a beautiful sight with bells around totally worth visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r595759041-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple visit", "review": "The temple generates a postive aura in and around the vicinity.It is also that your prayers are answered and your wishes fullfilled on a visit to this temple.Beware of monkeys that might be lingering around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r515687838-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Make your wishes come true", "review": "Chitai Temple is devoted to the mythological and ancient God of the Kumaon region, Golu Devata or Lord Golu. Perched on a hilltop, this temple changed into built in the 12th century via the use of a large belonging to the Chand dynasty. Golu Devta is famously regarded as God of Justice.  located interior thick wooded location of the  pines and oak, this temple is an important non secular attraction of the region. Devotees in flip provide bells and sacrifice animals after the success in their wishes. lots of bells may be visible putting over the temple premises. Temple partitions are blanketed with courtroom stamp papers, which can be petitions from devotees who've not were given justice inside the court docket. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r527718906-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Beautiful temple but beware of monkeys around", "review": "This Golu Devta temple is situated on the main highway. Locals have strong belief that their wishes will come true if they write it and tie it there. Visitors usually buy metal bell or just write their wishes on a piece of paper. I have seen people writing their wishes on stamp papers as well. I am sure their wishes must have come true that's why it's so popular among locals and visitors. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r618347890-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Justice seekers come her", "review": "The entrance to the temple is dotted with bells of different sizes and as you proceed further into the temple, the request letters of thousands/lakhs of justice seekers hanging around the temple can overwhelm you before you enter the sanctum sanctorum. Pray truely and ask for your wishes to be fulfilled and after your wishes have been granted don not forget to offer a bell in respect.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r533114740-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Good Temple", "review": "The temple is very unique for so many Bells. Must visit place near Almora. We visited in the morning while staying at Deenapani.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r534211568-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Spiritual & Devine", "review": "This place is awesome with great spirituality belonging there. It is famous as wishing temple where people used to tie their wishes written on the paper along with bell hanging to it. The beauty lies to the bell all around the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r536325982-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Golu Devtha temple", "review": "This temple is dedicated to the local", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r557686973-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple with bells!", "review": "This temple has infinite bells along the walls and gate of the temple. No room around the temple is free of bells. Everywhere around you find devotees that have tied bells or written letters to the deity. Visit this temple for infinite view of bells.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r551967891-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "A must visit temple - One of its own kind", "review": "Chitai Golu Devta Temple also known as temple of bells. It’s a local deity in the area known as lord of judgment. We are surprised when we entered in the temple premises, hundreds of bells of all sizes hanged around. The more you go close to the sanctum sanctorum you witness stamp papers, applications, wish letters which people have tied to thread and hanged in the premises as their wishes to be fulfilled by the lord. The place is very calm and quite, on the way from Almora to Jageshwar Dham.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r558159698-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "temple of bells", "review": "also called rhe golu devta temple dedicated to the local god golu devta who is referred to as the god of justice. there are 1000 of bells of every size hung in the temple complex and people pray to the god by either writing their wishes on a piece of paper or hanging the bells. we just loved this temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r557508501-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "If you only visit one temple...", "review": "After 3 weeks in India, I was just about wore out on visiting temples, and almost passed on my guides suggestion to visit this temple.  I am so glad I did decide to visit. It was my favorite temple.  It only takes 5 minutes to walk through, but it is a riot to listen to all the bells being rung.  Go ahead an ring them yourself. Only warning is that whoever hung these bells couldn't have been taller than 5'6\".  Mind your head if you are tall.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r559868862-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple with different view", "review": "A must visit for the travellers who are visiting uttrakhand for the first time. You will be amazed to see many bells are hanging ans tied in the temple complex. You too can buy and hang a one to offer prayers to tje lord so that he fulfill your wishes.  Alongwith it don't forget to submit a letter (chitti) to the lord listing ur wishes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r483066596-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "This temple reinforces the presence of God Almighty...", "review": "People who have been denied justice and are disappointed from everywhere come here to seek the justice from almighty. With the blessings of Lord Golu Devta, every honest wish comes true and justice prevails. People come here and submit their problem on a piece of paper/ litigation papers are also tied around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r484075964-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Must Visit when you are in Almora.", "review": "Chitai/Golu Devta temple located in almora district of Uttrakhand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r484558631-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Visit to the temple", "review": "You can travel by sharing a jeep ride (Rs. 20 per person) from Almora city to Chitai temple. takes 25-30 minutes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r485862628-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Not so important", "review": "Its an usual temple. Specialty is huge number of bells of different sizes. Local people arrange marriage ceremony here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r484293680-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Beautiful surroundings", "review": "Small temple site near Binsar which offers you solitude and calmness for prayers. It is an off-beat but charming location.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r486714071-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "MUST VISIT FOR RELIGIOUSLY MINDED", "review": "Golu devta is a form of Shiva and very close to the hearts of people of this area. There are a large number of bells of different sizes hung all around. Fulfillment of a wish is acknowledged by a devotee by offering a bell here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r486772035-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Chita/Goludev Temple", "review": "Being one of the most popular temples this side, you may expect a sizeable crowd. The temple though is unique for its string of Bells which abound in the precincts - considering folks have their wishes fulfilled, you may want to visit and ask for a wish - do try your luck ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r490377619-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bells and Litigation Paper Devta", "review": "Temple located around 8 km from almora towards Jageshwar Dham/ Pithoragarh, in Chitai village.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r488226587-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "A very different experience! Must visit", "review": "We were amazed to see this temple. People around this area believe - that if you make a wish here - it will be fulfilled.  Its also know for devta of justice - people attach stamp papers with their request - which have not been fulfilled by the law or the courts and the belief is that Golu devta will give them justice. Hence you would find a lot of stamp papers attached along with a bell. It's a different experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r493730318-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Lots of Bells", "review": "We visited this temple enroute Jageshwar Dham in the morning. It is on the road and has lots and lots of bell hanging even with affadavits. If you are passing by, it is worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r456071725-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Devotional Place", "review": "One of the best places when visit to Almora. Beautiful temple. Trillions of bells.. Very peaceful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r469863019-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "an interesting temple filled with written requests made to the Temple deity - Golu devta , the lord of justice", "review": "this temple is located nearly 30min away from Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r468716888-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai Golju Devta (God of justice)", "review": "You will get a shared taxi or book from a hotel (Shivam i guess) located just ahead of Almora bus stand. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r469977801-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Great place - Jai Golju Devta (God of Justice)", "review": "Interesting temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r472550060-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Most interesting Temple....Temple of Bells", "review": "Great to visit Jai Golju Devta / Chitai Temple...the Devta is GOD OF JUSTICE. People have filled up millions of Affidavit in plain papers as well in Stamp Papers as well millions of Bells of all sizes all around the Temple depicts the strong faith of devotees that justice would be showered by Lord Golju...The Temple is most interesting as well very peaceful other than the naughty Monkey...be cautious.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r475220952-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple of Bells and Justice", "review": "This is a very famous temple of Shri Golju Maharaj - world renowned as the temple of bells. Golju Maharaj is known as the avatar of Lord Gaur Bhairav and known as the god of justice, also he is the protecting deity of people around Uttarakhand and Himachal (2 states known as 'Devabhoomi' - Land of Gods).", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r475479005-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple of bells", "review": "A nice temple with huge no of bells. Also, it is surrounded by a large no of monkeys as if they are running this temple. It is a small temple which is famous for people who wants to wish something for future.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r481806166-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Submit your petition for God's Judgment", "review": "This temple has a unique distinction of being a place where justice is served. As you enter the temple premises you will find hundreds of petition being submitted to Golu devta the temple deity by the worshipers. People of the mountain feel that  if you are in a difficult litigation/ Court case and want some divine intervention then this is the place to come.  The people who are delivered justice offer bells as their gratitude towards the temple deity and if you count the bells you can be very sure that the satisfaction rate is quite high.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r431676431-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple of Bells", "review": "A Unique temple where devotees tie bells, maybe ten thousand or more bells of all sizes tied there! An excellent devotional experience! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r427459434-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "\"For Whom The Bell Tolls\"", "review": "Chitai Golu Devta temple is situated in Almora at a distance of approx 5 Kms from Binsar Wildlife Sanctuary on the Almora-Barechhina Road. Golu Devta Ji is regarded as an incarnation of Lord Shiva(Gaur Bhairav) and is widely believed to provide justice. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r478169451-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Fascinating place", "review": "A plce to stop and marvel. It reminds one of pilgrimage places in Catholic countries with all the bell gifts and letters about divine help people received who came here for worship and prayer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r426129419-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 2.0, "title": "Temple of Golu Devta, local deity of this area", "review": "I visited this temple early morning (around 7.30 am) and was amazed to see variety of bells being sold outside.  When I entered the temple area, these bells were all around and in various sizes, some were few times larger than my head.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r479395605-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Religious", "review": "Its a good place to visit...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r434353614-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Justice with a Ring of a Bell", "review": "the belief is that if you pray here , then any legal issues  such as land would be resolved soon and you would then come back to this place to tie a Bell at this temple. This is also known as the Golu temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r443012729-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "was unbelievable", "review": "i was amazed to see such faith in god wjere people were standing in long queues and had pages long letters with thwm they had qritten for Chitai Golu god. i read few letters and saw how people struggling in daily life seek his blessings. thousands of bells were donated there and overall a very religious ambience there. i loved the way people had so much faith in chitai golu god. no car parking available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r436724680-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Beautiful temple where everyone has a wish", "review": "You should visit this if you are anywhere near Almore or on the way to Jageshwar. You will not miss the rush of people visiting this temple on the highway. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r452539653-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "the ghantee wala temple", "review": "The temple the locals go to to ask for favors  wherein they write letters to goloo devta and leave them tied there and then on the boon being granted come and tie a bell outside the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r392827531-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "One of the best places when visit to Almora", "review": "One of the best places when visit to Almora. Beautiful temple. Trillions of bells.. Very peaceful place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r456069716-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "One of the populatr temple on Jageshwar-Almora road", "review": "This is a holy temple for believers en-route Jageshwar Dham. Here people serve bell in the temple with a believe that their wishes will come true.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r445150897-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Excellent", "review": "The temple is beautiful and unique, having full of bells of all sizes.The temple is nice and clean, but you will get lots of monkeys.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r454644808-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "The kingdom of bells..", "review": "The Golu devta temple just 5-7 Km from Almora towards pitthoragargh road. This temple konwn as bell temple, because there are bells and bells everywhere in the temple campus. The Golu devta known as divine of justice, and locals believe if write wishes on temple then it complete, and then people hang their wishes with bells small to big. Thats why now there are thousands of bells all around. That is amazing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r395804226-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Golu Devta Mandir a.k.a. Ghanti Vala Mandir", "review": "Golu Devta Mandir is located at Chitai which is about 5-7 kms from Almora, on way to Sirar village. The are just uncountable number of bells hung around the temple. There are also a number of eating joints outside the Temple. Enjoy the Tea and Pakora there. Just beware of the Monkeys. :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r409786772-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "The most famous mandir of Uttarakhand.", "review": "Felt pure & pristine under the blessing of Golu Devta. Lot of monkeys not making any menace. Near to Holiday Homes Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r411116457-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Wish temple with contract.", "review": "Famous and always fulfill your wish with written agreement , temple of Golu God. Worshippers file their wish in written paper in front of Golu devata(God). It is presumed that Golu devata will always fulfill your wish.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r416828867-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "One of its Kind", "review": "Never seen so many bells and wishes together. This is a must must visit temple if you are in almora/jageshwar/binsar. It is very popular with locals and legend has it that if one ties a bell with his/her wishes, one has to come again to tie another bell when his/her wishes are fulfilled. Saw many wishes- IAS, Job, Property, Child and many more. All are welcome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r415587736-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 1.0, "title": "Eve teasing at the temple!", "review": "Note that this isnt my first trip here - i am a native and have been here plenty of times.. but my first in quite a while; Came here, the temple is overcrowded with vendors and people - and PERVERTS -- not just me but me and my older sister were inappropriately touched by some random psycho pervert  here - and nobody raises an eyebrow - they see a lady yelling at a man, and they watch and stare as if a show is on. terrible they dont even leave a place of worship alone.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r417327354-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Unique temple ", "review": "Chitai golu devta temple is on the way to Jageshwar dham. Golu devta is revered in Kumaon region as nyaaya (justice) devta (god). Here you will find hundreds of bells, big and small, along with letters written to God by the devotees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r423696574-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bell Temple", "review": "It is such an amazing temple with thousands of bells all around. People tie there wishes on a paper and a bell and it is believed that they get fulfilled.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r423053748-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "religious for religious people", "review": "If you are religious enough to spare your trip to go to Chetai Temple  for Darshan then you get a scenic trip free with the trip. This temple gives you both. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r423187596-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Nyay Ka Devta", "review": "Experience the faith mankind has in the almighty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r381774113-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple of Bells", "review": "This was my third visit to Chitai Golu Devta Temple located in north end of the Almora town it's a very nice place to visit. People come here for the wishes and offer brass bells.You will find variety of bells hanged here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r383449290-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Good place", "review": "Very famous temple near the almora,it has a very large number of Bells of various sizes,", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r383292998-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Good place to go with family and friends", "review": "I have visited this place several  times,  Its a famous  temple of kumaon people,  its very famous among us. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r382999679-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Unusual temple", "review": "Very strange unusual temple with hundreds of bells hanging all over the place. Interesting to photograph.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r385164296-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "The Belled Corridors", "review": "The Golu Devta Temple at CHitai, near Almorah, Uttarakhand, is unique in its way. It has thousands of bells made of brass across its compound. The devotees offer bells to Golu Devta. You can also find bunch and bunch of letter written to the Devta for fulfilling the wishes of the devotees. Some letters have also been written on the stamp papers. It is an amazing site to see.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r383847295-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Colourful & unique temple", "review": "The temple is truly unique in the way that it's full of bells tied all through its premises. The colourful sight of so many bells and the sound they make is unique experience. Must visit place for me.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r385176612-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Daytrip to the Temple of Justice", "review": "A fascinating place- People from all over India travel to this very small village in the hopes of seeking justice by tying their grievances & hopes in written form to clanging bells at this temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r391019816-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai Golu Dev", "review": "Being a Pahadi I really enjoy each and every temple of the Golu Devta in our region. Golu Devta are the God of Uttrakhand. We show our devotion by offering bells to Golu Devta and one can easily find n number of bells in every Temple of Golu Devta.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r392652203-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Bells..Bells..and Bells...", "review": "Must visit for the Bells. It is situated on the way from Nainital to Chaukori. There is a small Golu Devta temple just a km before this in the forest of pine woods. Many takes break here to rest as the shades and trees of pine woods is accessible and one can seat below it. Golu Devta is the God in this region of Uttarakhand (Kumaon). The temple situated on a small hill across the road. One needs to climb up say 50 plus steps to reach at top. The steps are good and easy to climb. The temple starts with Bells, bells and bells all around including above your head. Climb up ringing the bells and appreciating the scene listening to the echoing sound of the bells. Every Golu Devta temple is having lots and lots of bells attached to all the pillars. It seems it is tied as a tradition, as a gratitude or request for wish to God.  One can also find thousands of people's wishes on papers and sometimes on stamp papers hanging all around. good to visit. As a visitor one enjoys the cluster of bells spread all along the temple capturing every pillar, boundary and every nooks and corner. There are no toilets in the temple premises nor did we find it near by the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r388719978-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Amazing temple with thousands of bells and letters!!!", "review": "Chaiti Temple, located 6 km from Almora, is a sacred temple devoted to the mythological and historical God of the Kumaon region, Golu Devata. Perched on a hilltop, this temple was constructed in the 12th century by a general belonging to the Chand dynasty.The temple is characterized by the large number of bells hanging in the premises. These bells are hung by the devotees as offerings making a wish or in thanksgiving on the fulfillment of one’s wish.It is the most sacred temple for the people of Almora and the neighboring villages. The walls of the temple are covered with court stamp papers,letters by those who did not get justice in the court. Around the temple are hanging thousands of bells, which have been donated by those people whose wishes have, been fulfilled.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r356212141-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple of Bells", "review": "Here in the temple the incarnation is locally called as \"GOLU devta\". It is believed to be an avatar of Sri Krishna most probably the \"Kalki Devta\". The locals believe that whatever you implore to GOD if it gets fulfilled one must come back to this place and pray homage at this temple.   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r365151302-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "jai golu devta", "review": "ancient temple of golu devta...people from different part come with their wishes in the form of arji/letter and after their wishes fullfilled,offered bell to the temple.this is full of bell from small size to large one", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r367675077-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chtai Temple ( Golu Devta )", "review": "Golu Devta is extremely popular & revered deity, particularly , in Kumaon Hills of Uttarkhand . It is greatly beleived that any wish made here sincerely is fulfilled . large number of devotees come here with written petitions , some on Non Judicial Papers , and submit these by hanging along with Brass Bells  in the Temple . As such , it has a very large number of Bells of various sizes hanging in the path to the sanctum since time immemorial .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r365550747-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "A very famous temple", "review": "A very famous temple all across uttarakhand, this temple is famous for the number of bells offered in this temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r368444415-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Calm and spiritual", "review": "The place has a lot of spiritual value. You can visit to calm your senses and feel in harmony with yourself as well as the world.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r368038374-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 1.0, "title": "Spirtiual", "review": "Worth visiting ......temple of Golu devta ...it is said that Golu Devta is God of hills . This temple is on the way to JAGESHWAR DHAM ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r367061408-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "jai golu dev", "review": "The temple is one of the most imoortant relihious places for people in almora and regions around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r375214016-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "One the unique temple of its kind", "review": "Most unique temple. Must carry pen and paper to write wishes. Lots and lots of \"Ghantis\". Beware of monkies", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r375731671-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple of Bells", "review": "Dedicated to the local warrier god Golu Devta, this temple has thousends of bells donated by the devotees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r375502762-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Golu Devta temple", "review": "It was amazing to witness the faith of people in this temple. The temple popularly is known as Golu Devta temple. Thousands of bells of every size was tied with wishes written on paper to be filled by GOLU Devta. It was strange to see wishes written on stamp paper and tied to the bells... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r315590119-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "You should never miss such an amazing experience", "review": "En route Jageswar to Almora, we visited Chiatai Goludevta Temple , famous for it's lakhs of hanging bells. People come here with their wish , pray for justice, even they write their wish on a stamp paper and hang them with a bell of different sizes. Even after their wishes become fulfilled they hang bells along with a letter . The whole complex is reverberated with the sound of thousand and thousand bells. Have never seen such an amazing scene. there big big bells as well as small , tiny bells. The deity is very simple  and is curved on a stone.  A very different experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r330436227-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "a different experience", "review": "this temple is dedicated to Lord Golu, believed to be the lord of justice in the Kumaon region. the temple offers a very different experience as the devotees write their desires on stamp papers and tie them on the temple, once you enter the temple there are thousands and thousands such written petitions to the Golu devta.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r317793422-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "A unique temple with bells all around", "review": "A must do visit to Golu devta from Almora. Golu dev is the god of righteousness & fairness. Local people come & ask the god for wishes & on the wishes being fulfilled the tie a bell in the temple. You can see a variety of bells in the temple. Do pay a visit when you go to Almora. Its on the way to Jageswar & accessible by taxi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r334009019-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Golu Devta ..Famous  temple..", "review": "Golu Devta fulfill your wishes...Great of faith of the people,they write their wishes in a paper[even in stamp paper] and once their wishes fulfilled ,they write thanks giving letter to God and tie a bell at the temple. You will find lot of bells tied all over the temple.. One of the best temple  I ever visited.  The temple  is in between Almora and Jaggeshwar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r316726131-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Place of Lord of Justice", "review": "Your visit will not complete unless you visit this place. The temple is dedicated to Golu Devta.Its very famous and religious  place in Almorah. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r333474045-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "God of justice", "review": "Colorful temple that attracts many believers. The entrance is lined with letters entreating Chitai to solve problems and bells of all sizes, hung by those who were satisfied with Chitai's response. Monkeys add to the attraction. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r337271885-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chitai", "review": "A visit to Almora will be incomplete without a visit to Chitai. It is also called Golu Devta and is famous in the entire Kumaon. Nestled in hills surrounded by pine forest, its a beautiful mandir.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r324862652-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai ho", "review": "The Golu Devta Chitai, temple is about 4 km from the main gate of Binsar wildlife.Golu Devata or Lord Golu is the legendary mythological and historical God of the Kumaun region of Uttarakhand state of India and is their deity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r286288058-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Golu Dev maharaj ki jai..", "review": "temple of bells and known for its charismatic belief of wishes coming true.People tie bells along with details of there wishes written on a piece of paper, actually tied along with the bell. The aura is just awesome.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r352033672-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple of Bells and Application Letters", "review": "It is a unique temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r355184263-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai Mata Di !!! ❤ ❤ ❤", "review": "Bells everywhere !!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r287796872-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Must visit!", "review": "One of the most visited temples in the Kumaon region, it is abode of King of Justice, Goluji. You can reach within an hour from Almora. Lots of brass bells and lot of letters of peoples' wish you can see here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r288063783-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Peaceful and Worth Visiting", "review": "The place is amazing in a way that it keep attracting devotes from far away and you will be amazed to see how many people have left locks as well as other documents for their loved one's here as part of their prayers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r293162366-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple of Justice", "review": "the temple is known as Gollu devta mandir and the god is known as god of Justice. people write letters to god and offer it in the temple and one is sure to get justice", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r294083234-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Ghanta Mandir", "review": "Here was a mandir that was unlike any other we had seen until now– a temple  that was full of bells of all sizes….made of brass, of varying thickness, their sounds carry deep into the forests. We went about ringing all of them – big- small, high-low, light-heavy and we’re thrilled by the sounds they produced -- http://www.wheelsonourfeet.com/2015/08/19/sight-seeing-in-binsar-uttarakhand/", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r306339944-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Different Temple - Appeals", "review": "This temple was in our Kailash Yaathra route. It was a bit of raining. We went in for darshan. And then notice the thousands of papers and most of them in stamp papers ! People who have issues that are not resolved otherwise, appeal in this temple for speedier resolution. Interesting. There are some nice restaurants and tea shops near by and opportunity to interact with locals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r309274592-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Nice Temple - Presiding Deity of the Kumaon Hills", "review": "You will not miss this temple. On the way to Jageshwar site. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r287778102-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "God is thier.. ", "review": "Too lovely and good place in almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r313969379-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Fascinating bells!", "review": "The bells that adorn the place (they are prayers to the almighty), give an amazing grace to this temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r271716193-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Golu Devta (God of Justice)", "review": "Very old temple of local deity known as Golu Devta (God of Justice) is very popular. Animal sacrifice is still considered as form of worship here, one must not visit this place if you find this troublesome or offensive.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r281278905-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bells, Bells and more Bells", "review": "Chitai Golu Devta Ki Jai Ho !!!! you may never see more bells at one place any where else in the world....very interesting story behind the existence of this temple...go here just to see the amazing variety of bells....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r272947952-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "very good temple for local community", "review": "i visit this temple such good location & very famous for local community..great temple & great location ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r278732085-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Visit only if you have faith in lord Golu", "review": "This is temple of mythological God of Kumaun Region - Lord Golu. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r267510620-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Very good temple", "review": "Good temple to see. It is very famous among local residents. You must carefull during your visit here from monkeys, they can take your parsadam from you.According to this temple if any your wish fulfill ( you can write your wish on stamp paper / plain paper along with parsadam and fixup on any tree here )then you have to provide bell to this temple. You can see thousands of bells here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r314337607-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Visiting the local deity in Devil Bhoomi! ", "review": "Chitai temple is a temple of Golu Devta widely worshipped in Kumaon region. Golu Devta is believed to be a form of Lord Shiva and many mythological stories are believed around him.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r273369089-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Chitai Golu Devta temple", "review": "Temple with a lot of bells!! beautiful temple with a lot of historical significance. unique way of praying at the temple by tying bells of different sizes", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r282328012-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Worth only for Believers", "review": "The temple is quite far from the city and there is nothing else around so visit this place only if you have belief in the deity. The temple is nice & clean and offers no special view .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r282657299-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "a place must visit", "review": "must visit place in almora . you have a wish fix one bell . you may write a letter to Golu Devta also ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r283913594-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Unique experience..", "review": "Its a very different temple, you'll find hundreds of bells in all sizes and here you can wish in writing.. its better to go early in morning to avoid rush and have breakfast in near by shops after visiting the temple..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r242406675-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Bells galore (and monkeys)", "review": "Liked: The bell gallery which leads you from the entrance to the sanctum sanctorum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r234322985-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Golu dev does need any review", "review": "Its near to Almora. Nearly 10 Kms from Almora. Drive is very thrilling, one must be very careful. Temple has lot of Monkeys and one must be careful with their stuffs and gadgets.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r247742612-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Nice temple with lots of bells.", "review": "Located at the outer side of city. Chitai Golu temple is known for its  rituals of writing letter to the God and presenting a bell's to the god. Location is good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r246921416-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Most Revered Temple Of Kumaun Region", "review": "Chitai Golu Devta Temple Is one of the most revered & most worshiped temples of Kumaun Region... Golu Devta is also known as Lord of Justice & is an incarnation of Lord Shiva... The temple is very peaceful where one can sit, worship & feel the peace of temple... there are numerous bells & letters hanging in all around temple, starting from the entrance.. people bring & also send by post their grievances & problems in the form of letters... when their problems are resolved by the grace of Golu Devta... people come & hang a bell as a gratitude towards the God... the size of the bell depends as per the financial capacity of the devotee... Golu Devta is the God of Justice therefore many people from around the world, mainly send the grievances of their court cases... Chitai Golu Devta Temple is a must visit for all travelers travelling to Almora...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r250591671-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "simply bells", "review": "Chitai temple attracts locals with their offerings based on their fulfilled wishes ( mannath). The offering is a bell - one can see thousands of bells with letters attached on to the bells - ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r265187724-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Write your heart and ring the bell!", "review": "The Golu Devta Chitai, temple is about 10 km. away from Almora. Golu Devta is a highly worshiped deity in kumaon region. People call golu devta as ‘God of Justice’.  You can see the impact and belief of this deity when you are travelling on road and come across lots of tourist and private cars bearing this name on the top of their windshields. Local folks have much faith in this temple and Golu devta, they visit here with their wish written on paper along with bell or for thanksgiving on the fulfillment one’s wish. There are thousands of bells, all different sizes are strung across the temple premises and stacks of paper along with that which have all funny requests / prayers right from passing in the exams to marrying off the daughter. Many people had written their wish or thanks giving on stamped paper. It was altogether different experience visiting Golu devta temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r266391940-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "bell-temple", "review": "thousands of bells hanging at the temple-yard, good place for rest after a day-long journey...............................", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r208479363-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 2.0, "title": "Just another temple", "review": "It is just another temple with many bells and wishes clad to it's every wall. The thing I didn't like about this was that innocent animals are sacrificed here in name of God which is very wrong and one should avoid such places.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r205290348-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Jai Golu Maharaj....", "review": "Chitai Golu Devta temple is about 10 km from the Almora Jageswar/ Pithoragarh road. This temple is well known as “Ghanti Wala Mandir” or bell temple having thousands lakhs of bells around it. Golu Devata or Lord Golu is the legendary mythological and historical God of the Kumaun region and worshiped as Lord of Justice & is an incarnation of Lord Shiva... you can noticed number of petitions were hanging side by side with the bells on Rs 100 & 10 stamp papers and plain papers. Having patience you may see numbers of them are from different places of India and outside India…  A must visit place … enjoy", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r262023736-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Temple of Local God of Justice!!", "review": "1. We stopped on our way to Jageshwar to pay our respects to the deity Golu Devta.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r208178785-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Divinely Feelings", "review": "Some 10 kilometres from Almora, the Chitai Temple is considered to be a must visit place.  Here GOLU DEVATA, known to be an incarnation of Lord Shiva, regarded as the dispenser of justice, is worshipped here.  It is believed that Golu Devata cares for prompt justice to the devotees and may be because of that we here noticed many a written petition hanging to be received and be judged by the Lord.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r261575433-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Never seen so many bells in one place", "review": "Great place to go from Almora. Go with a wish. Come back with a bell if it is fulfilled. You see people making pacts with God on a stamp paper and letters. Lots and lots of bells of all sizes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r210042322-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "temple of miracles", "review": "This temple has 2 other sister temples at Champawat and Nainital.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r214079209-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Temple of wishes and Bells", "review": "This temple was first one of its kind among the temples we have been to in India. It is dedicated to their local God- Golu Devta- the God of Justice. People make wishes by writing them on the affidavit of rs 20 or more and tie them inside the temple premises. When their wishes come true, they tie Bells as a token of thanks to their God. It is near to Almora. Keep the camera with you. You will be delighted to see the faith in people in their God after reading their wishes. It was incredible. Loved it! :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r214666760-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chitai temple (bell temple)", "review": "Chitai temple is about 10 km from the Almora bus station on the Pithoragarh road. The temple has thousands of bells around it, there foe the temple is also known as bell temple, most of the foreigners know this temple as a bell temple. The temple a local gods temple. The temple well known for justice. Chitai god is known as Golu Devta.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r226852803-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Chitai Temple", "review": "worth a visit...but one should take care of their prasad plate as there are lots of monkey in temple premises...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r228398643-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Those bells are real attraction!", "review": "Beautiful temple surrounded by trees & hills.. will surely get some good shots for your camera! Best time to during evening!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r163479772-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Very peaceful, scerene", "review": "This temple shows the power of wishes and their coming true when you come with a pure heart. There are hundred's of thousands of bells which devotees have strung to the walls and this they do when what they wished for in the temple comes true. People come from thousands of kms away to prey. Worth visiting once and hopefully when your wishes come true you come visiting back again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r223676822-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "go, make a wish in writing", "review": "What a charming and well kept temple. People come here with written requests to Golu Devta and tie these request with a brass bell. Once you get what you wished for, remember to come and tie another bell. Long letters tied to the temple bells is a common sight, and you have to believe in the faith of the millions who have come to the temple before you. Do visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r232806696-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "The most sacred and worshiped temple of Almora and Kumaon regeion", "review": "The Chaiti Golu Devta Temple is the most worshiped & sacred place of Kumaon regeion and the whole Almora..... This temple is also famous for its hanging bells which are thousands in nos... Its an old saying that those who are suffering from any problem & if they write their problems in letter to Golu Devta... they get instant rid of their problems.... A must visit place for all who visit Almora.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r165400655-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "DEVOTION", "review": "It's a highly worshiped temple of Kumaon Region... People throng from all over India here.... Plenty of Bells are there.. Chitai Golu Devta is the Isht Devt of Kumaon People... Chitai Temple is about 8 to 10 KM from Almora..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r168043851-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Ma Bell(e)", "review": "The Chitai temple is all about the local favorite-The Golu Devta. A God of justice and general WishMaster :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r177400540-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chitai Golu Devta... The Most Worshiped God Of Kumaon Regeion", "review": "Chitai Golu Devta Temple is situated at a distance of 8 KM from Main Almora... It is the most worshiped temple in the Kumaon Regeion... People call Golu Devta as the God of Justice... Thousands of people throng to this temple from all over india....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r180894189-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bells, bells and more bells!", "review": "We stopped at this temple on the way to Jageshwar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r191780573-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "God of Justice-", "review": "I heard about this temple through relatives and then saw the coverage by famous indian news channel.Somehow I was determined to pay visit to this most trusted worship place of hindus.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r185380147-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "gateway of Kumau", "review": "This temle is abt Golu Devta Chitai. this temple is about 4 km from the main gate of Binsar wildlife sanctuary & about 10 km. from Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r187761521-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "experience", "review": "This was our first temple - an experience to savour and learn from", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r195746832-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "thousands of bells for Golu devta...", "review": "the temple of Golu devta in Chitai almora is must visit, thousands of bells - different size / shape  all hung around as offering to god and written applications to god asking for justice ... some even on stamp papers ... myriad forms of belief and devotion .... incredible INDIA .... look around and be surprised and appreciate it ... it never ends..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r141710169-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chitai Golu Devta-- An Incarnation Of Gaur Bhairav", "review": "Chitai Temple is dedicated to Golu Devta, an incarnation of Gaur Bhairav and is a local Kumauni god.. It is located Eight KMS from Almora. The deity of this sacred temple is reputed to make every wish come true, provided the worshipper ask for it with a clear conscience... All Golu Devta asks for in propitiation is a bell, as is evident from thousands of bells strung across the temple premises... The people of kumaun have immense faith in Golu Devta & he is the most worshipped God in Kumaun...Anyone can even seek Golu Devta's divine intervention by writing to him..Stacks of letters are pinned all over the temple along with the bells... Golu Devta is also known as God of Justice..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r199494150-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Its a bell temple..:)", "review": "if you want to see all the bells of world at one place then this is the place..:) he he...Nice temple..must visit for religious freaks..:)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r141000076-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "bells  bells all the way:))", "review": "well basically the temple is so famous fotr the hanging bells all aroung...small..big bigger n smallest...every size of bells are hung there...a very nice temple where pandits wont try to suck u of ur money...u can sit n worship peacefully wihout any fancy n money wastage...olocation is so great :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r141718750-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "Bell temple..", "review": "After crossing some beautiful pine forests, comes this beautiful temple called Chitai. The temple is hung with bells of all shapes and sizes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r148565841-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "One bell -One wish", "review": "Gulu devta God of justice..... now place of wedding(Love marriage), Place of justice , place of wishes ........ in the Sivalik range of Kumoun a very famous temple....... good excursion near Almora (Uttrakhand )", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r142108935-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Jai Chitai Golu Devta", "review": "As Almora is my home town  & Chitai Golu dev is our Isht dev. I normally goes to Chitai temple in my every visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r149776782-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "The God of Justice", "review": "The complete name of Chitai Temple is \"Chitai Golu Devta Temple\" which is hardly at a disstance of 6-7 KM from main Almora Market. It's a very peaceful temple where Golu Devta is worshiped. Devotees send there problems in the letters via post to Golu Devta which are opened by the temple priest and are read to Golu Devta then these letters are hanged around the temple. When the devotees get rid of there problems they visit the temple and offer the bell to Golu Devta as per there capacity and pockets. It is a very famous temple in Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r145789446-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "beautiful picturesque temple", "review": "with golden bells of all sizes hanging around its such a beautiful temple......the stories which follows the temple makes it all the more intriguing...nice experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r146828628-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 3.0, "title": "Small but a different temple", "review": "This temple is for Golu Devta - a local deity. It is located about 5-6 Km from Almora city towards Jageshwar. Just on the side of the main road - it is a small temple but very popular in locals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r131796930-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Its unique Temple", "review": "Plenty of Bells are there. Chitai Temple is very Unique in its way. Its a temple of Golu Maharaj. Don't try Tea or something more from nearby shops ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r151714747-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 4.0, "title": "The Bell temple!!!", "review": "This delightful small temple is full of bells... what is surprising is that some of the bells have petitions to god on court paper... small, medium and large bells all over the place...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r131811488-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "Chitai Temple...The GOD of Justice...", "review": "Chitai Golu Devta Temple is situated at Almora Uttrakhand.... It's a highly worshiped temple of Kumaon Region... People throng from all over India here.... Plenty of Bells are there.. Chitai Golu Devta is the Isht Devt of Kumaon People... Chitai Temple is about 8 to 10 KM from Almora... After crossing some beautiful Pine Forests and huge mountains, comes this beautiful temple Chitai..People hand their griefs and sorrows in the form of letters here... and when their wishes are fulfilled they come back again and hang a Bell here,,, as per their capacity & pocket.... One must visit this temple once in the lifetime....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r155775613-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Chitai Temple", "rating": 5.0, "title": "A place where Priests (pandas) don't harass you!", "review": "If you are religious minded you can try it. Won't get dissapointed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d2693916-r134738136-Chitai_Temple-Almora_Almora_District_Uttarakhand.html"}]