[{"point_of_interest": "Gananath Mandir", "rating": 5.0, "title": "Drive to Gananath", "review": "Gananath is a Shiva temple located near village Satrali near Takula.  The temple is famous for water percolating into the shiv linga from the aerial roots(jata in Hindi) of a tree. A place of religious importance amidst beautiful surroundings.  People throng the Gananath temple during Kartik Purnima. The temple is approachable from Almora as one drives towards Bageshwar on the NH 309A, passing through picturesque Binsar.  At Takula a left turn into the Takula Gananath road leads you to the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8366616-r282649615-Gananath_Mandir-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Gananath Mandir", "rating": 5.0, "title": "Ainwein...", "review": "peace ......", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8366616-r434352456-Gananath_Mandir-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Gananath Mandir", "rating": 5.0, "title": "Happy Hill", "review": "his peaceful spot about 8km north of Almora has been luring alternative types for near one hundred years – as a end result, it is also known as Crank's Ridge. The listing of luminaries who have visited, a few for prolonged remains, includes Bob Dylan, Cat Stevens, Timothy Leary, Allen Ginsberg and Swami Vivekananda, who contemplated at the hilltop Kasar Devi Temple. nowadays, the village is a low-key backpacker vacation spot, with a mellow vibe and clear-day Himalayan perspectives. there's now not loads to do here, but it is a high-quality location to chill. And Mohan's Binsar Retreat can set up multiday fishing, rafting or hiking trips.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8366616-r529325350-Gananath_Mandir-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Gananath Mandir", "rating": 3.0, "title": "Peaceful place", "review": "Temple devoted to Lord shiva around 8 km to almora. Very nice peaceful place with good scenes & temple for worship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8366616-r598349068-Gananath_Mandir-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Gananath Mandir", "rating": 4.0, "title": "gananath temple", "review": "dedicated to lord shiva and famous because of the water flowing on the shiv from the roots of tree, this is easily approachable from almora. very serene and picturesque surrounding.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8366616-r557510973-Gananath_Mandir-Almora_Almora_District_Uttarakhand.html"}]