[{"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Interesting architect worth a visit", "review": "A large number of Hindu temples are to be found in the valley of Jageshwar hills nearly 30Kms. away from Almora town. Most of them are built from stones and are of varying sizes. ASI is managing the temples including Dandeshwar, Chandika, Jageshwar, Kuber, Mritunjaya, Nanda Devi or Durga, Navagrah, Hanuman and Surya, which are still used for worshiping. It also has a pyramidal shrine. The temples are built over a time as indicated by varying architectural styles and the earliest one may be from 7AD. No authentic studies has been published by ASI. Several sculptures and decorative panels adorns the wall of the temples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r632720517-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Eternal atmosphere", "review": "Route from almora to jageshwar is scenic. Tall trees n narrow roads cover the sun and gives a evening look. As u reached the temple complex u get mesmerized. Atmosphere changes automatically. Priest give proper time for rituals and there is no looting of money. u can spend endless hours here", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r635935296-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A perfect place to pray", "review": "I have been to Jageshwar Dham a couple of times and not once i feel like going back. The peaceful and serene environs make you want to stay there for ever. The amalgamation of 101 shiva temple dating back to 7th century offers a sight to behold. A small lotus pond further adds to the beauty. It is one of the dhams in the shaivism tradition and hence is of outmost religious importance. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r627215769-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Wonderful off beat temple", "review": "Had been planning to visit this temple after watching it on a television show. It's a remotely located place and it took 3.5 to 4 hours from Nainital to reach this place. Although the roads are exceptionally good, most roads are in a hilly region with lots of curves and bends. There are two temples one is the Mrutyunjayeshwar temple and the Nageshwar Jyotirlingam, rest are very smaller temple like structures. Darshan was good and not too crowded or commercial place. Although the temple is clean the Jata Ganga River was not at all clean, nevertheless great experience for the spiritual experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r642205436-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham,Almora", "review": "Nageshwar,located about 45 Ka from Almora on the bank of a local river. It is one of the Jyotirling of Lord Shiva(नागेशं दारुका बने).A 17th sanctuary group of temple & water maula was constructed by Katuri kings of Kumaon.All temples are uniquely constructed. Temples are under administrative control of DC Almora.Here we have an ASI musium also,coverying variou related historical events. KMVN rest house is ideal place for night halt. Devadar forest gives a perfect environment for Yoga.A unique destination to visit by road. Taxis & state bus services are available at Almost & Rail head Kathgodam.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r644678130-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Nice place ........ Very peaceful", "review": "Best time to visist the place is March to October. I Visited the place and purchase book \" APANA SWAROOP\" By Dr R S PAL, from Almora KItab Ghar, Fantastic Book, Very Nice. Leter i get to know that Book is also available on AMAZON.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r648674975-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jai Jageshwar Dham Jyotirlinga", "review": "Jageshwar Dham also known as Nageshwar Jyotirlinga is one of the twelve Jyotirlingas of Hindu God Shiva. Two another Nageshwar Jyotirlngas are in Aundha Nagnath and Dwarkadish Dham. It is very beautiful temple located in Almora valley at distance around 30-40kms. All facilities available near the temple. A must visit during Sharavan Month.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r648951504-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "A divine place!", "review": "Don't miss jageshwar dham if you are near almora. The deodar trees lining the road and the campus are beautiful. The temple is centuries old and you will feel the holy vibes. Do look at he carvings on the temple. Don't miss the kuber temple or the dandeshwar temple close by. Definitely see the archaeological museum also", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r658161029-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Very old temples but nicely maintained", "review": "Around 1000 years old temples and gives you glimpses of architectural heritage of our country. There are three main temples in this area and rest are in broken state.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r609596893-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Very old temple", "review": "This is an ages old temple situated at the bank of a river. You can in fact go and see the river from the back of the temple.This is one of the oldest temple of Lord Shiva. In fact there are many other small temples within this temple.  The temple is very well maintained and surrounded with God-men. The temple doesn't have a washroom for God-men and general public therefore people are forced to go behind the temple and pee either in the river or on the adjoining area and that's the sad part. There is no dedicated parking therefore you need to park on the right side of the road. Except for some VIP vehicles no other vehicles are not allowed to go beyond a point and from there is a walk of about 750 meters going via a market.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r618350552-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Got to see the 8th century marvel", "review": "Jageshwar dham is a must if you are in this area. Things that I liked the most were:", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r615029988-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Spiritual visit ", "review": "Visited Jageshwar dham along with Maha Mritunjay temple along with Dandeshwar Mahadev temple on 22nd September 2018. It is one of the best Temples I have visited so far. Construction is very ancient. Even after 1000 years of age the structure of the temple is very well rigid. The atmosphere inside the temple is so peaceful that there are no words that can describe it. Nearby there is a museum managed by Archaeological Survey of India. Ancient idols are kept there too. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r619502686-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Historic temple complex", "review": "It is an important historic temple site in Kumaon part of Uttarakhand sinceit has temples which are buit from almost 700 AD till 1500 Ad by various Katyuri rulers over generations. Actually it is not a 'dham', as is generally referred. It is also not a 'Jyotirling' which lot of peaple will try to tell you. But it has great historic impotance. Just opposite to temple is an ASI museum which shows ancient sculptures saved from temple complex.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r661378326-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Peaceful and no frisk temple", "review": "Old temple with Ram Seeta conjoined Tree. Nice place to hang out. Ideal for families and picturesque location.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r615152887-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Scenic and divine ", "review": "This temple complex has 108 Shiva temples and 17 other deities, total of 125 temples dating back to 8-12th centuries. It is the 8th Jyoti Linga. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r620616757-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Meditater's/Prayer's Heaven", "review": "Power of Positive Energy of Mrutyunjay Mahadev, Dandeshwar, Vriddha Jageshwar in the scenic Cedar Jungles automatically encourage you to meditate for hours. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r621637566-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "Jageshwar Dham or Temple is located 36km away from Almora. This is one of the oldest temple of Lord Shiva. Jageshwar temple is cluster of around 124 large and small temples. Very beautiful. You have to cross curved roads to reach.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r613043577-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Nestled in laps of deodars, an excellent place to enjoy the solitudinal bliss", "review": "Temple, river, pines, forest, peace all in one frame. A small village that gives only nature among the Holy temples.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r621670660-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Old temples", "review": "Jageshwar and Jageshwar Dham are the same. There are two big temples here wherein the shivlinga is workshipped. There are some people who come here to perform special pujas. The temples are very peaceful and nice. I just wish that the pandits were a little less commercial and they let you be inside the temple on your own. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r626677045-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peaceful visit", "review": "Very Calm , quite and beautiful. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r590754564-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "must visit", "review": "Jageshwar dham is situated at the bank of river Jataganga  37 km away from Almora, Uttarakhand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r594703965-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A marvelous devotional sight!", "review": "Jageshwar Mandir is a marvelous devotional sight. With 2 main mukh, there were a cluster of small temples dedicated to different gods. We also stopped by at a dhaba closed by for some yummy aloo-poori as well as a Thali which had chole, curry and roti. The drive to the place was beautiful with the vivid clouds in the sky and tall trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r595768148-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "trip to jageshwar dham", "review": "very old temple with so many lingas. there is also a Kuber temple there. The water stream is not very clean :(", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r594009512-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temple ", "review": "The perfect place to refresh your soul! Jageshwar dham consist of 125 temples in total out of which 2 are main temples . This old temple reminds you about the old beauty of place . Lord shiva sculpture refreshes the mind and helps in knowing about yourself . Har har mahadev ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r595453984-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Devotional places and a archaeological marvel.", "review": "You will definitely find peace of mind along with appreciating the archeological structure and the history of the place. Jageshwar  temple is associated with Bageshwar group of temple made by katyurs is still remains a point of attraction for visitors. Try to wrap up your visit before sunset if you are not staying in Jageshwar since the road to the temple is under construction and it might be dangerous to drive back in night.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r599249706-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "beautiful temple complex", "review": "this was a beautiful temple complex made out of old stone. the mountains and the deodars add to the beauty and feel of it. i didnt know its also a jyotirlinga temple. i hear its most crowded and the place to go on the first monday of saavan month. theres a festival there of sorts. maybe next time. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r600955636-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Extremely pleasant, calm and serene... Historically important.. Jageshwar Temple complex", "review": "It was after reading about Jageshwar Temple complex at our friend's travel blog 'efficient and ' we planed our travel to this serene place. Booked our stay about a month in advance, online through KMVN site. Must mention they have made online booking experience extremely efficient and completely transparent. As we arrived, late evening, after almost 6hrs drive, just strolled, found Archeological Museum right outside the guest house, neatly kept and very informative. Learnt that this temple complex is located on old Kailas Yatra route and have been visited, amongst may saints, Jagadguru Shankaracharya. On visiting the temple, contrary to our expectations, very thine crowd, pandits not trying to extract rather willing to explain history, mythological contexts of the temple.... we immediately fell in love with the 'Vastu'...though it does not fall in the list of 'JyotirLingas' nevertheless quite a serene temple complex... Highly recommended to visit at leisure and try to unwind in comparatively less exploited spots in Kumaon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r602706468-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Must visit place", "review": "This place is so peaceful with 100s of small Lord Shiva Temple in one campus..  I suggest one should visit to see these Ancient clusters of Lord Shiva temples surrounded by pine forest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r606548458-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peace, bliss and serene, this place has it all.", "review": "Beautiful and peaceful place. The devdar trees suddenly pep up the landscape. The experience is truly unique. Have a moment of peace by meditating in the inner chambers, the panditji will gladly offer you a seat. Receive blessings from Bholenath ji himself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r608736045-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "lovely ambiance", "review": "Set by a stream, nestling between age old trees, a beautiful temple. No crowds, no beggars, no one hounding us for money. A temple worth visiting for a silent prayer  & to just spend quiet time sitting and soaking it in", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r577626664-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Cluster of temples", "review": "Many small temples in rather small area. Must be a great place for a devotees.. for tourists its okay place for a quick visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r582940545-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Must visit place ", "review": "Even if you are not religiously inclined, I would still recommend visiting this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r587534461-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jai jageshwar g", "review": "Jai jageshwar g", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r581375091-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Popular Temple with a great History ", "review": "This is a temple complex dating back to the 9th and 10th centuries C.E. Worship here is easy as the priests are friendly and efficient. The archaeology museum next to the site houses a museum containing some of the statues found there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r587803282-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peaceful serene tranquil.... ", "review": "Jageshwar temples are nestled in the small town of jageshwar. The temples are a group of temples which as they say dates back to more than 500 years old. The place has picturesque location and there is a sense of calmness inside the premises. Must visit place if in this part as it also has high religious value", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r581977437-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Excellent !", "review": "If you are planning to go to Jageshwar dham, you must have read about its history. There is a Jyotirlinga here, though its inclusion in 12 Jyotirlingas is little disputed, but despite that it is a must see for Shiv bhakts. The location of temple amidst pine forest is great. At this place devotees also get their Maha-Mritunjya jaap through the purjaris. You will not be disappointed here, I feel so.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r590434091-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Temples", "review": "It's a nice place for an outing. There are several Shiva lingas here. There is also a museum showcasing statues of various Gods & Goddesses.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r588203979-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "jageshwar dham!!", "review": "located about 50 kms from binsar, this temple complex dedicated to lord shiv has about 115+ small temples within its premise. people is kumaon believe that it is one of the 12 jyotirlingas in india. there are lots of pujas being offered there. we went there in jan and the ground beneath was so cold that our legs froze. do carry a warm pair of socks when you go there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r557507816-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Its a coolest place..", "review": "I went jageshwar temple with my family.. We enjoyed lot more. & i want to go again in this temple.its a coolest place always..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r588755581-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Know our rich religious past.", "review": "During stay at The Kasaar Jungle Resort, we planned a drive to this famous historical site of Lord Shiva....Roads from Almora full of Pines and thick Charcol gave us ultimate driving experience. The arrangement of Temple visit was perfect by committee.The chants of Yagna created a pious aura. A must visit Neo Lithic site in Uttarakhand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r557477268-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Pristine", "review": "Om Namah Shivaay. Group of ancient temples in the middle of lush green forest in the mountain area. A little crowded as it is a famous pilgrimage site.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r586905887-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Serene", "review": "A very peaceful place having a huge Deodar tree about 1200 yrs old ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r564467969-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Divine Experience ", "review": "It’s a prominent place as it’s a jyotirlinga, amidst deodar forest as per the description in “Dwadash Jyotirlinga Strotam”. An hour an half drive from Almora. It’s a must visit place if you are going to Almora. Jageshwar Dham is more of a cluster of small and big temple around. Main is Jageshwar Temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r558158503-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peace! ", "review": "This is an untouched place and I hope it remains like. As much as I want that, but at the same time, I want everyone to experience the charm and beauty of this small little village/temple. Small drive from Almora and options to stay overnight. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r568737882-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar dham almora", "review": "Really I don't have the words to express my feelings for this wonderful place.Jageshwar where we can feel the presence of god,and where one can comes very close to nature.This place is situated at an altitude of 1,870 meters.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r567142174-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Joyfull", "review": "This is a holy place and as soon as you will reach there you will have a different kind of feeling. you will feel relax. surrounding to this place is great and beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r571410812-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Har har mahadev", "review": "It's a neat and clean ancient temple. Has more than 125 small temples clustered together. A stream flows close by. The priests are not greedy and perform puja if you say and do not haggle afterwards for money. The approach road is accessible by car. Took us 1 hour inside but that was because we did a small puja. Can be visited as a tourist too if not for religious reasons.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r571486543-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Nice place... must visit", "review": "The temple is located in a picturesque location and it's really worth a visit. Looks like it was built years ago and does give you lots of peace. You also have a Kuber temple nearby. Very calm and peaceful place. Food served in the hotels near the temple is good. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r577405466-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A serene beautiful temple nestled in picturesque deodar forest", "review": "Situated next to a pristine deodar forest , Jageshwar is a temple complex with about 100 small temples dedicated to Lord Shiva and some to Goddess durga/parvati and Hanuman ji. These are ancient temples about 1000 years old and have stood through centuries. The temple is clean and under ASI which also maintains a museum next to the temple. A lot of ancient sculptures have been found at this location as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r541486458-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "ANCIENT TEMPLE COMPLEX WITH SERENE BEAUTIFUL VIEW", "review": "we were on a bike trip to kausani, nainital , almora, decided to cover this place while coming back to nainital from kausani. almora is 60 km from kausani, after reaching almora, you will get a turn to jageshwar dham. the temple is 35 km from almora. the road is far good then my expectation. every view was beautiful. jungle, deodar tree forest, less crowd and as soon as you reach temple complex, the view is just mesmerizing. its a temple complex with around 100 big small temples incluidng main jageshwar dham jyotirling temple. the temple are 1000 years old and architecture is just beautiful. everything was beautiful, the view, the temples, the river, the deodar trees., a must must visit place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r542132491-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Joy", "review": "Built in 13 th century there are number of small, unused temples surrounding the main temple of Shiva.Typical deul architecture of this region, no significant sculpture. The best experience was the upanayan of a small, bashful  Brahmin boy with a choti. Everybody around him was smiling, also the bustling crowd outside and the sun and the green, green background of deodars and cypresses. This is India, merijaan! And don't forget about the unexpectedly beautiful museum nearby as well as the near-dry stream.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r577574093-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageswar Temple - Ranikhet", "review": "I have visited many time to the Lord Shiva temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r543359561-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar", "review": "Jageshwar is one of the best places to visit in uttrakhand.i have already visited here 7 times but still this place always gives us a new experience and especially the tall deodar trees with a winding jata ganga river.The jageshwar temple is the main attraction of jageshwar which attracts lot of tourists every year.But really this place is the most peaceful place I have ever seen.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r547615145-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Place of Worship ", "review": "About 124shillingas and temples of God Mrutunjaya, God Laxmi God Hanuman, God Devdhar tree,. It's said the temple is 2000 century old. Worth a visit for Aahirvadas. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r549939345-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A temple in the Nature's paradise", "review": "Jageshwar, a famous hindi temple situated in Uttrakhand. Must visit place for the Lord Shiva followers. 124 shivlings and Old architecture makes this place awesome. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r554124657-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwar Dham, A Heritage Site", "review": "Nestled in the folds of the Kumaun hills, lies hidden in a narrow valley with dense deodar forests, the venerable temple cluster of Jageshwar Dham.It is just 35km from Almorah. We on our way back from Chaukori, made it to this place in about 7 hours (about 100km). Road is good but with many bends.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r554560042-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "4th solo but January trip to Jageshwar", "review": "This id my 4th solo bike trip to Jageshwar. I went to check what it feels in January. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r556689025-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Holy Hindu Temple", "review": "My experience is about place is so elder but i still remain the place was amazing Build with old Stones some blacks and grey , if you around there must visit once  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r557126800-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Abide of the gods in eternal form", "review": "A marvel of construction at in a quaint deodar forest valley nestled in the Himalaya... the cold stone humbles one into reverence to the solidity of human endeavour... a tribute magnificent to the Indian zeal for its most beloved institution... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r557261830-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Commercialised Temple", "review": "This temple is now commercialised with rate list of different types of poojas. This dents the overall aura of this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r505377378-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Shiv Temple", "review": "One of the oldest Shiv Temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r504333056-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "blissful", "review": "this place is divine. Peaceful and worth visiting. The temples are cluster. Devoted to Lord Shiva, Lord kuber and Ma Durga", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r510949818-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Positive Vibes", "review": "Really felt very positive & peaceful, It is very ancient temple, love to visit there once again. i recommend this to everyone who is planning to visit Almora / Binsar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r518286247-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Jai bhole!", "review": "We were inspired to visit the temple as it looked good in the hindi movie Vivah :). We travelled from mukteshwar to jageshwar, a drive of 3 hrs to get to the temple. Although it was not as fancy as we thought, but the place is well maintained and luckily we dint visit during a rush hour. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r526421013-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Shiva between the deodars", "review": "The surroundings of the group of temples at Jageshwar has beautiful and big deodar trees and these are awe inspiring. Such a beautiful location has been chosen by god to bless mankind.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r533117447-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beautiful Temple", "review": "There are 108 temples out which 5 are big ones. The place is not very crowded. There are small restaurant out side the temple. Parking is available which is free. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r532249870-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Mahadev Temple", "review": "This place is nice with  prohibited photography. There is a huge shrine is for lord Shiva with various other small temples as well. Also, it has a  kuber temple as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r536336143-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beautiful Temple nestled in Woods", "review": "We visited the temple, considering it to be just another one. On reaching the place we got to know that it is one of the Jyotirlings. The priests at the temple, perform individual prayers for each family. Very good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r492412991-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "must visit", "review": "you will fall in love to this destination again and again... Ancient temple a jyotirlinga which give you peace of mind and sense of relaxation ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r537903171-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A temple complex with ancient architecture.", "review": "We took a day trip from Binsar. The temple complex is more than 1000 years old with ancient architecture. It is a must see to see the different temple architecture that existed in India since long.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r536423477-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "WONDER ON EARTH ", "review": "Jageshwar Dham is a unique place, to have so many temples of Lord Shiva in one compound. With more than 108 temples which are centuries old, this holy place is a must visit for all. Apparently those who built the temples were Shiva Advaita Vedantins as all the deities, including Godess Durga and Kubera are worshipped in the form of Shivalinga. The surroundings are full of calmness and serenity. One must not forget to visit Brihad Jageshwar nearby. The same again is very peaceful place, full of natural beauty and solitude which imparts spontaneous meditation. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r491460124-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "7th century Shiv temple", "review": "This temple is located in the middle of the thick forest cover. There are many small and medium size temple of various Gods including Bhagwan Shankar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r492154844-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Pristine Adobe", "review": "Jageshwar dham temple complex is a very serene place. The main temple is dedicated to lord Shiva. It is also supposed to be one of the 12 jyotrilinga.  The temple complex comprises a cluster of 124 large and small stone temples, dating 9th to 13th century AD. It is surrounded by Deodar forest the place is really pristine.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r491487084-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Om namah shivay ", "review": "One of 12 jyotilings, must to visit. Good and scenic location. Not very far from Almora, around 1.5 hour drive. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r494869283-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beautiful temple complex in the middle of green forest with mystical stories", "review": "We visited this place with not much of expectation, however what we found was exceptional. Visit if you have strong belief in god. These temples are very old - almost a 3000 yrs - 4000 yrs old and are very beautifully created. There is not much artistic work - however the very huge structures in this remote area & the count of structures leave you spellbound. There are 125 Siva temples in this complex and thought to be created during the Ramayana period and then restored during various periods in 8th Century to 13th Century. Its a very pleasant and pious place to visit. Visited with my parents and they too... loved it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r493729167-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Har har mahadev!", "review": "This place is so far the best for peace! There are so much positive energy, I wish I could stay days there just in meditation! It is also great as it is not very crowded temple and you will get plenty of time to do Puja.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r495766679-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Beautiful ancient temple complex in a lush green forest surrounded by a bustling pilgrim town", "review": "Beautiful ancient temple complex in a deep lush green forest beside a stream in the mountains near Almora. Unfortunately an ugly bustling pilgrim town has grown up around it in the middle of this remote jungle. Dandeshwar Temple, which is the largest, is situated 2 km before this town, and is relatively peaceful. Jageshwar is where the Maha Mritunjaya Mantra was supposed to have been conceived.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r495858604-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Har Har Mahadev!!!", "review": "Located near Almora, Jageshwardham which is located amidst dense deodhar forests holds both historical and religious significance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r484895732-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Serene and Peaceful", "review": "Perfect location and surroundings . Its a peaceful place where you can relax in the lap of nature. When we travelled it start snow fall and that was amazing ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r498736400-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Serene and peaceful temple", "review": "We found this temple very beautiful and peaceful less crowd . You must visit if you are around jageshwar", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r484821476-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "ohm namah Shivay", "review": "one of most impressive temple cluster of lord Shiva. Nain temple houses Jyotirlinga. A must place to visit for shiv worshipers.Nice clean impressive temples in pleasant surroundings where a car can take you to door step of temple. No stiff climbing  steps or slope. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r484586066-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Peace and Serenity", "review": "USP:", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r486704489-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "Hindus believe that Jageshwar is the place of Nagesh, 8th among the twelve Jyotirlingas which is stated to exist in the forest of Deodar or daruka (Sanskrit: दारूक वन). During Shravan month devotees visits to perform pooja of lord shiva. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r490301338-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Untouched place", "review": "This beautiful place is still an untouched location. This makes this place more attractive. It contains more than 100 shiv ling at one place. In the middle of mountain this dham truly provide with the astonishing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r486732348-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar - a hidded gem", "review": "A hidden gem near Almora, not to be missed, a photographers delight and the Museum nearby adds to the attraction.  Blissful Serene and Scenic - what more can we expect ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r490375073-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Supposed to be Jyotirlinga Temple", "review": "Located 35 km from Almora towards pithoragarh, Jageshwardham in deodar forests having religious significance. Take left turn after aartola, Jageshwar dham is 2 km from there. You can visit 1st Golu dev temple-chitai - 8 km from almora on same road. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r488221725-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Excellent place", "review": "A very nice & calm spritual place...place of Lord Shiva", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r491115002-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Good temple", "review": "Nice ambience, very beautiful. Very serene and relaxing.. will recommend this to every one - religious and non-religious(for the beauty around and the ride to the temple)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r491145960-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar ", "review": "If one wants to connect with spirituality without distractions then this is the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r478124783-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peaceful Darshan", "review": "Set beside a  beautiful deodar tree forest, the temple is fabulous, well maintained with a rich history and mythological belief. No issue with pandas etc as seen at many places. Slightly far and one needs to go by hired vehicle, taxis or bus. But the darshan is great. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r477646850-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "I visited on 17th april 2017.It is 30 km from Almora.A group of temples in one compoud", "review": "Jageshe wer dham one of the jyotier ling (lord shiva) 30 km from Almora Town. A", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r479175251-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 2.0, "title": "A group of historical but dilapidated temples", "review": "This place is about 30 Kms from Almora and approx one hour drive, located on Vriddha Jageshwar Road.  It is a large complex of 124 temples, dating back to 9th to 13th AD and under protection of Archaeological Survey of India but condition of most of these is dilapidated and some of these could be risky to even enter.  The entire area is infested with large number of red faced monkeys who dont shy from attacking humans.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r478719552-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Wonderful ", "review": "Wonderful peace solace and awesome nice this place. Surrounded by devdar trees,  it gives immense view.  May Lord Shiv bless us all. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r480774009-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham- A antique and pre-historic set of temples", "review": "A distant drive from Almora to Jageshwar Dham of around 45 Mins. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r481528492-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Best places to visit from Almora", "review": "Nice clean temple. It is an ancient place but it has been well maintained. Very quiet place to spend some time. One of the best temple I ever visited. You can worship Shiva here if you want. It is beside a thick region of tree, hence it has a cool ambiance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r481530776-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Divinity among lush green Deodar trees", "review": "The place is about an hour and half drive from Almora. The road to Jageshwar is beautiful with amazing picturesque views of hills, valleys and rocks. The temple itself is surrounded by thick deodar tress and the weather was cool for a comfortable connection between god and us. The temples are very old and would make anyone feel blessed just being there. Recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r484530647-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Winter abode of Lord Shiva", "review": "This place is located in the midst of dense Deodhar forest, reachable  within an hour's drive from Almora.   The temple complex hosts one of the Jyothirlinga of Lord Shiva.  Devotees can have a peaceful darshan here as tourists are not thronging this place.  There is also an ancient temple for Kuber - Lord of wealth, adjacent to the temple complex.  An ASI museum housing artefacts / idols recovered from the areas in-and-around this place is in a minute's walk from the temple.    Overall a great place to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r483820186-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing Place", "review": "Really very nice and peaceful spiritual place. Must go temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r457987811-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Nagesh Jyotirling - Shiva Temple", "review": "One of the best & worth visiting as it is historical significance and the architecture is unique. Every temple in the Dham has shivlings. It is surrounded by Deodar Trees and river flows through the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r456072244-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "One  Of Twelve Jyotirlings", "review": ".Jageshwar is situated at an elevation of 1870 mts above sea label and  at distance of 37 km shape important metropolis Almora. it's miles an vital visitor vacation spot of Kumaon and gets thousand of visitors each 12 months.  The cluster of Jageshwar temples depicts the ancient lifestyle and design. There are around 124 temples and hundreds of statues on Jageshwar Dham. The splendor of vicinity is more suitable by the Deodar tress and the Jata Ganga which meanders it way into the temples complicated. Its also acts as an important middle for meditation due to its tranquility and calm surroundings. predominant temple of Jageshwar include Dandeshwar Temple, Chandi Temple, Jageshwar temple, Kuber Temple. and other temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r455789046-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Brilliant and Must Go place for Photography Lovers", "review": "A historical place and you can call it a temple city which has a cluster of 124 large and small stone temples, dating back from 9th to 13th century AD. It is worth visiting for all individuals, even if you are not a follower the architecture will mesmerize you and is a heaven for photographers as they can capture beautiful images of this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r465783186-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "That 6th Century Temple", "review": "A must visit. The place is steeped in 6th century architecture and the locale is just out of this world. Established on a small rivulet, with a colder temperature, thanks to dense Deodar forest and in middle of two valleys, this is an architectural marvel. It is a complex of temples which has 108 Shiva lings. It was the old route to Masarover. Don't miss this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r464209764-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Absolutely Stunning!! A must visit place in Almora!!", "review": "Jageshwar is believed to be one of the 12 Jyotirlingas, so it is a major tourist attraction.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r472548660-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "One of the 12 Jyotirlingas situated in the lap of nature", "review": "Jageshwar is believed to be one of the 12 Jyotirlingas, so it is a major tourist attraction. We drove to Jageshwar from Binsar(around 57 Kms), the distance from Almora is about 40 Kms. Jageshwar Dham is surrounded by beautiful dense Deodar trees and Jata ganga river passes by it, so nature lovers and photographers can also visit the place even if the religious angle is not there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r472432428-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Temple, Near Binsar Valley", "review": "Jageshwar Temple is more than 1000 years old Shiva Temple, it is considered as one of the jyothirlings. The place is still not explored by many visitors. There is one govt guest house. There are many temples at the location. Many once are Jyothirling, mrithyunjay temple, kubera temple and devi temple. There is another temple at a dist of appr 1 Km on the way to Jageshwar temple which also is more than 1000 years. the temple is situated on the banks of river flowing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r474408101-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Historical significance ", "review": "Nice temple complex built centuries ago. Quite clean compared to other religious places. Devotees can roam around on their own or ask the pujaris to throw some light on the importance of the place.  Good thing is pujaris / pandits don't bother you asking if you want to do a pooja or so. It is upto devotees.  Another thing to note is not to confuse it with dandeshwar mahadev temple which looks similar in architecture and it comes before Jageshwar on the same route. Parking available. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r476304797-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar temple", "review": "Very nice ........rightly safeguarded by archeological survey of India. Beautiful....the distance from kassar jungle resort is 1 an half hr approx", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r439429262-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Beautiful forest & Shiv temples", "review": "Should get off your vehicle half km earlier & walk on the road beneath the fores & by the riverside. Also the temple worth visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r444937580-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Ancient Temples in scenic place", "review": "Jageshwar Dham is a cluster of many 8th Century old Stone Temples. Mahamrutyunjay temple & Jageshwar Temple are main temples in this cluster. All the temples have nice carvings and you get a peace of mind if you spend some time inside temples. Jageshwar has a nice pine forest around temple. Ideally, the houses, shops should have been atleast 200 to 300 meters away from temple cluster and then it would have been more beautiful. But do visit this place if you are travelling to nearby places like Almora, Binsar, Ranikhet, Mukteshwar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r441661359-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temple in Valley Jai Bhole Nath", "review": "Must visit place as its a Jyotirlinga dedicated to Shiva, located 36 km northeast of Almora. Situated in valley which has all whatever you want like Peace, aashirwad from Shiv etc....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r450782810-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Mrityunjay Temple Pooja", "review": "Do serve pooja to Mrityunjay temple in the Jageshwar Dham cluster of temples. You can also trek to Vridh Jageshwar, almost (3 km). You can also enjoy the walk in woods, as this is a small peaceful village with no pollution. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r445150117-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Magnificent Temple", "review": "You have to be here to experience the sheer magnificence of this temple compound. The temple must date back hundreds of years and the place looks the same. The temple is beautiful and you will want to visit here again.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r452532467-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Very well located", "review": "Very well located were wonderful especially would definitely stay here again without a doubt.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r425990226-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Jyotirlinga", "review": "I visited in first week of Jan. Temperature was freezing. All dew drops frozen over car.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r452967719-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beautiful Place", "review": "We visited and got really enamored by the beauty of the place. The temples are very old and speak of great heritage. Also the road is very scenic. We stopped by a tea-stall and spent a good time over there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r453286969-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Decent Temple which can be club with Binsar", "review": "I have traveled with group of friend (all male) to usher new year in quite and serene abode of kumuon region. We have chose Binsar for our two day stay. The reason we chose Binsar because it is still less travelled my commercial/mainstream tourist, located on 7000+ ft height so chances of breathing fresh air is more which is earlier associated with all hill station and no longer found in commercial hill station like Shimla, Mussuorie", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r453268201-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Perfect blend of divinity and nature", "review": "A beautiful temple amidst towering oak and pine trees. The long trip to this place from Almora is with it. Make sure you visit few other temples en route to JAGESWAR. This temple is one among 12 jyotirling.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r425457314-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Nageshwar jyotirling", "review": "There is some confusion among people about this place some locals believe this as one of the 12 jyotirling in india and some believe that the Nagesh of Gujarat is original one.However this looks like more old and very peaceful place you will really enjoy it.Its almost 3.5 hrs ride from Nainital and 10 hrs from Delhi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r454528117-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Nice location", "review": "It is a really nice location worth seeing. As it is a little off the road not many people spend the night there, which the locals regret. They seem to be in need of business.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r426128418-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Oldest remaining temple complex dating back 2500 yrs.", "review": "The temple complex consists of 125 temple dedicated to various gods and goddesses , situated on the banks of mythical Jata ganga river on route to Kailash mansarover. The temple is supposed to be one of the 12 Jyotirlingas and the description also fits it is situated among dense pine forest (daruka van) as mentioned in local dialect. The main attraction are the various  form of Lord Shiva, Yogeshwar , Kedareshwar, Maha Mritunjay  and many others.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r431994621-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing 124 sannadhis in one temple", "review": "Words can't express the feelings of the visit of this temple.  A Jyotirling, a river flowing next to it and 124 sannadhis with a Shiv Ling each is an amazing sight in that location!  The temple is surrounded by huge hills--Amazing indeed!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r427792665-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Divine Jyotirling Ancient temple", "review": "No..8 Jyotirling temple, about 1200 years old is truly an amazing experience. Also, Kedarnath Shivaling Darshan here ( an exact replica of the Kedarnath Shivaling) was truly special. The MahaMrityunjaya temple is unique and very special. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r427459009-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "great temple and awesome views", "review": "temple is under govt. so no one will bother you to do this and that. if you want to do pooja you can buy the receipt from counter and pandits will give you full time and do your pooja very well. temple is very beautiful and clean with peaceful environment. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r434345834-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwar Dham Temple", "review": "Super surroundings amidst old and huge Deodar trees.  The temple complex is very ancient and worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r437013542-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "The Pristine and Sacred Jageshwar.............", "review": "Surrounded by the gigantic Pine and Deodar forests, Jageshwar is one of the most sacred and pristine temple complex in Kumaon. Situated near Almora and Binsar,being the other attractions nearby, this ancient architectural wonder should not be missed by anyone when taking a pilgrimage to the Kumaon Himalayas.The place is a nature lover's paradise besides one of the most religious place of the Hindus. The temple complex has temples of all sizes each containing a Shivlinga where thousands of devotees offer their pujas day in and day out. A museum, situated in close proximity, containing various valuable artefacts of the temples is an interesting place to explore also. To discover this magical place a one night stay in Jageshwar is certainly preferable to imbibe it's sights and sounds and et. all. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r435360927-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Historical", "review": "This place has a history that lord shiva was first worshipped here as lingum here than anywhere else. This itself add more importance to its existance and the temple is one of the 125 temples inside the complex. Lord shiva child version is worshipped here. Vridh (Old) version is somwhere about 15km on mountain top (3 km by trek uphill). Visit all year around except festival time when its really crowded. Well, that time is offcourse popular among locals", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r415588939-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "The most amazing temple complex in Uttarakhand", "review": "We went to Jageshwar a while ago, but realized I had never reviewed the place. When we went, there was a lot of snow, so we had to park on the main road and walk down a couple of kms. There are small temples along the way and then finally you reach the main complex in the village. Very beautiful, well preserved and a must see place in the area. Though there are lots of pandits and touts who will pester you to do pooja, etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r436488368-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "A temple in between the nature", "review": "Almost 1.5 hour journey from Almorah. Temple is very attractive. It is surrounded by big trees. The road is very good, lots of scenic beauty, ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r418469210-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "God is Almighty", "review": "Temple of Lord Shiva. Constructed in seventh century. Architecture is almost same as other old temples constructed in various place of south & north. Campus is surrounded by other small temples of various Hindu gods. Oak trees with pure environment for worship of Lord Shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r417731875-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "For Devotees and archeology buffs", "review": "This ancient temple complex and a museum nearby is around 1 hour drive from Almora or 2 hour drive from Binsar. As old as 8th century, a number of small structure raise from a foundation of stone base next to a small rivulet surrounded by deodars all over. Although not much commercialised, there are vendors selling all sorts of stuff when you walk into the temple including pooja stuff, vegetables and other fancy things. The priests does not force you to offer a large sum of money or ask your history like in major temples of north India. You can walk around the place and get a feel for yourself without anyone interfering. The water in the river is very cold and freshens you up instantly. There is very dirty lotus pond in the temple complex which, I dont know serves what purpose. There are few other structure which apparently were built around the same time, outside the main complex.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r415967724-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Monument treasure", "review": "Awesome beautiful architectural monument.. a treasure in itself.. Lord Shiva with 124 gods residing in the same vicinity.. background river silently flows - beautiful view... Deodar trees on way makes it although more beautiful..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r417392472-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Unique temple ; Nice route", "review": "It had snowed when we went there and the place looked magical . The 7 km stretch from the main road inside is covered with pine and deodar trees ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r418486747-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Day at Jageshwar Dham", "review": "Just a walk around the JAgeshwar Dham area is so rfreshing. The scenic roads, beutiful and peaceful temples, flowing streams make you feel very good", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r420722576-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Great Architecture", "review": "Have been visiting this place since childhood and it just keeps on getting better.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r424890656-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "History and nature", "review": "Jageshwar dham is an ancient temple complex set amidst dense deodar forest. Must visit for nature lovers and those who appreciate old monuments and sculptures. On way, we saw pink and white flowers along mountain slopes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r423695339-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "World renowned", "review": "Scenic, surrounded by deodar trees, a thousand years old and well preserved.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r392826650-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Its Place to Get blessing from Jageshwar", "review": "Shri Shiv Swaroop Jageshwar its famous place of pilgrimage people come from different places and do pooja and worship for their wealth and goo future, its very narrow place people stands in ques for worship long time and after coming turn do pooja, very faith full place to worship lord Jageshwar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r421637487-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beautiful Temple Complex in midst of Deodar Forest", "review": "The temple complex is beautiful with many small and large temples    surrounding the main two temples viz. Nageshwar and Mritunjay Temple. There is a small rivulet flowing adjacent to temple  complex which adds to the beauty of the place. Beautiful deodar trees located on the hill and inside the complex are  worth seeing. The temple provides good spiritual experience with visual treat of natural beauty.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r393471818-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Temple is always amazing", "review": "Build up of temple is interesting, surrounded by deodar forest. there are more than 100 big and small temples in 1 complex. considered as 1 of the 12 Jyotirlinga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r394597530-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "beautiful temple", "review": "Must visit jageshwar dham if you visit to almora. It's only 35 kms away from almora but the place is really beautiful and one of the famous dham of lord shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r395343762-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Group of temples", "review": "It is group of around 124 temples all are approx. 9th / 10th century temples. This place surrounded by long trees of devdar, the amazing thing is that these devdar trees only its surrounding of about 2-3KM, whereas all other areas haven't these type of trees. There is max. temple of shiv divine like Jageshwar, mahamrtiyuanjaya, and kedarnath, some of nav durga temple, hanuman temple, bhairav temple etc. Nice place very peaceful. There is also museum near this temple, which have all old statues of around 8th 9th 10th century.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r395811260-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing temples", "review": "The architecture of the temple is breathtaking and one feels calm and peaceful here. Within the complex, It's got 108 big and small temples, of all various gods and goddesses while it's known for one of the sacred shiva jyotirlings of india.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r401966246-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Paid my respect in Dec 2015", "review": "Beautiful ancient mandir, loved it. Loved the super cold climate. Easy to reach by road, went there from Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r411115833-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "An ASI Site", "review": "Jageshwar Dham is a cluster of temples situated 37 km away from Almorah, Uttarakhand. These temples are said to be made in the 13th century. Surrounded by deodar trees, these mystic and tranquil temples make everyone spiritual.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r383846478-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temple in Shelter of Deodar!!", "review": "Jageshwar Dham is a combination of several temples next to each other and several Deodar Trees surrounding them making the place very cold. There is also a village to which you could trek, just next to the Temple. It is just place to go if your are near Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r409785732-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing Architecture", "review": "Jageshwar Temple is a group of temples and one of the Jyotirling situated in the Himalayas where one can go by car. There are not much crowd and one can have Darshan with shanti (peace)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r409789976-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "must visit,", "review": "its 8th jyotiring, & a must visit. thankfully pandits are not greedy like other jyotirlings. iits around 35 kms from almora, great road and easy accessible. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r384508709-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "ONE OF FEW TEMPLES WITH WHEEL CHAIR ACCESS", "review": "This is an old temple but for once my son could visit a temple in the hills as ramps were there. very neat too", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r385161761-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Calm and relax placeto stay", "review": "I have visited Jageshwar Dham 2 times. It is a great place to enjoy your holidays peacefully. There is no much hustle bustle of traffic only mantras bells of mandir can be heard. Very less people can be seen. Visit the great Jageshwar Mandir in the early morning.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r390282103-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Old is Gold..Drive in Heaven", "review": "It's old temple well maintained. Surprisingly drive through is awesome. Road conditions are awesome and every rider and driver will enjoy the drive", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r390587786-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A must visit -  protected ancient religious marvel", "review": "Visited in the month of march'16, this is perfect time to visit this place . Highly recommended to visit if you are in Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r388724022-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Darukavane सेतुबंधे तु रामेशं नागेशं दारूकावने", "review": "Many Hindus believe that Jageshwar Dham is the eighth Jyotirlinga because of it's reference as \"Nagesham Darukavane\" meaning that the eighth Jyotirlinga is Nagesh located amongst Daruka or Deodar forest. Jageshwar temple complex has 124 small and large temples. Mrityunjaya , Jageshwar and Dandeshwar  are larger temples. The place is considered as centre of Lakulish Saivism ( Saivism wherein Shiva is worshiped as Lord with a staff, mace, club or stick) ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r391377458-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing temple, considered to be the eighth Jyotirlinga!", "review": "The temple view is majestic,it is a collection of 124 various temples in one single complex. the Temple architecture is fabulous and the whole structure gives a feel of the ancient era. very quiet place but very high value from Hindu mythology standpoint. there is only 1-2 good accommodation so advisable is to do it as a day excursion while staying in the nearby locations like Almora and others.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r391718988-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Excellant place", "review": "So many Big & small temple in premises. very old temple. one of the 12 jyotrilinga. beware of monkies. Enjoy beauty of nature in middle of deodar trees", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r375737327-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Scenic way to Jageshwar Temple", "review": "Jageshwar Temple is located amidst the Tall Pine trees. Its a historical temple and must visit at least once. The way to the temple is pretty scenic and quiet. nature lovers will like the drive and the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r391609364-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Place of magic", "review": "I have visited Jageshwar several times during my 4 year stay in Almora and more than religious, I find it a place of magic and enchantment. The ancient premises transport you to place of serenity. Esp the Dhandeshwar part of the temple, surrounded by tall and strapping Deodars, it's own mini meadow and stream makes you anticipate fairy creatures are going to peek from behind the rocks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r383002609-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Cluster of beautiful temples", "review": "The location of temple is beautiful.. There are so many temples. All well maintained by Archaeological department. Amazing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r378924954-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "PEACE OF MIND!", "review": "Om Namah Shivay! One must visit this temple.  108 Shivlings are there covering the main temple.  Plenty of PEACE, sit there listen to the mantras.  This temple is surround by Trees", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r376698177-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Nice ambience of temples in similar structure", "review": "A very peaceful place as a temple complex with ancient temples. The ambience around the temple complex is equally nice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r378323397-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jyotirlinga Nahesh Dwarka-Jageswar Dham", "review": "It's very ancient structure and one of 12 Jyotirlinga, which are believed to be built in 7 th century and have group of temples in campus. This temple is amidst Devdar which gives a complete Devine n soothing feel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r378860942-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Divine", "review": "The complex is 36 km northeast of Almora. The site is not maintained by  Archaeological Survey of India. Very important pilgrim place of hindus. The temples dedicated to lord shiva. 125 big and small temples are here. Excellent site to visit. Very peaceful place to visit. Recommended place to visit and worship.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r381565597-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "1000 year old temple with archeological marvels.", "review": "There is a deodhar forest surrounding the temple. The temple has 125 temples with 108 dedicated to Shiva. A world heritage site. Must see the archeological museum that has idols from last 1000 years. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r379795542-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "WOW is what you feel", "review": "One of the best Jyotirlings from beauty of the place perspective, the temple is set in absolute historic style, has an amazing background of sky touching pine trees and the feeling is simply great", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r381300134-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 2.0, "title": "Very filthy place", "review": "The temples are nice and the priests will not hassle you for money. But surroundings are very filthy. What should have been a beautiful walk by the river is marred by the rubbish strewn all over. There is a good museum (free) with various carvings and artifacts from the temple site Museum has toilet, we did not find a toilet anywhere else. Overall a very filthy town.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r364997484-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Peaceful place with historical temples. ", "review": "I have been there many times, with family or friends. Its nice place to visit in any season. It is 33 km away from almora city, you can take a taxi or your private vehicle. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r383000878-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "\"Aum\"", "review": "A very scenic drive to the temple complex.Quaint  little villages and thick foliage dotted our way...each house had their brightly coloured rose bush ( crimson & fuchsia). The temple complex is well maintained, nestled under beautiful Deodar & Pine trees. A darshan inside is a must.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r365543958-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Nagesh Jyotirlinga - Jageshwar", "review": "This is a must visit place in Uttarakhand, if you enjoy visiting ancient monuments. One need not be religious to visit such places. The drive to this place is very scenic, one can also witness typical pahadi (Uttarakhandi) village around this temple. The location of this temple on the bank of river as well add to the beauty of this temple. One can find detailed information about this temple on wiki.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r367649145-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Ancient and so peaceful...", "review": "When i entered it felt like i am actually close to lord Shiva, such a majestic place to be and the whole temple is surrounded by small temples of different gods. Some Pandits are right outside the temple to provide some rites.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r368169725-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "Jageshwar Dham is place of Lord Shiva. This is a Jyotirlinga of the 12 Jyotirlingas of Lord Shiva.I actually felt peace as soon as I enter the temple.The feelings cannot be explained in words. Not only for religious reason,the place is a must visit for nature lover as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r369176666-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Must visit", "review": "Beautiful ! One of the Jyotirling !  Only thing Pandit ... They all wanna take money in name of God !! Which one has to be stern and careful with ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r365058344-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Ancient Temples", "review": "Built around 700 AD, this is a group of temples dedicated to Lord Siva and a lot of other gods. A beautiful jungle surrounds the temples and makes for a lovely treck.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r375501490-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Ancient Shiva Temple", "review": "Jageshwar has a group of ancient temples dedicated to Lord Shiva . It is a protected monument but has live worship & is open to freely to public for visit & worship ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r365546300-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwar Dham", "review": "Jageshwar Dham is Jyotirlinga in Almora district of Uttrakhand.  The temple city comprises a cluster of 124 large and small stone temples, dating 9th to 13th century AD.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r348712208-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Very peaceful place", "review": "Nagesh Jyotirling of Lord Shiva, situated 36 km from Almora is a very old religious place having so many temples. It is situated in Deodar forest and very nice place to visit for Darshan and sight seeing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r371061173-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwar-Ancient cluster of around 100 Shiva lingas amidst pine trees", "review": "The location of Jageshwar Dham is very nice. Serene atmosphere, in middle of forest area. We visited during the weekend so it was a little crowded. On our visit, we got to know that it is a one of the Jyotirlingas, so we offered pooja. Overall, a nice experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r358710969-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "jageshwar dham was a lovely view of pine trees, a must watch.", "review": "The temple I went just a day ahead of Shivaratri, awsome experience of the temple, but the courtyard must be cleaned properly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r355514749-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Ancient Architecture", "review": "It is a very ancient temple dedicated to lord Shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r355184995-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 2.0, "title": "Overhyped", "review": "The place is over-hyped. The drive from Binsar to Jageshwar is ~52 km (though Club Mahindra tells you it is 65km) and takes ~2 hours. Ancient temples with historical value but nothing extraordinary.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r358904903-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Good place to search for solitude.", "review": "Surrounded by mountains, the temples have an awesome view. The place is quite and beautiful. Good for people searching for solitude. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r357216073-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Excellent temple, worth visiting.", "review": "It is a very ancient temple with 108 Shiva lingas in big & small sannadhis. There is a Jyothirlinga as well as a Shakthi peeth too. Abhishek was performed by the pujari (Ramesh Bhat) with great reverence. We were very satisfied by the darshan we got. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r358086219-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "The underrated Jyotirling", "review": "This is a beautiful temple located in midst of sky-high deodar trees. It exhibits the extravagant stone construction of the mahabharat era. There is a confusion regarding the eight jyotirling. Enough claims suggest that this is the actual 8th Jyotirling. Also, there are temples of total 108 jyotirlings in the campus. A must visit place from both religious and sightseeing point of view. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r360252924-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Heaven on earth", "review": "Travelled solo on Duke 200 from Delhi to jageshwar dham in a single day. Going onwards from kathgodam in car is risky as a normal truck brakage or anything can lead to massive jams. Hiring taxi from that region is useful as they are known to roads and turns. Bringing bigger SUV is big no as they need regular stoppage to give pass. Stayed in Radha tourist lodge. Well clean room. People are warm. They are greedy like people from U.P. Over all anyone planning to go, stay over a night to hear the birds chirping and if lucky you can see a tiger at night.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r364173293-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Cluster of Shiva Temples", "review": "These are cluster of shiva temples across the river admist pine tress. Very beautiful and divine. The temples are very ancient and you can also perform pujas here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r339577100-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Real divine place ", "review": "We have enjoyed the blessing of Lord Shiva by offering prayers amid chants of mantras here..amid hundreds of temple the grandeur of jageshwar main temple is immaculate....architecture of 8th century leaves spellbound ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r364579702-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Nice place", "review": "An the drive from Almora-pithoragar road to jageswar was just amazing. The place is beautiful too. Must go :)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r338100464-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Offbeat destination ..100+ temples in a complex..located in the middle of a forest..!", "review": "We decided to go to Jageshwar Dham since we were trying to explore a new place apart from Almora & Binsar..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r340830309-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Worth a visit", "review": "Am not a temple-going person but this ancient set of temples is worth a visit for the way they have been made and the pleasant surroundings.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r337190271-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Ancient temples", "review": "A special and sacred place - so many temples in one courtyard, something that is not common in northern India. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r337271096-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Lovely location", "review": "This temple located in the interiors and in the forest. The temple surrounded by tall trees and a complex of smaller deities is considered to be one of the sacred places. It is one of the jyotirlinga and was an interesting visit. We appreciated the architecture which was quite different from the South Indian temples. The place is worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r344030520-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Great temple ... In stone!", "review": "A temple complex with over 100 temples - small ones, right in one area!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r320792889-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A Jyotirlinga with a difference", "review": "An important temple at an unblievable location, must visit when in/around Almora. The dew freezes, great structures, good drive.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r340895501-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Very beautiful temple", "review": "First time in my life I visited a temple with such strong , positive and spiritual vibrations. It's a 1700 years old temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r347071979-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Abode of Mahamrityunjay", "review": "Visiting a cluster of temples( around 125 or so) nestled in the hills at this altitude  ,Mahamrityunjay temple being the prime one, is itself an amazing experience.there is also a museum at this place which is also worth visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r344712033-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Only 36 km from Kasar jungle resort is the 8th \"JYOTIRLINGA\"- Jageshwar dham. What a beautiful serene place!", "review": "Amidst cedarwood forest and kumaon mountain ranges lies a small town with 108 shiva linga temples and temples of Ma Parvati & Hanumanji. It is the 8th jyotirlinga. Priests are non-obstructive and do not pounce on you for dakshina/puja/sankalp. You can sit in the temple for as long as you want and pray. One of the best temple complex in India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r344653537-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "a slice of heritage , devine experience", "review": "its a divine experience to visit Jageshwar. we drove on a two wheeler form Almora to Jageshwar which is about 30kms away. the drive is beautiful and enjoyed it thoroughly. the temples a re 400 years old and dedicated to lord Shiva, the temple premise has about 100 small and large temples in it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r317791827-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "A visit to Jageshwar Dham is very fulfilling. Its a very old temple, more than 1000 years old. The environment is clean, the temple is open for all visitors and no fee is charged, unlike temples else where.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r324860304-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Smaller than I thought it would be", "review": "The temple complex is smaller than I imagined, but the road was beautiful. If I went there again, I would get off at the first single temple, and walk to the cluster at the end while staying on the forest side. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r327931283-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Majestic rock cut temples against a pretty backdrop of Deodar forest", "review": "It’s a gateway to the amazing architecture of bygone India. Can heartily spend half a day admiring the temples. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r326410579-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing", "review": "A photographers delight. Wish the complex would get rid of all the electrical wires pulled overhead. This is in direct conflict with the otherwise pristine beauty of the ancient structures and mars its beauty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r327744217-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "One of the 12 Jyotirlings", "review": "A very old set of temples typically made from slate stone slabs in the middle of the forest and besides a stream. Took us two hours on a scenic drive from Almora. A pristine envioron ment among the pine trees gives you a breathtaking view. Ensure you go in morning as it gets dark soon by the time you reach if you leave Almora town in the afternoon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r334010521-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing temples amidst exhilarating atmosphere", "review": "Jageswar Dham Temples are the star attractions of Almora. Almost 35 km away from Almora and situated at a valley full of Deodar trees, the structure of the temples, almost 1000 yrs old, mesmerized us. There are almost 140 temples altogether in the complex. And Jageswar Jyotirlinga is there. The old pine tree reminds of its old existence. The road is good and there are so many hotels, a KMVN too. You feel free to touch the Jyotirlinga.  A must visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r330435078-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Heritage Temple", "review": "On our way back from Kailash Yaathra, we stayed for a night at KMVN guest house and all of us visited the temple. We were just in time for Aarti. At same time aarti is done at most temples in the cluster We went to Jyothirling and Triambakeshwar lingam. The town and shops around were very pleasant", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r309273337-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 2.0, "title": "No big deal", "review": "Its a group of temples that are a few hundred years old. There is no architectural marvel here, at all. The place might be of interest to the pious, for worship. Thats it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r329454513-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Divine place in depth of nature", "review": "Awesome time spent here during aarti of Lord Shiva......waterfall behind temple is beautiful. Place of nature lover......you would love to lost there for some time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r309745707-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Holy Abode to Heaven", "review": "Famous for the one of the oldest Lord Shiva’s temples in India, Jageshwar dham is a must visit destination in this part of country. This temple is around 33 Km. from Almora and is a beautiful place to spend a couple days. This temple seeps to be situated in the laps of the Himalayas & is surrounded by the huge mountains & pine trees. The temple is made of stone and is open from early morning till late evening prayers. The evening prayer “Aarti” is a magnificent event that one cannot afford to miss when he / she is there. There is a naturally carved idol of Lord Shiva in the temple. Jageshwar Dhal is one of the 12 Jyotirlinga’s of Lord Shiva.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r311714961-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Old Temples", "review": "One of the old and forgotten place. I visited with my family and its was good experience. Old structure and worship place", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r333431732-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Heaven walk their. ", "review": "Beautiful temple collection.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r313968560-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Great spiritual experience", "review": "It was a divine experience to visit this 7th century temple to witness 123+ shivlingas in one campus. The main 2 temples i.e. Mritunjaya temple and jyotirling temple made our visit worth it. The pandits there were also very polite and genuine. We went at this time when there wasn't much crowd so we also enjoyed the peaceful darshan here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r315588904-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "If you believe in religion, god. then you should visit this place. A very silent place and you will feel out of the world.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r314200923-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temple ..Admist of Deodar forest", "review": "One of the  12 Jyotirlinghas,the temple provides a beautiful view ,surrounded by Deodar trees and snow capped moutains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r316769063-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Good temples", "review": "Good view. You must see this temple during your visit to almora. It is almost near to Almora distt and very ancient temples.Shivling temple, Kubair temple and other temples. You can perform ruderabhishek to shivling.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r314333974-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Absolutely Blissful !!! ❤ ❤ ❤", "review": "WoW !!! Wonderful group of Temples !!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r287066623-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A Pilgrimage town, 36 kilometers from Almora, has a cluster of 124 beautiful temples of 9th13th centuries.", "review": "Jageshwar Dham is about 36 kilometers from Almora and is on the way to Pithoragarh. One can visit this beautiful temple town either on way to or from Almora to Pithoragarh or if one is located at Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r285698883-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Temple in dense forest", "review": "Jageshwar Dham is a Lord Shiv temple and said to be one of the 12 Jyoterlings.It is situated in dense forest and approx.32 km from Almora .At least 50 % route from Almora to Jageshwar passes through dense forest.Temple is very old,neat,clean and pooja is done by priests without any greed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r317090000-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "One of the twelve Jyotirlingas", "review": "Very famous Jyotirlinga. In the temple campus there are around 120 shiv lings. Beware of the priests. They just want to extort money. Every priest would want to put a Tilak on your forehead and the ask for Dakshina (Money).", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r316018491-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Serene and calm!", "review": "Located about an hour journey (approx. 35 km) from Almora on Pithoragarh road, it is situated in lush green forest of Deodar. 124 temples, big and small, consructed approx decade century ago. Shiva is worshipped in the form of Nagesh/Jageshwar. In the sanctum sanctorum of the temple, the Shivlinga is divided into two parts. The larger one depicts Shiva and smaller one his consort Parvati. An Akhand Jyoti, (an immortal flame) burns in the temple. There are two Asthadhatu statues of Chand Kings Deepchand and Tripalchand in the standing posture behind the Shivlinga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r290584330-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jagrat Shiva Temple", "review": "The Jageshwar Dham is in Almora district of Uttarakhand.We six members visited Jageshwar dham . Beautiful village with lush green forest and tall deodar trees.Within cluster of 124 temples is this Mahamrityunjay Shiva temple .Shiv lingam is placed in rectangular Jaleri , and the priest did Abhisekam with slokas , mesmerising us.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r287462317-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Ancient temple amidst forest", "review": "Jaggeshwar dham is a group of temples dedicated to several gods and godesses. like Mrithyunjeya, Kedareshwara, Baleshwar, Lakulesha, Navagraha, Lakshmi, Navadurga,Pusti devi and Kubera.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r294077339-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Ancient and powerful", "review": "If you are in Kumaon this place is a must-see! One can feel the centuries of devotion, the magic of the rituals and the somewhat austere beauty of the ancient temples", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r297420795-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jyotirling", "review": "Built in 7th Century , Lord Shiva Temple and one of the 12 Jyotirlings . Om Namah Shivay . Its 30 Kms from Almora and drive is amazing .  Over 100 structure of 7th Centruty is was constructed by Chand Dynasty .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r291663867-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "HAR HAR MAHADEV", "review": "jagrshwar dham is very holy place.i feel blessed to went there.there are so many temples n every temple has its own GARIMA.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r301028315-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwar Temples in Uttarakhand", "review": "Jageshwar is actually a cluster of about 120 temples dedicated to numerous Gods, chief among them being Shiva. Famous for its Jyotirlings, Jageshwar draws pilgrims from every part of the country. It in fact is regarded as one of the Dhams, pilgrimages, in the country. The temples are one of the oldest in the country, dating back to about 2500 years.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r306341011-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Awesome place to visit", "review": "Really awesome location, if you want to enjoy natural beauty then this place is for you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r302349155-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Simply in the laps of nature", "review": "A mistic feeling amongst the huge trees which make you feel so trifle. ...reminds us of our culrural past", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r278410923-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "A day with Lord Shiva !", "review": "Jageshwar Dham is one of the 'Jyotirling' of Lord Shiva that exists in India. Lots of greenery around, the only place with 100+ temples in the same area. A must visit incase you are in Almora !", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r280118617-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "excellent group of ancient temples at such an height", "review": "excellent group of ancient temples at such an height. How could these exotic temples remained intact from invaders!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r280310557-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "GREAT TEMPLE", "review": "Great historical hindu temple near to almora utrakhand,very good temple & great museum near to jageswar temple...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r278731559-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham", "review": "Old mandir with centuries old relics. Next to a rive with great architecture. The cluster of Mandirs are entirely made of stone with no bonding agent. Amazing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r283515215-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "visit to Jageshwar temple", "review": "beautiful ancient temple. nestled amidst deodar trees. very old Shivling. very nice picturesque location. must visit place for people visiting almora/ranikhet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r282327630-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Beautiful Temple Complex of Historical Value", "review": "This is dated temple complex in middle of Cedar (Deodar) forest in remote town of Jageshwar. It is amazing to see temples which have been built 100s of year old and still standing firm. Worth visiting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r280796183-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "excellent place", "review": "around 35 KM from Almora . Very good road . Not so crowded place . Visit all temple inside . If you keep visiting temple of shiva it is a must visit for you ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r283914492-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "The missing Jyotirlinga", "review": "Having been to Nageshwar in gujarat, I thought I have been to the jyotirlinga as mentioned in shiva purana, but luckily I visited Jageshwar and realised the real meaning of the sanskrit shloka- सेतुबन्धे तु रामेशं नागेशं दारुकावने which clearly says that Nageshwar is situated in the forests of  दारुका or Deodar which can never grow in the plains of Gujarat & hence the temple at jageshwar is the real jyotirlinga. This place has a collection of more than 100 ancient temples and a small river nearby making it a popular picnic spot. This is the place where the shahid-amrita rao starred movie Vivaah was shot. Overall it was a very satisfying visit having visited the missing jyotirlinga.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r282653920-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Must visit if you travel to Almora/binsar", "review": "Very Nice and serene place filled with spiritual energy. The group of temples are beside two rivers which joins at a point and they are clean!  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r285561313-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Bam Bam Bhole", "review": "Must visit a great temple, beautifull atmosphere, surrounded by trees and stream of fresh water lot of birds, and not to miss to take the lunch by the road side small hotel, which serves very tasty food  without onions and garlic. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r270325370-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "more than hundred temples at one place..", "review": "Explored this place enroute to patal bhuvneshwar from almora with the family. It a collection of many temples at a single site...small and big...each temple having its own pandit..lovely scenery around with big, tall deodar trees around and a small river in the background.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r266397199-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "beautiful clean temple and natural beauty", "review": "Very neat and clean temple, Take a small walk to enjoy the nature, the shop owners are making the location dirty by disposing the garbage in the river and spoiling the natures beauty.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r273931319-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Magical", "review": "The ambience & setting in the evergreen forest, really makes the place magical. Although the constant demands by the priests do get tiring, one also realises that the entire region depends on tourism as a livelihood. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r271715695-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Beware of priests ", "review": "Beautiful historic gem and really amazing to see. It's a gorgeous visit to India's ancient heritage. However beware of pundits who try and lure you to offer prayers into each temple (there are too many to count) each pundit then demands a monetary offering which defies honesty. I would recommend going into this heritage site, but not getting too wrapped up into the religious babble. You will feel like you've been cheated, and rightly so if you agree to what each pundit there says. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r274367313-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Shiva in the midst of Deodhar forest", "review": "One must visit this cluster of temple ( almost 1000 years old) more  from the perspective of location, scenic beauty . Avoid doing any puja there . I must admit that the surrounding of the temple have not been maintained well. Having visited this place one can avoid going to Vaijnath temple near Kausani. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r271502886-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Mystical experience, takes you right into the myths.", "review": "Frankly speaking; when I heard of this place I wasn't very excited and I expected this to be a normal temple with loud colors and priests everywhere. But it was completely opposite, Jageshwar is the most beautiful temple complex I have ever seen in my life. It is not a temple. It is a complex of more than a hundred Jyotirlingas or Shiva's phallic representation. Built in the ancient era it has interesting things to see such as the little hut like temples and beautiful Deodar trees. The best sight to see here is the tree that bifurcates from the same root. It has the significance that these two trees represent Lord Shiva and Goddess Parvati. It also has an inflow of the river Ganga or called Jata Ganga as it is the river flowing through the hair of Lord Shiva. It also has the \"Hawankund\" where Luv-Kush and Ravana worshiped the fire-god. The experience is mystical with clouds and it is isolated from the rest of Almora and Binsar. Strongly recommended for Hindus and foreigners. :D", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r275493480-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Good Place", "review": "Liked Natural surroundings, Liked ASI museum, Disliked broken road to KMVN tourist banglow, dirty roads, ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r274616820-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Heaven on Earth", "review": "Oh! I cant explain what I have missed in my life. Serene and pure. The oldest archaelogical temple of India. More than 100 small and big temples in a place. The main temples are Mahamritunjay and Jageshwar temple. I am still leaving in the beautiful experiences I had there on my visit. As a Shiv devotee one must visit here once in his or her lifetime and must perform Rudraabhishek. I gaurantee you will find the difference in your life. Om namah Shivay.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r254616664-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Enchanting with the chants of OM NAMAH SHIVAY", "review": "distant but great journey enroute to chant om namah shivay.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r254683584-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temples in the snow", "review": "A beautiful and peaceful temple complex we were fortunate to see with snow on the ground adding extra texture to the ambiance. The walk around town and up into the hills made this a wonderful day trip from Almora but in warmer weather I think an overnight stay would be great.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r257854746-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Serenity!!", "review": "A truly blissful experience- away from the hustle bustle of popular tourist spots. A calm and scenic place. Get lost amidst the Deodars and take heaps of fresh breath in.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r259201186-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A treat to senses", "review": "100+ temples of Lord Shiva , peace and tranquillity , clean and beautiful environment. A must if you are a Lord Shiva follower and like nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r255910837-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Temple of Lord Shiva", "review": "Its a place for devotees...... temple of lord Shiva... place of peace... best time to visit in summers... and july for sawan mela...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r266159818-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Temples galore!", "review": "Some one told me there are supposedly 125 temples here in this location. Relatively clean in the temple area but I wonder why the gatekeepers are silent spectators to dozens of local mongrels freely roaming about inside the complex, fighting, fornicating and scavenging. Spoils the atmosphere as if you have small children you would be more concerned with the dogs than the Gods!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r237354816-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Peaceful Temple", "review": "Beautiful and Very old temple of Lord Shiva. The temple complex is charming and antiquated with fine samples of ancient iconography", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r263354378-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jyotirling, must visit", "review": "To get a sense of timelessness, come here. Great old temple, with towering deodars standing guard like sentinels over the centuries. You feel truly humble after your visit to Jageshwar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r237235486-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jageshwer (Valley of temples)", "review": "Jageshwer is about 34 km. from Almora. Surrounded by majestic  deodars. In the complex of Jageshwer there are 125 temples. The majority of the temples are dedicated to Lord Shiva and a few of them dedicated to different Goddesses. All the temples are dating back from  7th, to 11th century AD. This impotent holy place is considered to be one of the twelve Jyotirlingas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r239217706-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Veryyy Old Jyotirlinga and well maintained by ASI", "review": "This is 1000+ year Old Jyotirlinga (1 of 12) - some say its from times of Mahabharata (rebuilt later in stone). Nicely maintained by ASI. There is a museum nearby for statues excavated from its viscinity from 8-10th century. Lots of monkeys in the premises. Approach to temple is very beautiful - lush and sky-high Deodar trees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r264667860-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Amazing temples", "review": "We visited Jageshwar twice - the first time was a chance visit and the next time was a more planned one. In the second visit we stayed at Jageshwar and saw the temples with a lot of time at hand. There are basically two temple complexes with some nice ancient temples surrounded by Deodar trees.  The staying options are mainly KMVN and local lodges but a new Eco camp also has come up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r246290356-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "nature and spiritual delight of india", "review": "Enjoyed the cold breeze of Himalayan valleys of binsar..it is lovely place in start of winters not crowded like other areas and enjoy Himalaya range view to give you unfogetful experience of life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r242191656-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Picturesque Location, Lord Shiva's temple", "review": "Awesome location, Nearly 35 KM from Almora city. Road to the Jageshwar dham is in good shape. On the way you can enjoy the  scenic views of hills and river. I have travelled with the family in Dec last week and also enjoyed the snow on the way and at Jageshwar Dham. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r246924439-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Awesome place", "review": "Guys after visiting this place I realized just how beautiful our country is. peace, beauty and serenity is what this place is all about. If you like beautiful drives, please take this road. A road less traveled is actually the road which brings you joy. After this trip I can truthfully say that me and my wife have found, what with our hectic life, that we still enjoy each other company. Thank you so much Pratish for that. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r260790151-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Our Heritage ..Our Pride..", "review": "Please dont miss this place...the location is beautiful...and the dhabas..here serve the best food...we have had in a long time..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r209516514-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Cluster of temples amidst the forest", "review": "Scenic drive to Jageshwar that has a cluster of ancient Shiva temples and a museum right across the road from the temple. Well preserved artefacts in the museum with appropriate cataloguing. The recent snowing in Kumaon added to the attraction", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r248748623-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Jarry Jageshwar", "review": "For a place as serene and pious as the Jageshwar temples, the over the top commercial ambience around the temple complex is getting worse by the day. Discipline within the complex is very ill maintained. Add to it horrible lasers to light up the temples in the evening and these (some) 200 temples, steeped in history though structurally intact, are actually falling apart on metaphorical plane.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r251108253-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham One Of The 108 Jyotilingas", "review": "Jageshwar Dham is located at a distance of 36 KMS from Almora... it is one of the 108 Jyoti Lings of Lord Shiva... the temple is mainly dedicated to Lord Shiva... It is a cluster of 124 large and small stone temples... the temple is set in a picturesque location surrounded by rich and log deodar trees.. there is a small river also flowing right behind the temple... the temple looks like is situated in a deep valley... its a must visit temple for all travelers & nature lovers...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r250596836-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "must go", "review": "it is a must go. you can enjoy the architecture. cleanliness  of the temple. you will find your peace of mind there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r211519608-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Lap of Nature or say Lap of Almighty", "review": "Jageshwar Dham located around 36 kms from Almora is a cluster of 124 large and small stone temples primarily dedicated to Lord Shiva. Set is a picturesque location surrounded by rich deodar trees and small river flowing right behind the temple is a must visit for any nature lover. The drive from Almora to Jageshawar is scenic and comfortable. The place can be visited when you are staying in Binsar. Visited this place in early December with family and it was dam chilly. One has to take care of kids as shoes are not allowed inside the temple compound and the flooring which is stone flooring can be dam chilling.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r250157831-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Marvellous place", "review": "We stayed in the night. Not very good hotels over there. Just some lodges but the sweet sound of river flowing and the awesome weather makes everything forget.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r219177713-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Wonderful experience", "review": "Beautiful scenery all around and still not polluted by hoards of travelers. Stay at Kasaar vallel/Binser and visit this place as a day trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r213717353-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Historical Place  Awesome route", "review": " It is among those places where the route is more beautiful than destination.  Generally people go by taxi... I suggest take a 3kms trek,  from Tartola... Surely you would love the route", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r232466768-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Nicely built old temple", "review": "Very old and nice temple. Amazing darshan but only drawback is that pandit ji are too demanding & commercialized", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r223446483-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Temple", "review": "Road leading to temple approx 3 km from main road is simply beautiful with trees and dense forest..Temple equally is beautiful with a river stream flowing at back side which one can visit by entering temple premises..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r228397963-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "nice site, needs more maintenance", "review": "Jageshwar temple is historic temple and believed to be one of the jyotirling, although this claim is disputed. The temple comple is quite small, can be covered in under an hour, unless you want some special puja done, which will take another hour. If you want Maha Mrityungaya rudra, then add another hour. The place needs lots more maintenance, but was reasonably clean and the temple priest are very knowledgeable and nice, no fleecing here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r232806432-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Supremely Spiritual", "review": "There is a spiritual charm about this place. Lots of history, mythology, devotion and architecture around. Do not forget to visit the Archaeology museum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r234322544-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Trekking opportunity", "review": "Although the recommendation was to travel to Jageshwar, we decided to visit the older Vriddha Jageshwar temple and then trek to the Jageshwar temple complex, after sending our car to wait at the KMVN.(Tourist rest house) We weren't disappointed by this choice. The trek was beautiful and peaceful and the distance took less than an hour to cover. Here are somethings to remember while doing this trek:", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r177400332-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 3.0, "title": "Ancient Temples", "review": "The buildings are ancient and there are few trees about 1200 years old as per the local people. Nothing out of the ordinary but since there isn't much except the weather and views of the Valley in Binsar we visited here and it was god.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r233393276-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Visit Jageshwar Dham while you are in Almora", "review": "Jageshwar dham is mainly famous for Shiva Temples. But it can be beautiful place to spend a couple days in tha lap of Himalayas. You spend time near the river bank which runs through the place. Trek around nearby villages. Trek to Old Jageshwar where the temple situated inside deep forest give panoramic view of Himalayan peaks. The temple is open form early morning. we went for Arati at the evening. it was worth seeing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r179471559-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham Temple... More Than 200 Years Old Shiv Temple", "review": "Jageshwar Temple at a distance of 33 KM from Main Almora is situated in a very very peaceful environment covered with huge Pine trees.... This is a  200 years old temple... apart from the idols of Lord Shiva... it has an ancient idol of Lord Ganesh in which the trunk of Ganesh is on the right side.... this is the oldest statue of Ganesh.... even older than the one at Sidhi Vinayak Temple of Bombay.. This temple is also the home of 81st Shakti Peeth  of 108 Shakti Peeth of Mata.... The priest told us that the idole of Mata changes the face expressions three times in a day... and that it is practically proven & not any saying.... this is one of the finest temples of Almora & anyone visiting Almora, must visit this sacred place....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r180894689-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "ancient place", "review": "124 temples at one area. this is ancient historic temple. thanks to archeological department, govt. of India.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r181235125-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Historic temple complex", "review": "Clean and picturesque. An ancient tree in the courtyard, said to be many thousands of years old, made for a good photo. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r202212095-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Best place for Students of Archaeology", "review": "This is one of the oldest temple in this Country built almost in the 12th Century. The temple has beautiful idols of all Gods and Godesses. The temple has a beautiful landscape and a river flowing besides it. The place has its own charm and you will feel presence of god at this temple. The temple has one of the finest sculptures and has great history behind its creation. This is one of the ideal places to visit in Uttarakhand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r184768822-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "what to say!", "review": "Its a dham so obviously its going to be really well managed. car goes right till enterance and parking is close by.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r205036261-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A peaceful temple of Lord Shiva to visit", "review": "Jageshwar Dham is an ancient temple of Lord Shiva... Its an excellent temple to visit.... this temple is exactly in the lap of the mountains... wherever you see, there are mountains and mountains only.. this temple is under the ASI as it is very old built up.. it is an all stone built up temple.... one must visit this temple at least once... By the grace of Shiv Ji we have visited here three times....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r165400471-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "A group of ancient temple", "review": "Its a group of temple. calm and quiet environment. no more bargain or touts near temple complex. one can spend only 2-3 hrs in the temple which is enough for doing some pujas", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r181549186-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 4.0, "title": "Abode of Lord Shiva.", "review": "Jageshwar Dham is located about 36 km from Almora. It is a holy place for the Hindus, and is believed to be one of the sites of the 12 Jyotirlingas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r191784057-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Jageshwar Dham", "rating": 5.0, "title": "Jageshwar Dham-- A Lord Shiva Temple", "review": "Jageshwar Temple is complex of a main temple (resident deity) with many small temples of deities of lesser hierarchy. This temple dedicated to Lord Shiva with his Svayambhu or naturally carved idol. Since it is also a Jyotirlinga, its importance becomes multiplies ten times.. Jageshwar Temple is situated in the lap of a valley & is surrounded by the huge mountains & pine trees... A must visit place for the travellers of Almora as the beauty of this temple & location is worth seeing... It is situated around 32 KM from Almora...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d4401132-r199494645-Jageshwar_Dham-Almora_Almora_District_Uttarakhand.html"}]