[{"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Trekking plus cool place", "review": "Nice trekking... first rays of sun fall on the Garbh of temple. Beautifully maintained. Though lacks water,, Carry your own.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r615153260-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Difficult to reach", "review": "Please be ready to walk at least two kilometers hiking to reach this temple. Not advisable for old age people, kids or problems with joints or legs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r609597574-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Sun Temple built by King Katarmalla", "review": "Katarmal Sun Temple was built by the Katyuri king Katarmalla.It is about 17 km away from Almora.It is considered as the second most important sun temple in India after Konark Sun Temple. It is believed to be the only sun temple located in the hills. A 2 km steep climb is required to reach the temple, which is placed at the top of the hill. Main deity of the well-designed temple is the old Sun God.Intricate carvings can be found on pillars, walls, doors and panels. Paintings and beautiful sculptures made of stone and metal showcase the level of artistry achieved by the artists of that time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r598887047-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Splendid", "review": "We visited Sun temple while returning to Delhi. From the main road it's a bit far and not very easy to driver. I am not sure it would be better now as roadwork was going on at that time so we had to walk a lot. Going by road is longer than compared to walking. Walking is easy there are not much stairs. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r618346496-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Must Visit Place In Almora ", "review": "Hindu temple to the Sun God built in the 9th century, comprising many carved stone structures Mandir is open till sunset to sunrise. On top we wl get attendant who can guide you regards the Mandir history. One of the must visit place in Almora. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r627602290-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Ancient Site near Havalbagh", "review": "Ancient sun temples accessible after a bracing climb through ancient stone steps. Must do during your visit to kumaon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r642746929-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Architectural Marvel", "review": "It is one of the few remaining Sun Temples in the world and is absolutely exquisite. Place is quite out of the way and you need to have proper information how to get there. We were going from Nainital to Kausani and since our driver was knowledgeable about this region was able to guide us here. You have to have a short trek of about 1 km to get to the place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r543137980-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Sun temple", "review": "this temple dedicated to the sun god is second only to konark temple in india. one needs about a day to and fro almora to visit this place but it is worth the travel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r557509218-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "SUN TEMPLE OF HINDU", "review": "Located 17 Kms from the city is 800 year old is the 2nd in importance after the Konarak Sun temple in India,the temple is known for unique architecture and beautifully carved sculptures on the wooden pillars the idols of Shiva & Parvati found here,one has to need trek to reach the temple from the main road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r530096769-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Amongst oldest sun temple in India", "review": "Indian art and culture is always appraised by people who have visited this country and places like sun temple speaks for itself.even if we don't deep dive in history still monuments from past are proudly stands and reveal the intelligence commitment and knowledge.must visit place add to your bucket list.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r644644469-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Trigonometry Undeciphered, Archelogical Heritage", "review": "Kumaon Division, in Almora District, has a hidden treasure in terms of archaeological importance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r650809173-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Its a beautiful Mandir", "review": "Its a beautiful temple. Comes under archeological survey of India. Bit out of road. You need to climb a bit from Motor able road. Scenic beauty fro the temple is beautiful. Its an original old Surya Mandir.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r535847805-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Mysterious", "review": "15 km motorable road from Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r577578779-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Mysterious, Splendid, Unusual ", "review": "Sun temple which is not a common site to witness. In katarmal, not so far from Almora, they have an old sun temple of the bygone area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r558162830-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "A must see heritage temple - clean and beautiful", "review": "Katarmal Sun temple is located on a ridge near Almora.   The access to this place is via Kosi village and behind GB Pant Institute.  Built by the katyuri kings, this temple is from the 13th century.  The statues of various deities are kept in the main sanctum sanctorum.   There was a priest and since it is not a frequently visited site unlike other Hindu temples it was very clean and beautiful", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r582793040-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Peaceful", "review": "up on the hillside, a walk up a path glistening with mica, bouganvillae & pomegranite trees around, once again quiet, no crowds, the ambiance was unbeatable.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r577627603-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "WOW", "review": "Simply wow, beautiful old temple with great structure. It resides on almora road. It can be visited easily either by almora or ranikhet. One has to leave vehicle and walk upwards passing by small village. It's beautiful surya temple. Must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r468635612-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 3.0, "title": "Very old temple with good views around", "review": "Nothing spectacular here as well. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r588414590-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Katarmal Sun Temple", "review": "After seeing Konark Sun temple in Orissa, I had a natural curiosity about this temple on the top of the hill. The drive from Almora is about 16kms, will take about 40-45 minutes depending on the traffic. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r589429720-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Kosi Katarmal", "review": "Katarmal Suraya temple is a ninth century temple constructed by means of Katarmalla, a Katyuri King. showing the architectural fashion of historic artisans. This Hindu temple is situated about 2100 meters above sea stage and is located at a distance of 20 kms from Almora city. it's far second one maximum adorable shrine in India, after the Konark Sun Temple. When the first Sun rays fall on Katarmal Surya temple it enlightens as historical idol Sun god called \"Varddhadity\"  temple is positioned in Almora  3 km a far from Kosi Village.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r456685657-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "A MAGNIFICIENT TEMPLE", "review": "The temple is magnificent. But the connectivity is very poor. since most the the artefacts have been shifted to Delhi, a bit disappointing after a arduous climb", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r473343976-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Temple ruins - must see", "review": "We visited the Katarmal temple in May17. This is part of the Almora tourist circuit. The roads leading (final 2 Km) to the temple are now leveled, not tarred and the drive is easy. We got down at a point and trekked up a small mound to reach the temple. It is a 13th century temple - dedicated to the Sun god. Gather that the architecture is similar to that seen in Badrinath. There is no priest there - but the temple is functional. Good spot to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r485818955-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Good View from Temple", "review": "One has to walk may be 1 km or so to reach katarmal Temple. The walk is not steep and it ascends gradually. The temple is historical and provides good view of the hills around. Must visit place at least once.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r391610021-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Nice sun temple !", "review": "One of the sun temples in India. The temple needs a small 1 km trek and near kosi town. It has an idol of sun god in sitting position .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r490317120-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "A Hidden Gem in Need of better connectivity", "review": "One can visit the temple when in Almora/Ranikhet. We drove to Katarmal from Binsar(approx 35 Kms), there is a single sign board present at the site. Since there is no proper approach road built, the last 1.5 Kms drive uphill in nothing less than an off-roading experience with big stones lying on the road. Upon reaching the top of the mountain, one has to trek through a small village through a narrow road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r478187700-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Katarmal Sun Temple", "review": "Definitely not to be missed, the main highlight of our visit here. You could stay for a long time here indulging in photography, there are not too many folks around considering its accessibility but the precincts of the temple and some of the images are truly beautiful", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r490378467-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Gorgeous, one of its kind temple from 8th century.", "review": "There are four or five sun temples in the world. This is one of them. Built on top of a hill, looks very non-descript from far. But nothing prepares you for the awe when you actually see this in person. You wonder how they would have managed to build it on top of a cliff, without availability of today's technology. Little trivia- This never got completed for some reason, so what you see is an incomplete structure. and although this shows in Almora, include this in your itinerary even if you happen to be any where near Jageshwar area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r495327516-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Adventurous", "review": "900 years old temple which was been discovered by people in 2005.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r504333936-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Truely a hidden gem", "review": "Not very popular with tourists, this place is a must visit for heritage lovers. It is among very few sun temples on this planet and sun is worshipped here as \"Vridhaditya\" ( meaning old sun ). The temple is believed to  be constructed by Katyuri king Katarmalla.  Most of the ancient temples including Baijnath, Bagheshwar and Jageshwar  built in Kumaon region are by Katyuri kings but surprisingly this contribution of the Katyuri kingdom is not found properly documented in our history books. Keen photographers of ancient structures, pack up your lenses and tripod and spend some time here to capture some marvellous pictures with plenty of natural beauty in the backdrop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r391754600-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 3.0, "title": "1000 yr old  temple - Not mainteined so well", "review": "off the beaten track , this temple is the 2nd sun temple, but is hardly maintained. there seems to be damage to the idols and this place needs a serious revamp and govt care. The approach road of the last 2 kms  is  horrible too", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r443012196-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Hidden jewel", "review": "We had read about this old temple, and decided to visit it during our trip to Ranikhet. The visit was indeed memorable. We had to stop our vehicle at a certain point on the winding roads, and travel by foot to get to the temple, beautifully camouflaged against the brownish moutainside. The temple premises were neat and clean, and there was hardly anybody there, as it was off-season (August). The views are breathtaking as well. A must visit for anyone interested in old temples!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r423862491-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Only Sun Temple in North India", "review": "One more attraction near Almora, little off from Almora-Kausani road. Historic Sun Temple preserved by Archeological Survey Of India. A must visit if if you like history", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r445151464-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Perfect offbeat spot in Uttarakhand...", "review": "Hidden inside cluster of hills in Almora, Katarmal Sun temple is the perfect offbeat destination. Visit here is all joys and a question that how such a massive structure would have been erected at this place, Kudos to technological acumen in ancient India. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r442764435-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Gorgeous temple, off the beaten track", "review": "Beautiful collection of temples- lovely architecture and great location. It was a bit tricky finding it- there is a small board on the side of the road just before you reach the GB Pant Institute while driving from Ranikhet towards Almora- about 2 km drive on a dirt track and then another 1 km hike through the village. The hike trail is not well kept- trash and cowdung in places but once you reach the temples, it is worth the effort. There is one big temple and 40+ small ones in the complex. All idols have been removed from the smaller structures and are kept locked in the big one- there is an ASI guard who will open it for viewing. The temples are circa 13th century - very beautifully made and somewhat similar to the Jageshwar temple style. Great views of the mountains from here. And no pujari/pandit to bother you while you enjoy the place!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r436487927-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Katarmal Surya Temple", "review": "26 Dec 2016 - An excellent and must visit aite. The road to the hill top to the temple is under renovation and will be wider soon. Still you have to climb/walk about 300 metres through the village road to reach the temple. But its worth.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r448742732-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "The Sun Temple.", "review": "Little off track, have to plan separately for The Sun Temple from Almora. But the ancient infra is more than worth reaching, that time the connecting road was getting constructed, hopefully it must be there now. Beautiful Mandir.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r411117215-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Mystery Temple & a strenuous hike", "review": "If you ar egame for a good morning hike, take a bus to the bottom of the ancient Katarmal temple where the mighty Kosi flows in full fury. You start the hike towards one of very few temples in the world which are dedicated to the Sun God. I was intrigued and went ahead with my friends. If you are not a regular walker you will face some challenges, do take good shoes with you to ensure you dont face problems in skidding, take enough water as you may need it. Once you reach the place the view is magnificent & worth the walk. You can easily stay for 2-3 hours having the almost 180 degree view of the valley and you will never grow tired of it. The temple is not in pristine form and is Khandit, so no worship happens prima facie but you may find occassional locals bowing to small idols kept by local priests at the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r334011864-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Peaceful, beautiful temple", "review": "Not well marked on the road and we could have easily missed had we not known about it. The road leading to Kararmal is a mud track but our car could reach the village. We were told a metalled road will be ready by end of 2016. The temple is about 20 min walk from the car park. Very peaceful place and the temple is largely intact despite earthquakes and the weather. Entry is free. No hotels in the area, though several resorts are coming up nearby and a tourism guest house has been constructed though not yet functional", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r364998056-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Good archeological site... but difficult terrain to reach", "review": "History written at the site says.. created by gods in one night during Raja Kartarma dynasty. Inner sanctum lights up with first light in the morning from a small opening at front. Good place but 3 km rough patch uphill is a difficult terrain to travel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r345562080-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "It is also called the Dandeeshwar temple, I think.", "review": "It is located just a kilometer from the main temple on the road to Nainital. It is good to visit and the vibes are good..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r358087128-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Just 3 Km from Hotel  Shivalik River Retreat", "review": "Katarmal Sun Termple is just 3 km from Hotel Shivalik River Retreat Kosi ,it is very anicient temple and under the archology of india .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r341393464-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 3.0, "title": "Why the Sun in a place which is dominated by the presence of Shiva, Kali and off course some local deities.", "review": "If someone says that the rays of a rising sun fall on the deity, I am curious as it can not happen on all days of the year unless the deity is sitting under open skies !  So what is that particular day ? That is my usual curiosity.  Even the ASI does not appear to appreciate the point.  The hole meant to illuminate the deity does not see the sanctum sanctorum from any sun-rising points !  Also, in the absence of information on the height/dimensions of image of the original deity, it is difficult to really believe the story.  Still I am inclined to have some confidence as the locals celebrate the event on the last Sunday of the Paush month when it could have been possible, but the restoration work, I doubt has done little or almost no justice to the astronomical phenomenon. I visited the place towards the end of January, 2016 and as an Astronomer I am willing to to do further exploratory work on  the site. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r350590165-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 3.0, "title": "Sun temple_need maintenance", "review": "Sun temple is very old and made by rocks. Trek distance is only 1.5 km but it took 2.5 hrs to finish the trek. We found some small village during the trek. You can easily find water and chips on the shops. This temple needs very care and maintenance.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r333452424-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Ancient temple - worth the drive/walk", "review": "This temple from the 9th/10th century, takes you back in time.  The architecture of these temples is distinct for all temples built in this era and area.  While the deities are all gathered in the main temple and the smaller temples around are empty, you are immersed immediately in the antiquity.  It is important to know that the approach road seems bad and drivers tempt you to turn back, but the drive and the walk after is worth it.  Overall, the temple is on par or better with many other much better known or marketed ones.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r372716143-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Solitude signified", "review": "This beautiful temple in  Almora is not a tourist thronged destination. I have been there thrice and always found it peaceful and deserted. ASI employees are always around though maintaining the solitary structure. Please don't take a taxi to the top. Walk from the highway. It is a brief walk for 2 km approx.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r383345512-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Trek to Katarmal", "review": "Katarmal is one of the handful of Sun temples in India.  The main carved doors of the temple have been taken away and placed in the National Museum. I trekked up to Katarmal with my cousin from Kosi on the Almora-Ranikhet road.  The temple is atop the mountain and blends with the environ like the ellora temples.  If you strain your eyes and focus hard the temple complex can be seen from Kosi. The temple is an architectural wonder and is beautiful.  It takes about 2-3 hours to complete the entire visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r282630982-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Nice sun temple", "review": "Approx 18 km away from Almora, you can reach here by taxi, then walk for some more as vehicle cant go up to the temple. This Sun temple is quite old. It was built by KATARMALLA, a Katyuri Raja, in the 9th century. The main deity of the Sun temple in Katarmal is called Burhadita or Vraddhaditya (the old Sun God). The idols of Shiva-Parvati and Lakshmi-Narayana are also found in this temple. Katarmal Sun Temple complex has one main temple, surrounded by 45 smaller shrines exquisitely carved temples surrounding it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r293558123-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "ancient temple of sun god", "review": "it is an ancient temple dating back to 7th Century AD. it is also called Bara Aditya temple ( temple of 12 suns).", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r294080119-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Architectural Brilliance !!! ❤ ❤ ❤", "review": "Gravel road of about 3km from the tar road  leading to this wonderful temple on top of the Hill with fabulous views , very old temple maintained by military people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r288055429-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "An out of the way destination", "review": "This was an unexpected destination, at a distance of about 45 Km from Ranikhet, this is a large and completely offbeat attraction that not many know about. The view from this temple are equisite. Though the temple itself is small when you compare it to the Sun temple at Konark, it is still the largest in North India and has stark similarities to its counter part at Odisha. A visit to Ranikhet is not complete without a visit to this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r288784651-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Beautiful Heritage Temple", "review": "katarmal is a tiny village and you have to walk through it to reach to the temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r384556162-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "sun sun sun", "review": "It is around 16 KM from town . Last three KM road is not good but your car can go easily . after reaching the spot you have to climb the temple . No stairs to climb ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r283914028-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Ideal for meditation (if there are no other visitors)", "review": "I was lucky to have arrived when there was no visitors and spent a tranquil and delightful hour inside the acient walls of the  temple...Perhaps if I could have arrived around sunrise it would be even better....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r297423371-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Divine experience", "review": "There are only two sun temple in India other being konark temple in south India.This sun temple in katarmal is away from regular tourist places and is near to agriculture university, the temple was made by king in 6th century and every one should pay a visit there to pay homage to sun god and get blessings.The road in the end to temple is not so gud but still u can drive upto there, with view of pine trees u will feel refreshed.A must visit iam attaching pic here of my visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r311172071-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "beautiful place nearby our resort", "review": "Katarmal Sun Temple is must to see while your are in Almora Hills .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r237353167-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "THE SURYA TEMPLE OF KATARMAL", "review": "Katarmal is located at a distance of 17 km from Ranikhet , the nearest connecting point being near Kosi village. The final stretch of the road for about 3 km is not tarred, but can be motarable. In rainy season it would be very slippery. To reach the temple one has to walk through an uneven  rocky and steep path with steps in between. For elderly persons it is a bit difficult. After climbing the steep rocky path ,we came to know from the  security of the temple that the vehicle can go up to 3/4th of the distance. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r326262487-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Surprise in bushes of mountains", "review": "One will never realise  what he/she will see, while searching the location while driving through the mountains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r233862690-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Rare ancient architecture on top of hill", "review": "This is one very few sun temples in the country that too on the top of hill at a very high altitude. This is very old temple with pleasing architecture. Majority of the portion of the temple and sculptures are lost to time and theft. Also, due to that this is kept preserved by ASI and the door of temple is kept closed and is opened only during the time a visitor arrives and is closed back when the visitor leaves. The temple was kept clean, neat and properly maintained by Archaelogical Survey of India dept. We could sight plenty of a different lizards all over the temple. First of all, to reach the temple one has to travel approx. 2kms from the road, out of which 1km can be reached through your car with great difficulties though and the remaining 1km has to be climbed through either steps/ramp. Better travel with bigger cars or SUV's or else you have to travel 2kms by walk since the very bad 1km stretch can damage your car tyres for sure. But, on reaching the place after crossing these hurdles, you will feel the extreme satisfaction of being on top of the hill with a rare ancient temple. One must surely visit to enjoy that.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r316804160-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Katarmal Temple.", "review": "Katarmal sun Temple is a historical temple.Katarmal Temple is 12 century.This is  2nd sun Temple , 1st is in Orisa (konarka )and the 2nd one is at Katarmal in Almora. Katarmal Temple is abut 12km.from Almora Bus Station.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r226227072-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Beautiful and simple..", "review": "You can reach this place by taking a taxi, Kosi is about 13km from Almora and temple is about 1.5km uphill trek from Kosi. You would love the hike if you like trekking as it provides some breath taking views.. but it’s very steep and very exhausting, there is a road also which goes uphill till very near to temple but it’s not in very good shape although local taxi drivers would happily take you there (avoid self drive), going there early morning is good and you can see sun rise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r242409895-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Katarmal temple", "review": "it is a bit far off from the main road. You will have to trek about 25 mins to reach this place and you cannot take a vehicle as this is a very narrow unpaved road. Temple is very well maintained and the priest is around the temple who will open the temple seeing the tourists. priest was very well happy and did not accept any donations and asked us to give all the offerings in the hundi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r243292733-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "The Only Sun Temple In Kumaon.", "review": "Katarmal Temple is a magnificent Surya temple also known as Bara Aditya temple. Katarmal is located about 17 kms from Almora. One has to trek almost three kms crossing Hawalbagh and Matela near Kosi River. The Katarmal Temple has the distinction of being the only Sun temple in Kumaon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r145790126-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "sun temple", "review": "it is a simple structure. the view from top is fantastic. there is a small gap in a temple opposite the main temple. from this gap, the first rays of sun fall on the sun idol. the walk may seem difficult, but is not so.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r238559240-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Sun Temple", "review": "Katarmal Temple is known as SUN temple now it is a ruin temple. the Main Sun Idol has been stolen long time ago, some part has been kept in Delhi Museum,now the temple under Archaeological survey of India. The temple is srrounded by green grass and mountain,which looks very beautiful.It is 1.5 Kms from Almora city , can be reach by CAB.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r268048107-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "One of the only two sun temples in India", "review": "A short distance from Almora and a 20 minute climb brings you to one of the only two sun temples in the whole country ( the other being Konark ). A rare experience indeed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r155665892-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "isolated temple at top of a hill", "review": "We were the only family in the temple. Just the season was starting. Little difficult to find the stop where to take a left turn when coming from Almora . But would not be a challenge if u r coming from Ranikhet to Almora. It is maintained by ASI. You would wonder why a temple was built in such a desolate place. Nevertheless, that adds to the beauty. Once you reach the stop there are 2 ways.a steep walk (1.5 km ) or further a drive which will connect you half way the trekking path. Old people may find little difficult to climb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r262197307-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "Amazing Trip of Sun Temple Katarmal", "review": "It was a great experience to visit Sun Temple at Katarmal. We can just imagine how a temple can be constructed in the dense forest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r163835386-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Only two sun temples in the world", "review": "There are only two two Sun temples in the world (I heard that in Almora) :-", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r149776922-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Nice Temple", "review": "This is a brilliant temple complex just outside Almora. It is really amazing how such intricate temples were built in ancient times in location which is still remote. I hope the ASI maintains this better", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r246290488-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Setting Sun", "review": "Since Konark is so popular, Katarmal takes the average visitor by surprise as many are not aware of it's existence. The climb is quite easy and pleasant. The fist view of the temple from the pathway is quite majestic and evocative. The main temple is locked after 5pm. We were lucky that the person concerned was still around and could open the temple for us. The first thing that strikes you is the mystery of how the stones and structure elements were brought there without modern day technology. Most of the domes have no deity inside. Only the main dome has a few odd statues, mostly broken. The main deity is missing too. The statues now grace many parts of the world and the remaining structure creates a very poignant setting for a glory of times, long gone!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r177463726-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 5.0, "title": "A must see..", "review": "This place says..its a 1.5 km hike...PUT please dont try it...its not for the faint hearted..instead take the uneven road upto the village...and hike up for abt 10 mins...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r209516746-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Katarmal Sun Temple", "rating": 4.0, "title": "Impressive Temple up hill", "review": "This temple is well worth the short trip from Almora,  and is very impressive. Be ready for 1 hour climb up hill. Note that the temple at Jageshwar is even more impressive, and located in a more beautiful surrounding. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3536104-r207786960-Katarmal_Sun_Temple-Almora_Almora_District_Uttarakhand.html"}]