[{"point_of_interest": "Maa Dunaguri Temple", "rating": 5.0, "title": "Serene & heavenly temple with breathtaking views!", "review": "I have been to the Dunagiri temple multiple times, each time on my way to the temple I am greeted with lush green forests, steep slopes, scenic mountainous peaks.  Amidst nature's generosity in abundance, One needs to climb 365 steps to reach to the main temple and get darshan of Maa Dunagiri. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r271690727-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 4.0, "title": "Stunning!", "review": "Linked to the Ramayana period, this temple is located near Dwarahat and as it is said Hanuman ji dropped a piece of the sanjivini buti at this place. Located about 15 km from Dwarahat, this pristine temple is highly revered by the locals. Owing to red colour of soil here, the temple is also called  Mangalikhan. Mangal implying the planet Mars which is associated with the orange soil found here. The 350 steps leading to the temple are surrounded by majestic peaks and the melodious sounds of nature.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r293539315-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 4.0, "title": "Breathtaking", "review": "Visited the place during my graduation days. The temple is a charm. The cool breeze that surrounds it adds to the magic. Located near dwarahat in almora, this place is a must visit for travelers holidaying near almora/ranikhet. About 200 stairs lead to the temple. Very fine marbles have been used in the construction and by the time you reach the temple climbing those stairs, the view and the breeze is so soothing that  you forget any tiredness. .Faith-wise, the temple scores very high and thousands of devotees and curious travelers swarm the place every day. Highly Recommended!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r275552085-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 4.0, "title": "temple having 500 steps", "review": "Dunagiri maa temple has about 500 steps and is totally covered so that even in rains one can climb and visit the temple. it has a old tree under which Maha Avatar babaji did Tapasya.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r294080787-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 4.0, "title": "Super Excellent", "review": "This temple is said to be from the period of ramayan and highly important place. Very peaceful place to worship the god and spend few hours in meditation. Stunning beauty around the temple with thick forest. Place for peace seekers and worshipers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r382141469-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 5.0, "title": "Temple At Top of Hill", "review": "Dunagiri Temple placed at a distance of 20km from Dawrahat in top of the hill belong to  the mountain introduced by \"Pavandev' ( the god of wind) each night time of Navratri is devoted to nine distinct  sorts of Goddess Durga. they are  nine different avatar of Durga Maa.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r458086100-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 5.0, "title": "Calm and Serene Place", "review": "Dunagiri temple is a part of DRONANCHAL temple, which was moved by Lord Hanuman during the Ramayana period, when Lord Laxman could be cured only with Himalayan herbs (Sanjiwani).", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r283102622-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 5.0, "title": "Great History attached to this Temple", "review": "Dunagiri is a very beautiful and famous Hindu Goddess temple of Uttarakhand. The way is about one km walking distance. You have to climb stairs to reach the top but as other places the stairs are not so tiry here. All the way is covered with tin shed so you can reach up there even in Monsoon. The place is at about 15 kms. driving distance from Dwarahat. The temple is on the top of the hill so a good view cab be seen from there. The road conditions are good and hotels are also available nearby.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r583275639-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 3.0, "title": "Good views & peaceful", "review": "Temple is about 15km from village, road approach is good. Situated on hilltop it has good views & peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r598350545-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Maa Dunaguri Temple", "rating": 4.0, "title": "nice temple", "review": "Dunagiri is a very beautiful  temple of Uttarakhand. After walking about one km you have to climb stairs to reach the top.The route is covered with tin shed so one can even reach here in Monsoon.The temple is situated on the top of the hill. The approachable road conditions is good.The temple is dedicated to goddess Vaishnavi.This is about 70kms away from Almora.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8071235-r599873447-Maa_Dunaguri_Temple-Almora_Almora_District_Uttarakhand.html"}]