[{"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "One of earliest known paintings from Stone Age...", "review": "16 km. from Almora town towards Jageshwar. Majority of the passing vehicles do not stop at this point. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r508639622-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 1.0, "title": "Skip it, not worth a stop", "review": "Skip it, not worth a stop. Or go with zero expectations. Newsflash, this is not an udiyar(cave) at all. This is just a rock. Period.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r495328022-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "Lakhudiyar paintings in Almora Uttarakhand", "review": "Lakhudiyar (in kumaoni it means lakh caves) located on the bank of the river Suyal. It is about 16 km from Almora on the Almora Barechena road. The paintings reflects humans, animals etc.Most of the human figures are shown as rows of dancers. Lakhudiyar has been acknowledged as the richest cave shelter preserving the scenes and activities of the primitive inhabitants of the region, which according to archaeologists belong to the Old Stone Age to the Neo Stone Age. The responsibility of Archeology department ends with display of notice board.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r493655347-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "Lakhudiyar", "review": "Isolated and difficult to locate, some locals themselves are not aware about it. the number of paintings are very few - only one single Wall stretch so those who are not too keen on prehistoric artifacts can definitely give this a miss. Not much from photography perspective - a bit of a let down ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r490380862-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "pre historic cave", "review": "believed to be a cave where men in the stone era lived, if one carefully sees you will find hand pained drawings of the daily lives of the people inscribed on the rock. however it has become very faint and hence is difficult to decipher. but it surely gives us a glimpse into the remote past.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r557510335-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "nice place to see prehistoric painting", "review": "Painted Rock Shelters in Almora are a small set of cave rocks where prehistoric  drawings can be seen on the cave shelter walls. One can find these painted rock shelters in plenty in sites in Almora. The rock paintings have been beautifully sketched with geometrical patterns, schematic alignments of depressions along with faunal and floral patterns. The pictures are mostly drawn in red and white.These paintings are easily visible from the roadside.All these paintings have been done millions of years back reminds us that creativity has been an integral part of the human race.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r600185243-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 2.0, "title": "Very lame", "review": "Pros: It is free and it is about a 2 minute walk from the road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r562004290-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 5.0, "title": "Unfortunately not maintained", "review": "It's unfortunate that in our country we don't value these heritage places. There is no maintenance and in fact not many local people even know about this place. The sign board can be easily missed by people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r609598210-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "Hidden Gem", "review": "Very difficult to locate since its not marked properly and the locals also a times are not able to tell you about this place. Its right on the main road between jageshwar and Almora. Its on the right while going to Jageshwar from Almora. There is an old run down blue board in hindi from the local archaelogical department that tells us about this place. Its a 5 min climb up from the main road to a rock that has paintings done in the prehistoric times. Some figures are clear and some washed away. Nonetheless it is a pleasure to see something done so many years back so close. Right now its overlooking a valley with a river flowing below. I kept wondering what the topograhy must have been when the paintings were done. Probably there was a settlement here. The paintings have survived inspite of being in open. I think the paintings were done in lakh (laquer) and probably it derives its name also from that. I wish our archaelogical department does some more work over it and makes it an interesting point of interest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r626664889-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "How badly we care about our non-religious Heritages", "review": "It has been my great desire to visit this particular sight where our ancestors lived and thrived during prehistorical era. The whole of the nearby mountain sides have thousands of rock shelters, but left unexplored  by ASI, regional archaeologists, historians alike.. Only one large shelter has been kept open for curios visitors like us. It has some good paintings of animals. birds and geometrical designs, but totally neglected and overlooked and sooner than latter will be lost to tell its story. An ideal place high on the mountain with a small river [now a thin flow of water channel] flowing down below. During my couple hours of stay, only a single family  visited the site.However, one may look around for rare find,including historic tools, if he has time to afford. The place is approachable by local buses and share taxis during day time and it is only few kilometers from Chitai temple.Please note that.NO Facilities are available anywhere within sights.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r632061355-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "Rock cave paintings and sketches for the archeaological inclined", "review": "You do get to see prehistoric paintings and sketches. It takes not more than 20 mins to see this but gives a glimpse into  an earlyman's life", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r443007684-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "The rock is beautiful!", "review": "One can hardly see the paintings but the rock hanging like a shelter over your head looks like  petrified water waves of the ebony colour", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r297424264-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 5.0, "title": "A Prehistoric cave drawing site", "review": "A small set of cave rocks where prehistoric drawings with chalk can be seen on the cave shelter walls. An hour away from almora town and can be a good stopover, you can do a small picnic in the grounds besides the shelters.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r334009844-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "A relatively unknown site of prehistoric rock paintings", "review": "This is a relatively unknown site of rock paintings, which is perhaps a blessing or they would surely have been vandalized by now. Easily accessible, the rock paintings are right by the the main road from Almora to Jageshwar though poorly signposted. There is no one to guard the site and there is no entry ticket. Paintings are easily visible and are mostly in red and white. The paintings are not in a cave but rather under a huge overhanging rock", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r364999527-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 4.0, "title": "Little known ancient wonder: Painted Rock Shelters millions of years old.", "review": "While coming from Pithoragarh to Almora and having seen marvellous temple collections at Jageshwar, we stopped 16 kilometers short of Almora to have a look at painted rock shelters at Lakhudiyar. These rock paintings are truly from stone age time and thus millions of years old.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r288465628-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "not as impressive as Bhimbetka caves", "review": "this place lacks maintenance . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r469097616-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "Rock Painting", "review": "Unknown site for most of the traveller. This is commonly known as Lakhudiyar Caves and rock painting. 10 km from Almora towards jageshwar & roughly 5 km after Golu Dev temple - chitai this is easily accessible site . Though poorly signposted, no one to guard the site and no entry ticket. Paintings are visible mostly in red and white. The paintings are rather under a rock.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r488943395-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 3.0, "title": "Prehistoric place", "review": "The place is prehistoric in the way of Almora to Jageshwar dham, it is preserve place, but no security as well as no maintenance found. There is some of cave type structure that have some paintings from prehistoric time. One time see place and recommend for history lover.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r395806384-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Pre-Historic Painted Rock Shelter", "rating": 5.0, "title": "seeing is believing", "review": "Unbelievable !!!!! Real pre historic wall paintings in black, white and red,  ,painted  thousands of years ago, well preserved on cave hangings at Lakhudiyar, right on bank of kosi river.  Unfortunately, all the chances that you will miss the site as it is not glorified. just small sign board on empty road to jageshwar it is on right side of road siome 5 km away from Chitai golu temple of bells. .Govt should at least put large size board at site if nothing else. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d8476218-r484550101-Pre_Historic_Painted_Rock_Shelter-Almora_Almora_District_Uttarakhand.html"}]