[{"point_of_interest": "Tarikhet", "rating": 4.0, "title": "Peace on earth", "review": "This just 10 Kms from Ranikhet a small village there not a such big accommodation to stay very limited hotels to stay.But if you are looking for real peace on earth then this place is perfect out of crowed and full day view of Himalaya's and some beautiful birds can been seen here, you may also visit local village and farming land.But in the evening its get quite cold over here,there is no shops here you have to buy in advance from Ranikhet or one has be depend on hotel availability.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r322584336-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 5.0, "title": "full of natural beauty", "review": "This place is like heaven on the earth. I took the feel of sunset at this place. The natural beauty of this place is just awesome. I sat in this place at least for 2 hours. the surrounding was very much peaceful over here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r336011176-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 5.0, "title": "The best place to unwind near Delhi", "review": "At just about 8-9 hours of drive from delhi... the place offers a majestic view of the himalayas alongwith some great adventure spots.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r365741177-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 5.0, "title": "Best Scene", "review": "Worth visiting place with lot of natural beauty all around you can easily drive from nanital or ranikhet", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r375483902-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 4.0, "title": "Majestic View", "review": "This place is on the way to Nanital to Ranikhet and excellent place to unwind your self. Amazing view of himalayas. Very calm and peaceful place. Awesome natural beauty. Highly recommended place for peace seekers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r380136456-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 5.0, "title": "Tarikhet - Nature's Bounty", "review": "Tarikhet is a Small Scenic Village near Cantonment Town of Ranikhet. Located at about 8 kms form Ranikhet, this place offers Peace and tranquil environment for anyone to recharge and unwind oneself. This place is highly recommended place for peace seekers and nature lovers. Being a Small Village there are not big accommodations to stay but only limited Guest Houses.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r480147830-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 4.0, "title": "Scenic Beauty", "review": "This is really a good place and the beauty is at its peak in morning and evening time when sun rises and sets.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r506221060-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 4.0, "title": "Nature beauti", "review": "This place is beautiful and gives you a feeling like sitting in the lap of nature itself. The area is peaceful and relaxing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r506780205-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 4.0, "title": "Amazing scenic beauty", "review": "Planning a road trip. Covering these roads along with Ranikhet is an amazing experience you can get. Morning Sunrise is worth catching. Late night location can feel dark but can be fun if you are into ghost stories.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r515402763-Tarikhet-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Tarikhet", "rating": 4.0, "title": "nice natural beauty", "review": "Tarikhet is a small hamlet, about 8 Kms. from Ranikhet on the Ranikhet-Ramnagar Hinghway.It is nice place for nature lovers.One can feel after coming here that he is in the lap of nature where no one disturb i.e peaceful place. It is touted as the hotbed of Indian freedom struggle movement.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3705983-r599241660-Tarikhet-Almora_Almora_District_Uttarakhand.html"}]