[{"point_of_interest": "Zero Point", "rating": 3.0, "title": "Nice place on a clear sky day", "review": "This place is nearly 2 kms walk / trek from the Binsar Sanctuary TRH (Tourist Rest House). I visitied tihis place along with my family during the second week of May. Alas, it didn't meet the expectations, instead on the next day while travelling to Kasara Temple, we enjoyed the breath taking views magnificent snow mountains from the roads.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r582101486-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "In the lap of  Nature at the top", "review": "A trip to Binsar sanctuary in incomplete without visit of this lovely place located at 2450 met altitude. From Forest Rest house you need to trek around 2km in the mist of dense forest of Oak . Those loving to trek or nature tourism will find this place very attractive and wonderful.Scenic beauty of dense forests and himalayan peaks are main attrcations. You need to carry snacks and water bottles along with  you as there are no such facilities at Zero point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r585573851-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Peace and close to nature", "review": "After  reading mixed reviews i was skeptical to go but having bothing to do in and around Binsar, thought of giving it a try. It is on the top of the binsar bird/ wlidlife sanctury. You have to buy entrance ticket @150/adult 75/child & 250-350 for vehicle. Drive for 10 kms inside sanctury that will test your driving skills as road has mountain on one side and deep valley on other side and riad width sufficient for 1 tempo traveller.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r582791647-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Worth the walk", "review": "The Zero point gives an excellent view of the Himalayan Range and you will be astonished to see the view. Those were the words we heard from everyone but we knew that we cannot see anything due to cloud and smoke from forest fire. We started walking with guide. He was a young man and was very friendly. He understood that we have more in our minds than just walk to the zero point in the normal walking trail. So, he provided us a great walk through the jungle while returning. Me, my wife and my daughter of 12 enjoyed the trek in a way which I cannot explain in words. A bit tiresome and you need to have the minimum fitness level not to tumble as you proceed through the narrow walkway, but, though we have not seen any views, we loved the walk the most. If you keep an eye you can snap some rare birds of Uttarakhand here at morning time for sure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r586421608-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Good views but overrated", "review": "There is a drive of 8 kms within the forest followed by 2 kms of walk before you reach this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r587535626-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "nice trek", "review": "nice trek.. not a tough one.. even kids can do the trek. The trek is through dense forest and the view from the top is very beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r594008874-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Nice place to get beautiful views of the mountains", "review": "Zero Point is about 2 km walk from KMVN Tourist Rest House. No vehicle is allowed on this route. The walk itself is wonderful. You can see various bird during the walk. A structure has been construed to get good views of the mountains.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r587757076-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Average", "review": "The Zero Point is nothing great, the drive is really steep and the road is bad plus there is nothing much to explore coz once u enter the wild sanctuary it’s pure nature everywhere so there is no point driving up that far.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r590679331-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "can be reached by 2kms long trekking", "review": "It is a best place for nature lovers because of its amazing serenity and scenery.One should must take photograph here.It is a tower situted at the heart of the Binsar Wildlife Sanctuary.It is only accessible by 2kms long trekking from the parking area.Visitors come here to look the stunning view of pure white mountains of Himalayas.It is the best place to see the sunrise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r598883924-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Apt trek", "review": "Its a trek for everyone. Good exercise. Only 3km to and fro. Path is well laid out. Walking through dense forest is heavenly. Its 100% safe. view from zero point is majestic.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r635935630-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Peaceful atmosphere", "review": "Although it is highly unlikely to sight a wild animal from here but the view of sunset and sunrise is awesome. The walk through the jungle to this point from out hitel was also great", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r552611175-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 2.0, "title": "Good Location and services", "review": "here you will get yourself deep with nature treat . sidesing is the best thing to do .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r556787289-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "highest point in binsar", "review": "a 1.5 km trek from the binsar TRH takes you to zero point which is the highest point in binsar and offers astounding views of the himalayan ranges viz. nanda devi, trishul etc. being at such a height this is much colder and you definitely need caps and muffler.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r557508858-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Small trek to quietest place and 360 Degree Himalayan view", "review": "You have to under go a small 2 or 2.5 Km trek one way from KMVN TRH. Trek is easy and good experience to walk through entire forest and hilly area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r564539704-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A small trek in crisp air", "review": "The place offers a 3 km trek (1.5 up and down) set in a forest with not so steep paths. Tough no wild Animal is visible here you can visit it for the fresh air and views on offer. The trek starts next to KMVN property which has food options available. These are limited and have timings applicable. We were there around lunch time so only Thali was being served at 250rs..not even tea was available at that time. The evening snacks start after 4:30. Taxis are allowed up til this point and have an entry fee of 150 pp plus cab charges of 250 (including drivers charge).", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r571485456-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great view of the Himalayas only early morning on days with clear sky", "review": "Great view of the Himalayas only early morning on days with clear sky. There is a small trek that leads to zero point. That is very nice as well. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r576359121-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Nice nature walk", "review": "If you are a nature lover and love adventure sports this is the right place. Walk up to the zero point is nice calm and picturesque. Cool breeze all the way. Adventurous because the 10km drive from the Forest check post upto the parking is thru a single lane with one side open. Really tests your driving skills. Should any vehicle come on the opposite side it's even more thrilling. Hence venture here only if you like nature and are good at driving. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r577407266-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 1.0, "title": "Pathatic", "review": "Must only b for those who r into treking ..please dont visit if ur kid is small or cnt walk long...wont able to see a single peak of mountain or animal as it was summer ..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r581370489-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Trekking in the forest", "review": "The walk up the trail is good and wonderful sighting of birds all the way.A paradise for bird watchers.The scence from zero point is breathtaking but please start early on a clear day to view the Mighty and breathtaking Himalayan ranges.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r577756146-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Top of the world .", "review": "Its a walk of around 2 kms from the Binsar parking place. Basically a tower to stand and  view the himalayas. If there is snow and clear skies then the view and pictures will be absolutelt breathtaking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r581900741-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "360 Degree view of the valley", "review": "The zero point for binsar sanctuary gives a 360 degree view of the valley A small medium trek takes you to the place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r492620354-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Good view", "review": "You find amazing view of himlayan range namely Nanda Devi , trishul and so on.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r495322794-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "A lookout point in a forest", "review": "Everyone who visits Binsar Wildlife Sanctuary goes to Zero Point, essentially because the road ends here and all the guides lead them on this 2 km to this lookout point. If you get here just after dawn on an unusually clear day, you might have unobstructed views of the snow-capped Himalayan peaks to the north and east. Otherwise there is nothing here. But Binsar is a lovely, dense forest for hiking. Visit just to enjoy the hike.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r495860773-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Nice little place up in mountain", "review": "If you like adventure then drive to this place. 10 KM stretch of very narrow road without any side rail, it is really adventure. I had to stop couple of times so other cars can pass. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r495766344-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Serene", "review": "ZERO point is actually ZERo, but the beauty lies in the eye of the beholder.. Nice treck to the Zero point and good relaxing place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r491149602-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Serene Trek through rhododendron forests to reach the vantage point", "review": "To reach zero point , you have to enter through the sanctuary main gate where you need to buy tickets for yourself (Rs 250/person) and your vehicle (Rs 150), No tickets needed for the driver.From there to the KMVN guest house is a car ride for about 10 kms. The road is narrow and at some places is really bad with construction stones lying in piles on the sides. I wonder why dont they maintain the roads well in spite of charging such a high entry fee.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r544268593-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Fun times", "review": "Great place to be at. The trek of 2.5 km each side gives you an awesome feeling. The view is carasmatic", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r529606099-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "lovely trek", "review": "Lovely trek in the midst of nature. We thoroughly enjoyed trekking upto the zero point. The place is untouched by commercialization . The only sound is the chirping of birds. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r515733397-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "A must visit for sunrise lovers... ", "review": "It's on a green jungle walk to a very quite place from where big snow peaks can be seen. Best place to plan your morning jog session at this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r543716433-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Thrilling experience", "review": "I booked KMVN binsar for 3 night stay, trekked to zero point with my wife. It is real adventure walking in complete silence which only gets disturbed by chirping birds or outrageous winds. Knowing that you are in leopard's territory keeps you in your toes all the time but that's the real adventure. We only found 1another couple during our ascent. But the views from watchtower at zero point we're simply awesome. Would love to go back there some day for sure!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r546305920-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Azaming", "review": "Worth a billion dollar bucks. Best place to view sunrise, as the peaks and so closer to you that they actually looks straight into your eyes. It's beautiful feeling.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r468642227-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great Trek route", "review": "Unfortunately we wmt on a hazy day, so from the view point we could not see the entire range. But the trek route was not very difficult. Even elderly people can take it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r476276839-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Zero Point, Binsar Valley", "review": "Only zero point is there which is 2 Km walk from nearest drop point. We can see Himalayan range if sky is clear.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r474409575-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "A lovely walk from a Rohdodendon forect", "review": "Trekked to zero point from the base. The \"Zero point\" by itself is a stone structure which overlooks the Himalayas. in summer, dont expect to see anything from it cause of the Haze factor that kills visiblity. however Ill admit the trek and trail itself was a good experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r477060977-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Fabulous Trek", "review": "Visited the national sanctuary and trekked to zero point with family on 15 Apr 17. The trek is moderate, but having good sports shoes is advisable. The rhododendron trees/ flowers are mesmerizing. Take a Guide, available just outside the KMVN TRH, as he will tell you lots of stories and gen u up on the flora nd fauna around which helps in a better deeper connect and enjoyment. Surely a must do, if u are in the area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r477647625-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Lands` End = Zero Point", "review": "As the name describes, Zero Point is the end of the road. A 2 km narrow jungle road accessible only by foot leads to this point. Once we are inside Binsar wildlife Sanctuary, the jungle road leads to the KMVN Guest house. We can take our cars only till KMVN. From there you need to walk. It’s a wonderful experience to take this small hike. Guides are available on demand. Zero point is a view point constructed by Forest Dept. For tourists to come and enjoy Natures’ Bounty. If you are lucky enough to find skies clear, this Place Offers most spectacular views of the Upper Himalayan Ranges panorama ranging from Mt. Trishul to Panchachuli Peaks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r480138410-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Nice little trek", "review": "We trekked from the rest house to the zero point without a guide as it's a pretty straight road. The zero point is nothing more than small hut like a viewing outpost. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r477870910-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Nice Trek", "review": "2 km mild walk from KMVN Binsar TRH inside binsar wildlife sanctuary. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r488224476-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Excellent Walk in Binsar Sanctuary", "review": "It is a 2 km forest walk from KMVN rest house. Ideal for morning walk after you see sunrise from KMVN. If you carry a binocular, you might get to see few birds also. Zero pointy has a watch tower built in stone and offers nice view of himalayas. If you are in Binsar then this is must visit place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r441661598-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "no ROAD ahead.....", "review": "Zero point is the entrance to the Binsar sanctuary core area........there is no motor able road ahead  -- it is about 2200 mtrs from MSL ..one can see Buransh trees on the way.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r490696648-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "View of majestic Himalayas", "review": "Zero point offers excellent view of peaks of Himalayas such as mount Trishul, Nanda Devi and others. The trek of approx 2 kms from parking to this place is also very enjoyable. during the trek one can see 3-4 different type of trees of the forest such as Oak, Buransh but not Pine. Having a registered guide, who charges Rs 300/-, is helpful in understanding more about the forest and the himalayan peaks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r444578022-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Not exactly worth the trek, not at least in winter", "review": "As a part of leisurely pastime, we decided to visit Binsar National Park, which brought us near the TRC Bungalow. It was a 1.5 km trek from there . The  scenery is almost same throughout. They have a guide service woth 300 bucks who will tell you the names of the plants and the birds. Well not a single bird was visible, seems summer is their fav time. It was a strenuous walk, not much dividend though.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r447061588-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "great place great view, trek of 3 km each side", "review": "pristine jungle, trek of 3 km 1 side..if thts what you want then zero point will be exciting..it has to be recahed via road trip of 1 hr & then the trek from where the cars are not allowed...it offers beautiful view of snow capped himalayas..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r455792395-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Worth visiting", "review": "It was a beautiful journey from Almora to binsar Zero Point, you can also book your stay in the Binsar sanctuary. Its a 2.5 Kms trek to reach this point and the view is amazing. Chances are there that you can experience snow at that point", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r449461693-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "180 Degree View", "review": "It is 2 kms walk from KMVN Binsar. The best point to view the Himalayas in Wildlife Sanctuary. Please carry snacks & water as there is nothing available on the way. The walk is through the dense forest and quite an experience. You can also continue your 2 km trek downhill to Shiva Temple which is 6 kms by road from sanctuary gate or take the 9 kms trek with guide.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r456071521-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Trek along", "review": "This was one of the main attraction that Binsar has. We visited this place early Jan of 2017, it was not really cold and no signs of snow in the hills, but still the trek to this place was worth it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r458237392-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "A very beautiful view of the grandeur of the Himalayas", "review": "The highest point in the area around, gives an elegant view on clear days. The approach is not motor-able and a walk up the steep incline is a retardant for the senior citizens.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r464058706-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great View of Himalayan Ranges", "review": "2 km trek one way and 4 km trek in total but worth the effort. It is advised to leave early and arrive at this place early morning so that you get a chance to click god pictures and clouds do not play a spoil sport. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r465783836-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A must visit.", "review": "The silence of this place will both charm you and scare you. We went in off season and there were no other tourists at all. It was scary to walk 2 km through the jungle all alone but was safe. The views were excellent. It was a clear day and could see the himalayas.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r407054782-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "A way to jungle", "review": "We couldn't get the view as it's cloudy but reaching there is a thrill. No body is there to guide you (You can take a guide in start :) but that is called adventure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r390588786-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Vantage point in the sanctuary to view the flora and fauna and Himalyan peaks", "review": "A 1.5 Kms trek leads to this vantage point from where you can watch the entire National Park and Himalyan peaks on a clear day. The trek to this point is through jungle and can be done by kids and seniors. When we took this trek we were only ones and it became scary. We were told that the place is inhabited by leopards. We could spot a barking deer which disappeared before we could prepare our cameras for a shot. Leopards in these jungles do not harm or attack humans. Enjoyable trek, must do while staying in KMVN TRH.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r392049784-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A good walk!!!", "review": "This place is good for hikers. This 2 km hike through the jungle is quite enjoyable specially for the kids as they love the trees and the nature with lots of birds and few animals.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r410583114-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "nice and calm place , above the world", "review": "this is a very nice and calm place ,where one can reach after 3 kms of trek or walk in middle of forest , 4 point for the place and scenatic beauty , but there is no facility like water or anything available , with no maintenance of place ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r415198809-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Excellent view of the Himalayan range", "review": "This is the highest point in Binsar area, 10 kms drive inside the Binsar wildlife sanctuary. The drive is very scenic and you can spot birds and animals along the way if you are lucky. We spotted pheasants, deer, snails and birds like wood peckers. It is recommended to reach early morning as chances of getting clear skies is high. There is a small walk (easy one) once you reach the KVM government guest house.  A watch tower is constructed at zero point from where you can see the great Himalayan range. Some serious peaks seen here are Nanda Devi, Trishul, Panchachuli etc.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r423697654-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Fantastic view of the Nanda Devi range and the serene treck", "review": "2.5 km from the kumao guest house . The treck is all jungle in the surrounding. We loved it as it had snowed and the entire path was covered. When you reach the top view is magical", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r418491008-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Highest view point in Binsar", "review": "Zero point is the highest point from where you can have some amazing views of the snow-capped Himalyan mountains. There is a watch tower from where you can have great views of the Nanda devi range.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r423052592-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Top of the Hill/World", "review": "This point is a two km walk from KMVN resort Binsar.  You get to see the snow peaks of Northern Uttarakhand here (can be seen between October and March and occasionally in other months).  The walk is through dense forests.  You get a ringside view of the Kumaon hills--from Bageshwar to Didihaat", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r427793778-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Highest Point", "review": "It is the highest point of Binsar situated inside the forest reserve . From this point one see the wide angle view of the majestic Himalayas showing off the great peaks like Nanda Devi India's second highest peak.We reached the spot by trekking approx 2 Kilometres till the Zero point.There is one Forest rest house where you can find peace and see the sun set at evening.Do not go inside the deep forest without any guide or local people because you may get lost into the forest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r361353474-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 2.0, "title": "Went there but its avoidable", "review": "Very bad approach road to this place and then it offers almost no wildlife. I would actually give it a miss. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r348733139-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Good Jungle Walk", "review": "It is a very good jungle walk for nature lovers.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r355184665-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Lovely views of the Himalayan peaks", "review": "Zero point is a nice 2 km walk through the forests from KMVN TRH. Beautiful forest- very dense, wide variety of trees and lots of birds. There is an observation tower at the top from where one can see the peaks. There are also trails around leading to the villages, which are nice to walk on.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r436488097-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Good trek, amazing views", "review": "This place is 9 km drive from entry to the National Park and 45 min (2 km) walk after that. Worth a try due to easy walk, great views of snow peaks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r358904370-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Wow get still", "review": "This is a moderate trek to top..view from there is awesome.. There is nothing and nobody which makes this location a absolute still! You can just sit there and meditate... Too good,,must try in binsar... Binsar is a beauty and zero point just adds more!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r351267101-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "worth a trek to Zero point on a clear day", "review": "Trek through the Binsar Wildlife Forest  and ensure to visit the high point  to Zero point . Especially on a clear day.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r372715132-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Nice hike in the jungle.", "review": "Nice hike, no great view. A lot of trees around the look out point. Enjoyed the hike which was about 2km long.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r379394053-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Beautiful Place", "review": "Very beautiful place and it gives excellent view of the surroundings. You can trak to the place and get the amazing view of Himalayas. In clear weather it looks even more beautiful. Worth visiting place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r380457209-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "The Observatory to the Himalayas!", "review": "You certainly need a clear day without cluouds and dust and haze to see the Himalayas. Or else, you can just enjy the trek through the Jungle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r380146581-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "360 degrees view", "review": "Zero point is the highest point in Binsar National Park . It takes about 50 to 60 minutes of walking uphill from the road head , has a fantastic view of the lush green forest & mountains from this point .", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r365546836-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Mesmerizing natural beauty", "review": "one of the best hill tops I have ever visited....situated in the binsar wildlife sanctuary, this place offers the beautiful sightseeing to the nanda devi peaks...a 2 km treck to the point was not a good idea initially as it was steep in the initial phase but after 100 mt it went smooth and plane and we enjoyed a lot on it....once we reached the point realized that all the pain is worth this picturesque moment.....  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r335620214-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A refreshing hiking", "review": "As we stayed at Binsar Forest Retreat, it was only almost 1km hike towards Binsar Zero Point. Preetam, the owner of the Retreat himself guided us towards to point amidst the sanctuary. The road was full of dry leaves and mica stones. What we could only hear were  the call of the unknown birds and our chit chats.A beautiful experience indeed. The magnificent snow clad mountains welcomed us at the view point. A memorable experience indeed. Please, don't litter the place with used bottles and packets . Try to carry them with yourself and throw at hotel dustbin.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r330434465-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "on the top", "review": "zero point can be reached after a trek af almost 1.5 Kms in the jungle, but is worth taking. Even walking in jungle is as awesome as reaching the destination.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r328822859-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Awesome Forest Trail", "review": "We went in group of friends to visit the national park. Its an hour and half drive from Almora & you end up reaching the forest mid point where there is a govt run cafe & inn. Its a reserved forest & the govt has done its effort to keep it very clean. From the inn you can take a good hike to reach the machan or zero point from where you can see a number of himalayan peaks. Better clarity in winter months, we went in March so we could not have a very good clarity though. You can spend time alone with the forest besides you. Good shows & a walking stick may come in handly along with a water bottle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r334008097-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "BEAUTIFUL", "review": "This place is about 10-15kms inside the Binsar forest reserve, from the main gate. Motorable road extends upto the KMVN hotel within the reserve. From there, it involves a 2kms trek to the zero point. The trek is very easy. The best plan would be to visit this place early morning and catch the sunrise. It gives a beautiful panoramic view of the Himalayas. The place is serene. The forest reserve gate opens at sunrise, so to be able to catch the sunrise at zero point, it may become necessary to find some lodging within the reserve itself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r329454200-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Great Trek, Good view", "review": "This is a must do if you want a light trek, but if the objective is to view the range then this is not the best option. All the cabs stop at TRH beyond which they are not allowed. Go to the back of TRH on the terrace near the rooms where you will get much better views of the range than Zero Point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r336132890-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great views from here", "review": "The zero point, or Jhandi, as it is called by locals is a great place to view the peaks. On a clear day, one has an almost 150 degree view of the peaks", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r336670304-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Inside Binsar Sanctuary..a watch tower with view of snowcapped mountains!", "review": "Zero point is a short trek from the Binsar Wildlife Sanctuary forest rest house..cars need to be parked at the FRH and then its a 2km trek to a man-made watch tower..", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r340690588-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Nice View", "review": "Very calm and beautiful place. You can feel even your hear beat :) A great point for sunset and sunrise....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r338100714-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Nice trek...", "review": "A great trek, for kids and adults (even my parents came along). You can choose between the normal pathway (relatively flat) or be adventurous like us few, climbing up every hill on the way and then pretty precariously find your way down the other side. Being rainy season, we did not have much to view from zero point, but still enjoyed the 2-odd km trek. The trek needs to be taken from from Tourist Rest House (TRH) Binsar, till where you can drive up in your car.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r297429108-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Dense forest ... do not forget to ask for a guide at Kumaon Mandal Tourist Complex", "review": "Place is inside a Binsar Bird Sancturay.... We venture it on a bike. Dense and silent forest with excellent views to nature and Himalayas. Missed zero point as we didnt find it alone. A guide is must to visit zero point", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r345563486-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "good jungle drive", "review": "It is a nice jungle drive but we probably went on a wrong day. It was rainy and cloudy so we could not see the Himalayas and could neither see any wildlife on the way but the drive was good. Road is not well maintained so that is a bit of driving stress.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r315589510-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Pristine place with views", "review": "One short hike from the Kumoni mandal restaurant, yet this seems so far away from it all. Absolutely enjoyed the trek in Aug when it had just stopped raining , the ferns, trees and wildlife add a lot of mystique to this place. We did not get to see the mountains (Himalayas) due to the clouds but the trek was still very refreshing (plus the hot tea at the restaurant when we did retrace back :). We were charged Rs 500 for two of us and the car with a driver at the entry point, the fee helps to keep the place pristine. Please do your bit, do not take plastic bottles, carry your own reusable water bottle, don't litter, stay on trails (you would let other vegetation grow), enjoy the solitude and the scenery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r312916330-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Very good view", "review": "Good view to see. You must leave your hotel very early in the morning then you can see good view of himaliyan peeks. Infect we visited in april. It may differ experience from time to time seasons.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r314341458-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "freeeezing point", "review": "it is very cloudy n freezy at that time when i went there.it look like so near to sky as if jumped i can touch the sky.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r301033340-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A Lovely Nature Walk", "review": "It is a nature walk. About 3 Kms in the midst of the Jungles. No viewings of wild animals. But the Nature walk was nice. The lanes & pathways were great. No Place to relax or sit. You just have to walk till you reach the zero point. Look out for leaches. There are plenty of them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r314234325-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Amazing Jungle trek", "review": "Great dense forest to be in. Superb wild life sanctuary. Vehicle goes 8-9 kms inside the sanctuary and then there is a walk of about 2kms to Zero Point. Enjoy the pristine nature", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r320356581-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Easy walk to a gorgeous view", "review": "Our young kids loved the treck up to this view point. It's an awesome place to visit. Just the calming effect of the surrounding forests is amazing. The views from the top of zero point are spectacular. Just a tip- visit a toilet before you start waking up. There are no facilities here however there is ample bushland that caters for emergencies! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r274368223-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Awesome Place", "review": "It was amazing to be at this place..we enjoyed lots..my family had the most beautiful time here .must visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r327603170-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Famous for sunrise", "review": "If you are staying inside the Binsar Sanctuary area then must visit this for a spectacular sunrise and amazing view of Himalayas. Nothing more to expect here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r316017232-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Great View But No Better Than Can Be Had Elsewhere.", "review": "Drove to the car park at Binsar & then walked up to Zero Point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r323424870-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Trekking to zero point", "review": "The trekking to zero point inside the dense forest is the best experince in life. The sighting of various rare birds and their sound will make yoy alert.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r283934813-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Zero point at @ 8000 ft above MSL.", "review": "Its a beautiful walk/track among the reserved forest  Bird sanctuary of Binsar.., The total track is @ 2.5 to 3.5 km & has a zero point ( A tower with @ 15 steps for a breath taking view) at almost mid ways offering beautiful snow capped view of Himalayas on a clear day if you are lucky.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r283799617-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "way is better than destination itself..", "review": "its a 1 1/2 km easy trek in a jungle to reach zero point from kmvn guest house. the way to reach zero point is a beautiful path if its not raining...we went in june and it was full of dry leaves which was making it very beautiful...there are guides available to take with @ rs 300 for 2-3 hours which is good enough time to wonder and come back..carry your own water and snacks as nothing is available on the way ..its just jungle with some beautiful birds and insects...animals are hardly seen as told by guide...as there is nothing much to do in binsar..its a good time pass if you are fond of walking or trek...", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r279438301-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "A jungle trek", "review": "A perfect retreat for all those who want to spend some time amidst nature. It's a structure standing on pillars and can be reached through flights of stairs. A trek of around 2kms through the binsar wild life sanctuary, one could have a glimpse of the distant Himalayan ranges. A paradise for birdwatchers, one can see a variety of wildlife like the barking deer in a silent afternoon and the leopard as well. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r284113889-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Trekker\"s Paradise.", "review": "Zero Point is in Binsar  about 30 km. from Almora. Zero point has bewitching seenic beauty. Zero point is pitched at the impressive altitude of 2425 mtrs, Zero point is surrounded by thick forest of Oak and Rhododendrons. It offers a majestic view of the snow covered Himalayan peaks, The great range, Shivling, Nandadevi, Chaukhamba,Trishul and Panchachuli. From here one can have a glimps of the holiest temple in the Himalaya, Kedarnath, Badrinath and Gongotri.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r287838732-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Not to be missed", "review": "Wonderful drive, serene forest and breathtaking views of the himalayan range and Binsar valley. Bird sanctuary is a must see and ensure to take the services of a guide. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r287141269-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "On top of the world.", "review": "Zero point, Almora is a breathtaking trip from the start to the finish when you actually come face to face with the majestic Nanda Devi. The best time to go there is when we expect snowfall and that is around December-January. Serious photographers will have no complaints whatsoever and even the tourist is bound to be shutter happy. The trek is a little precarious as you are traveling all along the summit of the mountain. Good footwear is required and woolens with layerings is an absolute necessity. Trek poles may come in handy too. Its a good 2.5 km trek which takes time owing to the terrain but at the end it is ine hell of a view worth trekking for. Don't forget the snowball fights at the binsar top. And personalise your own snowman there! And once you come down, the steaming cuppa and noodles would probably be the best meal you have ever had.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r291304924-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Serene place!", "review": "From zero point you can see splemdid snow clad peaks of himalayas. Located an hour drive from Almora, it is very near to KMVN guest house of Binsar. Please don't confuse with another Binsar near Ranikhet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r288062387-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Dense Forest", "review": "Zero Point is approx 1.5 - 2.0 Km. far from Car Parking area & anybody can avail facility of Tea n Snacks in Canteen / Rest house at Near Car parking Area. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r263353453-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Lord of the Rings in fog", "review": "A walk towards Zero Point from the KVMN lodge in Binsar kept reminding me of Lord of the Rings, or Harry Potter when they enter the forbidden forest :-) The place looks spellbinding if you are fortunate enough to be there when it is shrouded in fog and mist. Magical! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r288727015-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great trek & views of snow clad Himalaya (for lucky ones)", "review": "Zero point (ZP) well inside Binsar sanctuary. You need to park your vehicles outside KMVN property and trek two km (one-way) in jungle to get to ZP. There is a watch tower here to view majestic Himalayas. If you are lucky, you are view 300 km range on a clear day. Trek is good. However, road from entrance of sanctuary to KMVN property (8-10 km) is not good and should be avoided in adverse conditions (fog, heavy rain, low light). Sight of big mammals etc is rare. This place is known for birds (though we didn't see any)", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r264669749-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Not sure of the hue and cry", "review": "We trekked to Zero point. Unfortunately, didnt find it anything extraordinary, worth the long trek. There are much better views (360 degree views) available in other places in and around Binsar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r265819054-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "LUCK", "review": "Its your luck that will let u see the HIMALAYAN rangers or not.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r267736846-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "The Himalayas", "review": "Try and be there by 7 am to have a clear view of the Himalayas across China, Tibet , India and Nepal. The view is mesmerizing . Wear good shoes and carry a bottle of water ( and off course your DSLR with a 300mm lens) ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r271501912-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Sun Set Point", "review": "It is on the top of mountains of Binsar forest, to reach there the motor vehicle go up to Binsar tourist rest house and little walk to reach Zero point, from there you can see the sun set very clearly, but depends upon the whether,there is forest rest house to stay which you may book in advance but no electricity. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r268046381-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A walk in the mountains", "review": "Wonderful walk with great many sightings of birds - guided by Mr. Hemu Upadhyay, who was a storehouse of information. Unfortunately, could only see a leopard's recent pug-marks!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r271716515-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Fabulous trek to reach here", "review": "It is a fabulous trek to reach zero point from the place where your car leaves you inside the binsar sanctuary... Always take a registered guide along with you... the jungle treks inside are too good....the birds chirping, fresh aroma around here is breathtaking....only negative thing is the end point...ie. zero point... the view is not that stunning..garbage around the area is bad...Go here if you line walking in the jungle", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r272947626-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Snow peaks viewing point", "review": "This is the top most point of the Binsar wildlife sactuary from where you can see the entire Himalayan range from trishul to nanda devi to panchuli Mountain range . The view of the snow covered Mountain s is breathtaking . But whether should be clear and obe shoukd go early . It is 10 km by road from main gate of Binsar wild life sanctuary , where there is kmvn guesthouse ,then further 2 km walk into the forest . Guides are available there at rs 300 for an hour n half . Kmvn serves lunc n dinner and small tea maggi chips n fruti stall is there . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r272828803-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Zero point, Binsar", "review": "Zero point for viewing the Himalayan mountains is located in Binsar bird sanctuary which has an area of 42 sq km. We took the taxi of Prem (mob 9719114008) and went there around 1 pm. We knew that we may not be able to see many birds, but our guide managed to show us a couple of birds and he gave us the names of many trees in that forest. One has to walk 2 km on a rough path at some gradient and that would take about 45 minutes for an average person.It is well-shaded path and the view all along is of dense forests! The zero point is a small open structure from where we could see some of the peaks of the Himalayan range. Luckily, there were no clouds that day and we could see the Himalayan peaks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r238401152-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Simple Trek!", "review": "Zero point is the highest point in Binsar and located in the protect Wildlife Santacury. The walk from the base near the KMVN guest house is about 3 kms one way. The route is simple apart from 1-2 steep stretches. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r272925299-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "must visit", "review": "please reach here before sunrise to enjoy the colour play as first rays hit nandadevi and ignite the snow. one by one all peaks get lit up. one can also see nepal mountains from here. enroute walking, we saw a barking deer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r238559332-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "Average landscape view", "review": "A Good 45 minute trek leads you to this place. Make sure you are ready for walking up and down which will easily take 1 and half hours. After about 45 mins you will reach this place. Nothing much to do at this place. taking kids with you is a difficult thing as you will not find anything en-route. So take enough water with you. Also the view from this place is not that spectacular. Also you will not be able to see much of birds,although they tell you this place is good for bird watching. only visit here if you have nothing else to do and have a lot of time at your disposal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r243292432-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Beautiful Scenery.", "review": "Beautiful view of the himalayas, pure air, excellent view of the surrounding wooded areas, glimpse of the local life, beautiful stones and pines trees lovely weather as the fog clears in the mountains by 0830 am therefore inspite of being cold and chilly felt good to feel the sun", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r248635650-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "snow galore", "review": "2.5 kms trek to the Zero Point was so worth it after we came upon a whole snow field...we made the customary snowman and had endless fun throwing snow balls..highly recommended!", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r248764575-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "A step closer to the mountains", "review": "Zero point is located right at the top of Binsar Sanctuary. While staying in Khali Estate, we happen to visit this place. Your car will take you up to the KVM Rest House situated at a scenic location deep inside the Binsar sanctuary.  From there you have to trek around 3kms inside the jungle to reach a structure which gives you a clear 180* view of the beautiful snow clad mountains. The walk is adventurous and fun as we happen to travel in first week of December and during day time also climate was cold and comfortable.  You get guides at the Rest House who can trek along with you. Carry your own water and food items as you will not find a single person inside the jungle forget about shops or small road side vendors", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r250159402-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "A good trek", "review": "It's a 3 kms trek to the Zero Point . Located at the top of Binsar sanctury provides it a very good view. Take water and some food along with you as the trekking is through the woods. Not advisable if you are old or have kids with you", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r255910153-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Quite and Calm", "review": "It's a bit of a Trek in the jungle from KMVN resort, and the vast expanse of the valley greets you in the end. There is machan at the spot which you can climb for an excellent view of the snow clad mountains and the valley. On the day we were not so lucky as the sky was overcast. But still the trek in the nature and the piece made it worth the visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r258953706-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "awesome view", "review": "the snow cladded mountains, the views, the forest trek, the woods, everything is just beautiful....trek down 7-8 kms and reach zero point log wood point.....u can see greens, snow and valley....", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r193416936-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "In nature's boundary....", "review": "If you are in Almora, don't miss this place. Nature walk is awesome, walking between the forest and the view from Zero Point is lovely. Only caution - If you are not accustomed to walk don't try this. Another, road from sanctuary gate to drop point is narrow n steep, makes it a bit adventurous! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r204918812-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "A Himalayan Spectacle!", "review": "Zero Point is located at the highest point in Binsar Wild Life Sanctuary, near Almora. There is a motorable road upto the KMVN Tourist Rest House from where you have to walk 1.5 km to reach the lookout platform.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r191782264-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Jungle is a great place to visit", "review": "This is a must visit. It is a 2 Km trek from base point. It is worth a visit. Jungle has different insects and flora/fauna. I was greatly energized by the visit to this jungle. Extremely positive energy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r205325069-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "From kati to zero point, voiceless !", "review": "One of the best treck i did in  India, many cheap way to sleep and eat on the way, simple and authentic villagess, wonderful landscapes and dramatic sceneries during the 8 days treck !", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r206467370-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Great Trek", "review": "It is an awesome drive 5kms and then trek of 2kms inside a forest to a point where there is nothing beyond and all scenery of beautiful snow capped mountains", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r223446817-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Top of the world", "review": "Nice place at 8000Ft. Not much birds seen due to water shortage in the forest. But nice experience going in the forest with guide.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r208468876-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "nothing spectacular but dont miss", "review": "it is the closest to CM Binsar at 22 kms (one way). Do take a guide after parking your car. it will be worth every penny you pay him. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r209136855-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "Nice short walk", "review": "Zero point is the highest point inside Binsar wildlife sanctuary, near Almora. To reach it you need to drive up to the KMVN guest house, where there is space for parking. You climb the last 300 meters over about 1.5 kilometers, making this a really easy climb. On good days you will have a great view of the Nanda Devi range at the end of the climb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r236758206-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "A good forest walk", "review": "It is called Binsar Wildalife Sanctuary but in reality there is no wildlife. Your hotels may try to sell you some packages which I think is not required. You will be fine on your own just dont wander away from the main path in the forest. This is an ideal place for nature lovers. The walk ends on the zero point which shows you all the mountain ranges but only if the weather is good", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r156448883-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "Stunning views, easy trek", "review": "1 hr round trip trek which is a must when going to Binsar wild life sanctuary. Please take a guide for Rs 300 which will be very helpful", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r157273916-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 3.0, "title": "go because it is there:-)", "review": "Zero point is too popular a place to be peaceful. Unless you choose your time carefully.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r237236446-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 5.0, "title": "it was sheer beauty", "review": "first the walk upto the zero point, worth the walk.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r183226693-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "100 Points", "review": "Zero point is a space that has an amazing view of the silver mountains. People trek a short way to zero point, check out the view and come back to the small parking near the KMVN rest house. What is unknown to many people, is a small path behind zero point that you can take for a lovely trek down the mountain to a small temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r177470587-Zero_Point-Almora_Almora_District_Uttarakhand.html"}, {"point_of_interest": "Zero Point", "rating": 4.0, "title": "A nice trek, walking in a protected jungle", "review": "Clean and well maintained trek, we preferred taking a guide with us. It helps you to know more about the flora and fauna. Carry your own water and snack and there are no shops anywhere. Best time is just around the monsoons.", "url": "https://www.tripadvisor.in/ShowUserReviews-g679053-d3923567-r177203754-Zero_Point-Almora_Almora_District_Uttarakhand.html"}]