[{"point_of_interest": "Collector's Paradise and Vintage Art Gallery- Mr. Ashok Tak", "rating": 4.0, "title": "Nice place to roam", "review": "This is a very nice place to buy a variety of decoration items, clothes and other materials. Reasonable price.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d12248541-r550427643-Collector_s_Paradise_and_Vintage_Art_Gallery_Mr_Ashok_Tak-Pushkar_Ajmer_Distric.html"}, {"point_of_interest": "Collector's Paradise and Vintage Art Gallery- Mr. Ashok Tak", "rating": 5.0, "title": "A must for any textile and vintage fans", "review": "I came upon this little gem by chance. The owner is friendly and very interesting to talk to. His shop is simply a treasure trove of clothes, fabric and decorative items.  You could easily spend an entire day there and still not see everything.  I bought a lovely beaded very wearable navy jacket, for 350 inr.  Everytime I thought I had seen the most beautiful thing I discovered something else hidden underneath.  For anyone whose idea of heaven is spending an afternoon discovering treasures and wondering about the history of such items, you must visit this shop.  He also has some beautiful children's clothing,  wearable pieces as well as museum pieces.  There is also a tailor close by so any piece can be altered to fit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d12248541-r472004700-Collector_s_Paradise_and_Vintage_Art_Gallery_Mr_Ashok_Tak-Pushkar_Ajmer_Distric.html"}, {"point_of_interest": "Collector's Paradise and Vintage Art Gallery- Mr. Ashok Tak", "rating": 4.0, "title": "Good Place for Shopping", "review": "If you would like to buy something special for someone you can visit this place. It has lot of this to offer. Lot of vintage art and nice colorful dresses.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d12248541-r556586248-Collector_s_Paradise_and_Vintage_Art_Gallery_Mr_Ashok_Tak-Pushkar_Ajmer_Distric.html"}, {"point_of_interest": "Collector's Paradise and Vintage Art Gallery- Mr. Ashok Tak", "rating": 4.0, "title": "Good and economic", "review": "The place has hand made as well as outside garments. The prices are pocket friendly and they have a large variety.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d12248541-r627638872-Collector_s_Paradise_and_Vintage_Art_Gallery_Mr_Ashok_Tak-Pushkar_Ajmer_Distric.html"}]