[{"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "An incredible experience", "review": "Photographer's dream trip, so much to see and do! We enjoyed a camel cart ride or two, watched horse and camel displays, and bought lots of Rajasthani horse gear. Amazing, relentless, inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r639295227-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Pushkar Camel Fair", "review": "Pushkar Camel Fair, this is very special thing to do in Pushkar. you can do camel ride here. so many camels are there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641405021-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 2.0, "title": "Few camels but TONS of scam artists", "review": "Overall, I would say that you should go to Pushkar, get a hotel with a beautiful rooftop view of the lake, and have breakfast & tea while watching the sun go down.  As much as I hate to say it, we loved the little town of Pushkar and the people that ran our hotel.....as well as the views of the lake at day or night.  Although we were fortunate enough to see one very beautiful and moving Hindu ceremony, we would not visit again during the Pushkar Camel Festival (there really are no camels).  People were arriving at the lake at 3:45 in the morning and the noise was overbearing by 4:30 AM. Lots of scam artists and beggars. The crowds, smells, and relentless noise just wasnt worth it to us. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641210028-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Hundreds of camels", "review": "Our tour group visited Pushkar at the time of the annual Camel Fair and it was certainly an assault on the senses. Hundreds of camels, dust, noise, market stalls, hordes of people, including very poor looking families in makeshift camps everywhere, touts flogging all sorts of merchandise, beggars including what looked to be Hindu priests and camel cart rides. It is obviously a major trading event for camel and horse owners and a significant cultural experience for tourists who flock here for this event.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r644448930-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Bustling camel and horse trading fair", "review": "Our first visit here and we saw hundreds of camels and horses for trade; by small time traders all over india. I believe this fair has become smaller over time. However, it is still interesting to see the many camels, how they are cared for, and visiting the families that make tented homes here for the fair. Small tents with outdoor makeshift kitchens. Groups of men and women gather togethers squatting in small groups to while away the time, Also lots of small shops selling camel and horse paraphernalia, together with small shack restaurant, household good and clothing shops and fruit/vegetable stalls. Lots of active and vibrant life here.  But be prepared for the noise, dust, dirt and lack of toilet facilities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645595709-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Pushkar Camel Fare", "review": "The Pushkar Camel Fair is much more than just a Camel Fair it is an incredible Fair with event that also include the visiting Foreigners like the  Indians vs Foreigners Tug of War, and the Foreigners Bride and Groom Contest, Indians vs Foreigners Cricket Match, as well as much more. This is a Fair like Non Other, this is a Fair where everyone is apart of the great stage. Oh Yes and 30,000 Camales with 10,000 Desert Peoples and their families that have come from great distances to be here. I highly recommend the Pushkar Camel Fair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645749122-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "A highlight of our trip", "review": "Unknown to us at the time of booking our tour, the Pushkar Camel Fair just happened to be on as we were travelling through the area on our way to Ajmer.  We have stayed in Pushkar on a previous trip, but had missed the Fair by one week, so we asked our driver/ guide to stop for a few hours so we could have a look and we were very glad we did.  It was a morning visit, but there were still lots happening.  Camel rides, entertainment, horses for sale, lots of rides, stalls selling clothes, household items, souvenirs and various other wares, food vendors etc.  Lots of colour, lots of noise, but all very exciting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r646461867-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Camel fair rink", "review": "Central location from the lake. Would need to take a cab or camel to get there! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r654513620-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 1.0, "title": "Disgustingly cruel", "review": "If this was elephants or tigers no one would have a bar of it, it is so cruel. Making the camels perform tricks (‘dance’) and stand (and fall off) tiny podiums, and stand around all day in the dust and heat to give tourists rides. I watched a young male camel held to the ground by a group of men and have his legs tied so that he couldn’t stand up. Apparently this was to ‘subdue’ him. Then there is the relentless begging and heavily inflated accommodation prices. Don’t bother.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r635055437-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "A photographers' paradise", "review": "Having wanted to visit for years, I eventually made it. It is a magical place to take photos at. The best place is around the back-stage grounds where they keep there camels. This is a genuine and nice area to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r635325086-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Great Day", "review": "Did a day trip from Jaipur in a hire car with driver. What an interesting day! Camels galore, beautiful stallions prancing down the street, markets and food stalls and lots of Rajasthani desert tribes. Beware the gypsie children pickpockets. Don't miss it if you're in Rajasthan when its on.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r635753537-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Noisy, crowded - worth the hype?", "review": "We arrived in Pushkar the last day of the fair and thanks to the crazy traffic and road blocks, we did not step out of our hotel in the evening to visit the fair. We went the next day and from what we saw, this might have been worth it earlier on but in these years it has become much more of a tourist trap. And very dusty, noisy, crowded and didn't look well-managed. Indians should think once more before making the decision to visit - it may be an attraction to people outside India but maybe not worth the travel for us Indians. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r637023651-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Amazing! But decrease in its charm year by year", "review": "A unique experience with people and camels.Different culture. I got to talk with the camel owners who came from different places to sell the camels. Funny thing was the three people I got to talk was unmarried and was about the age of 65-70. Yes, they insisted not to get married. They offered their roti they were making. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r637441055-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Air quality very bad!", "review": "After about 10 minutes walking through the fair on our Riviera tour there was so much smoke from people cooking over fires, plus the dust being kicked up & the heat I was finding it difficult to breathe. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r637639219-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 1.0, "title": "Lost the charm of Rustic Rajasthan", "review": "Ones used to be the biggest cattle fair now reduces to few hundred camels and horses. Characteristic sand dunes now are grabbed by unknown organisations. Or converted into farmland and resorts. Nothing close to what it was, You will be disappointed if you visit this place to see rustic Rajasthan. its just good place for a weekend trip. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r638110801-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Indian Golden Triangle Tour", "review": "It was the best ever, enjoyed the camel ride, the colorful culture that included the classical music and dance, at night, the air balloon which was fabulous, the ceremony by the lake, shopping stalls, the Horse trading, best-bedecked camel in parade winning the beauty contest.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r638103684-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Unique and fun event", "review": "No really, how many have been to a camel (and Marwei horse) fair?  From a camel cart ride through the fair to checking out the camels and horses to enjoying the spectacular dance presentation with women in traditional garb, it was almost sensory overload.  Highly recommended!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r638171205-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "What used to be a livestock fair!", "review": "Over the years Pushkar Fair has evolved from being a livestock fair to a celebration for the locals and something of a wonder to foreigners with limited chromatic exposure and used to empty roads. One can see a few horses, camels, and a few stores selling accessories for them. However, it's nothing like it used to be. Modernisation in farming has drastically reduced the need for animals. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r574736923-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "4 days with the camels.", "review": "I went in 2003,  traveled there from New Delhi on  a rented British Enfield motorcyle ,  and continued throughout Rajasthan", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r582824655-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Vibrant...", "review": "A historical camel fair which is an annual event for locals has now turned into annual celebration event which attracts tourist from all over the world.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r575949429-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Very unique experience", "review": "Pushkar camel fair is an an annual multi-day livestock fair and cultural extravaganza and is thronged by thousands of tourists from India and abroad. Pushkar is a very small town and can be easily covered by foot. During the mela, huge number of shops are set, which sell traditional Rajasthani items like handicrafts, jewelry, shoes, clothing items along with delicious street food, which gives a very colorful look to the town. Pushkar mela, also falls during an important pilgrimage season for Hindus as the only Brahma temple in the world lies in Pushkar. The Pushkar lake is also considered among Hindus, as they believe taking a dip in its waters washes away one’s sins. One can also see a huge number of priests wearing saffron colored robes, visiting Pushkar during that time. Overall, one can have a very unique, cultural experience during the camel fair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r591313038-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "A vibrant and colorful experience!", "review": "Had been to Pushkar Camel Fair Adventure Festival couple of times. Its indeed the largest fair which is graced by several thousands of camels, cattle, and the other villagers. Traditional street food is amazing! Its shoppers paradise but you have to really show your bargaining skills. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r623369547-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Visit to Pushkar camel fair 2018", "review": "What an amazing experience", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r634084427-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "An amazing experience of alifetime", "review": "This was my first visit to Pushkar Camel Fair this year and  I was left speechless witnessing this extravaganza. It was huge this year with thousands of camels and very large number of horses as well.  I am a hobby photographer and this provided me with the best photo  opportunities. All the locals including tiny children know that photographers from across the globe come there for photography and thus, they are tuned to ask for money at a drop of a hat.  It is best to go there with lots of change (Rs. 10, 20).  It is also wise to ask them if one can take a picture.  A great place, a great spectacle awaits you. Typically it would be held in the month of November every year. A must visit, witness fair for sure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r634288110-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Sorry to say way over hyped.", "review": "A visit to the Pushkar Camel Fair was planned as the highlight of our tip to India.  Many travelers write of it's pageantry.  Although, one can get great photographs of people and animals, the reality is a sprawling, disorganized, incredibly dirty and dusty side show.  Over the past year's it has evidently devolved from a practical livestock show, to a large scale tourist trap.  The camels  are largely dedicated to giving tourists cart rides, the streets are full of touts and beggars and the \"events\" in the small stadium ludicrously third rate.  It's a great opportunity to watch the abuse of animals that are literally led around by their noses, flogged and tormented.  Cross this one off your list.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r634611761-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "pushkar fair -2018", "review": " ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r634329798-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Crazy ", "review": "This was our last port of call . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r634941957-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Went to see the camels", "review": "I went on Thursday, 2 days before the fair officially started as I was only interested in seeing the camels.  I was able to wander around the camel area without interruption. It was a wonderful sight to see so many camels and to see the negotiations happening. I would recommend doing this. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r536749685-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Great experience", "review": "Camels and people. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r536755409-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 1.0, "title": "Not what we expected ", "review": "Lots of beggars, you feel quite unsafe - lots of warning before the fair to be careful for thieves and you can feel the presence. Begging children very persistent. Gypsy children block off the road at night and make you pay \"foreigner\" tax, scary experience. Animals look mis-treated and it's not nice to see. A shame as came to Pushkar especially for this!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r537155654-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Extraordinary; if the Camel Fair isnt on your bucket list, it should be", "review": "What an amazing experience; everything you could ever need for you camel and so much more. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r537311325-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 2.0, "title": "Mela visit ", "review": "Pushkar mela is loosing it's charm  year by year lot of beggars no dustbin no mobile toilets no watercoolers for water no lockers for people going to temple because they stop u to carry bag inside problem for single people arises then .empty ground no events like before horse ban also dented tourist hopes and photography lovers ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r538215434-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 2.0, "title": "A hype made by digitally enhanced pics", "review": "Pushkar fair - it is like any other small town fair in india and you don’t have to come to all the way to Pushkar. I was so disappointed to see no management by any government body. It is dirty, filthy and nothing to take away as memories. Speakers blaring bollywood song, 100 percent unhygienic things to eat, dust ( not sand) camel safaris ... I was shocked to see how come this fair is so internationally popular???? Some old Indian type rides, magic show stalls and junk clothes, toys shops. I took my big camera rig with me for photography and there was nothing to motivate me to open my camera bag. Go to Pushkar Only if you have some religious believes and visit Brahma trample and the lake ( lake is nice )", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r538393329-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Visit early", "review": "The fair starts around October 23 so if you are planning to go, do it early. All the interesting stuff with thousands of camels happens at the opening. When we got there on November 1, the Camel Arena was empty. What was left were the tourist camel taxis offering rides and individuals paddling trinkets. However, there was a lot of action outside the fairgrounds and in the  old town. The colors, music and surrounding noise are incredible. As in the rest of India, be ready for beggars and peddlers. We wandered around the city for few hours and have not experienced any problems. Same as in the rest of India, don’t let anyone bless you by marking your head. If you do, be ready to pay. This happened to me in the temple. Sometimes they throw flowers at you. Don’t catch them. If you do, you pay for being blessed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r538031223-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Lots of animals and people!!", "review": "The Pushkar Camel Fair was a very interesting experience, with camels and horses (and manure) everywhere.  When not walking or riding around the animal area, there's a large market with people selling all sorts of goods, foods, etc.  The fair also coincides with a holy period of time in Pushkar and its holy lake.  Be prepared, however, for a huge culture shock.  You cannot possible understand or appreciate the nature of this event.  There is filth all over the fair (as there is no effective trash collection/removal system), and the heat and animals can make this a very trying trip.  But it's certainly worth the experience, if you want something completely different than anything you might have previously experienced.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r539463832-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "I love camels", "review": "We stayed for most of the fair in order to see the hordes of camels during the trading (first week) and some of the fair events (second week), and I did not regret the longer stay. I found Pushkar to be a charming town, although it was very crowded during the fair. The upsides include the camels, decorated camels, moustache contests, the colors, the brahmen and sadhus arriving throughout the fair week for the pilgrimage, good prices in the shops, and some delicious restaurants to choose from. The downsides were lots of begging (not unlike most of India anyway), many people, and quite a bit of dust in the air from all the cattle (until the wind picked up later in the week). One thing that really got to me was how unsafe my husband and i felt walking, rather accidentally, down a dark street in the gypsy camps at night. Almost no women around and some of the men were threatening. Police are concentrated on the main roads and we made our way back as fast as possible. Also, most of the camels are treated quite roughly, as is expected in India (whatever happened to ahimsa?) but not normally seen in places like northwestern Africa where camels are quite costly and precious. Some of the camels were treated fine, and some of them were treated cruelly. :(", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r540148105-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Only Happens Once a Year", "review": "While one person said it was just a livestock fair, we thoroughly loved seeing all of the people and animals. The energy was great and if you want to see Indians from all walks of life this a great place see just that. Great picture taking too!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r447912935-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "What an amazing experience!", "review": "We spent two days at Pushkar during the annual camel fair. Our lovely driver was our guide and we had a great time! Walked around at different times of the day. Best was early morning with camels and people just waking up and breakfasting. Such beautiful beasts, the camels and many decorated in their best.  The extraordinary Mawari horses were pretty special too - beautifully groomed and well-fed, many were for sale.  Anyone want a prize stallion for $14,000? Purchased some camel bells as a souvenir from one of the well-stocked  stalls at the fair - everything to enhance the beauty of your camel or horse! A very special and intriguing part of Indian culture...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r562568024-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "A brilliant a colourful spectacle.", "review": "This is one of the iconic attractions in India.  Held only once a year, it has all the colour, sights,smells and sounds that you are unlikely to experience anywhere else in the world.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r450273924-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "OMG so many camels, seriously", "review": "The Pushkar Fair is not just about Camels, in fact it is a religious pilgrimage in honor of Hindu god Brahma (the only temple dedicated to Brahma in India is in Pushkar). Pushkar is actually a small town situated in the middle of the dessert. It comes to live during the festivities that take 12 days, when people from all over North-West of India come to attent the Fair. The atmosphere is incomparable. It is a combination of a authentic local market, camel racing, processions, acrobats, priests and a real explosion of color.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r461265302-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Rajasthan - Pushkar --- Beauty", "review": "The Pushkar Fair (Pushkar Camel Fair) or locally Pushkar ka Mela is an annual five-day camel and livestock fair held in the town of Pushkar in the state of Rajasthan, India. It is one of the world's largest camel fairs. Apart from the buying and selling of livestock, it has become an important tourist attraction. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r451822362-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Wonderful Festival", "review": "Attending this Festival (which includes huge horse and camel auctions) is the reason we visited India last November and we were not disappointed.  Its timing, like many things in India, is set by a coming full moon, when the festival ends.  Our good fortune was that it was the largest full moon since 1948.  Our visit was early and we think that was a blessing as we had smaller crowds so a unique opportunity to meet (with the help of a guide) and interact (including breaking  bread) with the camel and horse traders, both Hindu and Muslim.  It was an unforgettable experience!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r458526377-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "One of the Largest animal trade fair in india", "review": "The fair is organised during october and november period in pushkar city of rajasthan, its an amazing festival and pilgrims from all over rajasthan arrive to take a dip in holy pond near brahma temple. An amazing festival with awesome Rajasthani culture experience all around. must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r469887794-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Exotic Desert Experience", "review": "The Pushkar Camel Fair is a photographer's dream. Camels, colorful desert dwellers, pilgrims, a sacred lake, a carnival, booths with all kinds of goods for sale ... all rolled into to dusty days under the full moon. Not to mention the mustache competition and the turban tying contest. A once a year treasure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r474772660-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Not camel fair but truly a fair", "review": "Visited this place late evening. Tremendous rush, really looked like a huge fair. great experience. be careful if you are taking small kids", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r484353068-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Fair", "review": "Hello. I need a help. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r531679869-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Interesting place", "review": "We went just before the fair opens, but when all the cakes and horses are there. We weren’t interested in the fair, only in seeing the animals!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r536114233-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "the largest cattle fair we show", "review": "my god, we have seen 1000 and 1000 of camel herds and to come pushkar fir just tradings. amazing, lots of local people, beautiful village ladies   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r440275583-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Camels Everywhere!", "review": "My sister and I booked our tour to India to coincide with the Pushkar Camel Fair.  It was like a state fair but without the pie and jam contests.  This focused on camels, cattle and horses.  There was lots of food too.  But mostly, it was about the camels.  Its hard to explain why this was such an experience.  For a city person, it was just amazing all the way around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r440174951-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Wonderful agricultural fair", "review": "Huge agricultural fair featuring camel auctions, horse trading, acrobats, equestrian displays, camel rides. Huge crowds. Very colourful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r439986107-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Once in Your Life", "review": "It's a once in your life experience.  I booked my tour of India to coincide with the Camel Fair.  Lots of camels, horses, goats, etc. for show and some for sale.  Packed with locals, items for sale, food of all kinds, and lots of color. Very dusty and air quality not good, so I would advise wearing a mask.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r440518935-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Unique and wonderful", "review": "The Pushkar fair is an event look forward to throughout the year. Held over a period of ~7-10 days, the travel and stay bookings happen well in advance. Prices shoot up. The festival is beautiful and well organized in the fair ground. People from all over the country visit to see the horse competition, moustache competition, bride/ groom, music pefformane, horse and Camel show and more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r441689604-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Camel fair 2016", "review": "It was a awesome trip . A came fair full of colour and enthusiasm . One should experience it once in his lifetime . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r441919451-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "One of its kind fair!!", "review": "The fair was fun. We had rides at the fair. There were cultural performances and even a concert in the evening. Though due to demonetization, the fair was little affected. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r442066612-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Good for Photography", "review": "I have visited this fair in 2016. This is a unique activity where one can meet camel herdsmen from all around the country and traders as well as colorful singers and dancers from Kalbelia tribe. The fair still attracts trading activity and is good for photograph.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r446706821-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Unique experience", "review": "The Pushkar Camel Fair is a unique experience. It is in fact an assault on your senses. The sights, the sounds, the smells! The mela is a chance to see ancient Rajasthani culture up close and personal. A photographer's dream, as you will see some amazing sights there: herds of camels, colorfully dressed Rajasthanis conducting business or enjoying the fair. There are a lot of incredible hand made local crafts for sale by individual vendors from the region, but of course there are some trinkets mixed in. Enjoy some masala chai in a clay cup for 10 rupees. You'll be glad you did. I saw more Westerners at the Fair than anywhere else in India (with the obvious exception of the Taj Mahal), but still it has not devolved into a tourist trap, as there are many more local fair goers and religious pilgrims than Western tourists. Definitely bring a mask, though, as there is a great deal of dust that is kicked up by all the camels, people and commotion.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r436984558-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "amazing experience one of a kind", "review": "Total fun and full of spirit, be the lake or sand or animals trading fair - everything will get you involve, see drama unfolding every minute which is best for photography lovers. Cordial locals and amazing food will add on the experience. Good management and events held by government. A must-have family affair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r447370135-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Maddening but worth it?", "review": "The minute you set foot in Pushkar during the Pushkar Camel Fair, you see nothing but people and more people and then some more people! It's a small village and the streets are pretty narrow so the crowd becomes a little overwhelming at times.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r437276671-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Don't miss this event when u'r in Rajasthan Tour", "review": "It's a very unique event I've ever seen, eventho the weather was really burning my skin and the dust was pretty annoying.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r437329037-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Absolutely fabulous", "review": "Visited from 2 to 5 November 2016 as part of a tour with Indian Moments and had the most amazing experience while staying at their Camp Bliss.  Only regret was that we couldn't stay longer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r438204185-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Don't go by hype, but still it is good", "review": "Attended this, it was good and unique experience, saw some of the competitions like turban tying, moustache competition etc, it was good. You can also visit Lord Brahma temple in pushkar and take a walk/bath in pushkar lake.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r437795220-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Spectacular", "review": "One of the most spectacular experience in my travel across rajasthan, almost surreal seeing so many camels and colourful turban dotting the desert.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r437712891-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "The photographer's paradise!", "review": "I spent one week in Pushkar, when the camels were arriving to the city. It's such an amazing event for those who love photography! Thousands of camels, horses, sunsets, ferriswheel, vibrant market and so on. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r438683394-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Annual pushkar mela 2016", "review": "Been there on a weekend end, it's about 560kms from Ahmedabad. This is an annual fair of pushkar where in breeder and farmers swell and buy Cattle, camels / horses. Apart from this there are numerous temporary stalls selling everything and anything related to farming and cattle breeding. You will love the vibrant colour full atmosphere around, lots of eateries serving local delicacies. Fun rides in the mela ground, various sports events organised by the mela organisers such as tug of war, Sand art, face painting. It's a must visit if your in Rajasthan and near Ajmer. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r438708602-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Movie scenery! ", "review": "We visited for one day , and it was like be part of a movie ! Paradise for photography lovers ! More than 6000 camels , they said . Horses , cooking , bazar , dancing ,music ... all like in front of us . We combined it with a visit to the holy lake , also very crowded because of the fair ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r439542471-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Beautiful fair", "review": "Pushkar camel fair is very famous for its unique exhibition of camels for trade. Beautifully decorated camels will attract any tourist and its a great affair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r410126594-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "haven't been but great!", "review": "haven't been but great! must go with utmost haste. Love camel life. I just love camel's, they are so fab", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r422573520-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "amazing  life time experience", "review": "this is a lifetime activity and if you visit india must see the real colors of culture tradition and religion ... the real india as well go to mela ground during fair  you will find that noting id better then this in this world the real villagers their costumes their culture and  many activities between villagers and tourists", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r429047305-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Chinese photo tourists spoiler", "review": "I guess it's inevitable but Pushkar camel mela has become over run with photo tourists in big groups. I don't mind the fact it's now very popular but the disrespect by this guided group of Chinese was a disgrace. They were paying the local camel herders in pre arranged photo set ups, nudging and pushing them around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r434946080-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Unique Festival Experience", "review": "Pushkar Camel Faire is a unique festival that encompasses many events and activities. It coincides with the worlds largest livestock auction including 20,000 plus camels along with horses, cows, goats and more. This is a wonderland cultural event and is an excellent way to learn all about the Kolbelia Gypsy culture and other Rajasthan Folk traditions. Be sure to pick up an events schedule and spend time attending the many events that take place at the exhibition grounds. A trip around the cattle grounds with your camera is also a must. I attend this festival annually and there is always something new to experience. Just get out there and enjoy!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r436009337-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Camels", "review": "7th November.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r435356794-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Dream of every photographer", "review": "It is said that Pushkar camel fair is the biggest camel fair in Asia.I would say it has lot many other attractions apart from just being a camel fair.It offers lot many other things. There is a huge market for horse, bulls, cows and other cattle. This time the hot air balloon was the major attraction of the fair.Tourist enjoy the camel cart safari.There is a ropeway near Savitri Mata temple and a small shilpgram for art lover.Camel fair is a paradise for the photographers. if you want to experiance the holistic activities tries to stay near the pond and Bramha temple area. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r436591738-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Unbelievable ", "review": "What an amazing experience. Everyone should travel here at least once and attend at least one to two days of the fair. The sights, sounds and smells were truly unbelievable. I was finally able to ride a camel", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r436714889-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Amazing place to visit in November during the Camel Fair", "review": "Pushkar itself is a very nice visit during a trip to Rajasthan region in India, well worth 2-3 days time if not more just to chill, relax and soak in the Indian religious culture that surrounds its famous lake.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r109155894-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "one of its kind fair", "review": "wow, unbelievable fair no boundaries no limitation 100 of thousand cattle, trading of horse, shepherds cocking food under the sky with wood on clay.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r436732464-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Rajasthan desert amazing Indian spectacle. Thousand of colourful nomadic tribes.", "review": "Returned with our family after 25 years to give the children an out of this world experience and saviour the atmosphere, sounds, smells, sunsets, tribes, livestock in a beautiful oasis village. Around 20th 23rd November each year book way in advance better accommodation is taken early.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r358158291-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "A Highlight of Our Trip", "review": "We spent 3 days here glamping in a luxury tented village.  Imagine 50,000 camels, cows and horses in one place for a week with traders wheeling and dealing.  Lots of music 24 hours a day.  Lots of shopping.  Ride a camel here!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r365775393-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "One should never miss Pushkar Cattle fair visit", "review": "Pushkar Cattle Fair that’s held between October-November at the time of Kartik Purnima every year. It is believed to be one of the world’s largest livestock fair, graced by thousands of camels, livestock, farmers and other villagers. However, you can witness much more than that in this biggest traditional carnival. If you fond of photography then this fair you get ample of opportunity to click on your camera. Horse and camel trading and their accessories are main highlights of this Pushkar camel cattle fair. Many foreign tourist visit and participate in sports activities", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r366883914-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "An incredible experience", "review": "Photographer's dream trip, so much to see and do! We enjoyed a camel cart ride or two, watched horse and camel displays, and bought lots of Rajasthani horse gear. Amazing, relentless, inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r639295227-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "What a spectacle!", "review": "This is an amazing spectacle! Thousands of camels, horses and farmers/traders from miles away! Bartering and haggling over prices. Interesting to see them inspecting the camels - checking their teeth, hooves, etc. saw some horses for sale at over a million U S Dollars!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r408532501-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Pushkar Camel Fair", "review": "Pushkar Camel Fair, this is very special thing to do in Pushkar. you can do camel ride here. so many camels are there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641405021-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 2.0, "title": "Few camels but TONS of scam artists", "review": "Overall, I would say that you should go to Pushkar, get a hotel with a beautiful rooftop view of the lake, and have breakfast & tea while watching the sun go down.  As much as I hate to say it, we loved the little town of Pushkar and the people that ran our hotel.....as well as the views of the lake at day or night.  Although we were fortunate enough to see one very beautiful and moving Hindu ceremony, we would not visit again during the Pushkar Camel Festival (there really are no camels).  People were arriving at the lake at 3:45 in the morning and the noise was overbearing by 4:30 AM. Lots of scam artists and beggars. The crowds, smells, and relentless noise just wasnt worth it to us. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641210028-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Hundreds of camels", "review": "Our tour group visited Pushkar at the time of the annual Camel Fair and it was certainly an assault on the senses. Hundreds of camels, dust, noise, market stalls, hordes of people, including very poor looking families in makeshift camps everywhere, touts flogging all sorts of merchandise, beggars including what looked to be Hindu priests and camel cart rides. It is obviously a major trading event for camel and horse owners and a significant cultural experience for tourists who flock here for this event.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r644448930-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Bustling camel and horse trading fair", "review": "Our first visit here and we saw hundreds of camels and horses for trade; by small time traders all over india. I believe this fair has become smaller over time. However, it is still interesting to see the many camels, how they are cared for, and visiting the families that make tented homes here for the fair. Small tents with outdoor makeshift kitchens. Groups of men and women gather togethers squatting in small groups to while away the time, Also lots of small shops selling camel and horse paraphernalia, together with small shack restaurant, household good and clothing shops and fruit/vegetable stalls. Lots of active and vibrant life here.  But be prepared for the noise, dust, dirt and lack of toilet facilities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645595709-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Pushkar Camel Fare", "review": "The Pushkar Camel Fair is much more than just a Camel Fair it is an incredible Fair with event that also include the visiting Foreigners like the  Indians vs Foreigners Tug of War, and the Foreigners Bride and Groom Contest, Indians vs Foreigners Cricket Match, as well as much more. This is a Fair like Non Other, this is a Fair where everyone is apart of the great stage. Oh Yes and 30,000 Camales with 10,000 Desert Peoples and their families that have come from great distances to be here. I highly recommend the Pushkar Camel Fair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645749122-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "A highlight of our trip", "review": "Unknown to us at the time of booking our tour, the Pushkar Camel Fair just happened to be on as we were travelling through the area on our way to Ajmer.  We have stayed in Pushkar on a previous trip, but had missed the Fair by one week, so we asked our driver/ guide to stop for a few hours so we could have a look and we were very glad we did.  It was a morning visit, but there were still lots happening.  Camel rides, entertainment, horses for sale, lots of rides, stalls selling clothes, household items, souvenirs and various other wares, food vendors etc.  Lots of colour, lots of noise, but all very exciting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r646461867-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Camel fair rink", "review": "Central location from the lake. Would need to take a cab or camel to get there! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r654513620-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "An incredible experience", "review": "Photographer's dream trip, so much to see and do! We enjoyed a camel cart ride or two, watched horse and camel displays, and bought lots of Rajasthani horse gear. Amazing, relentless, inspiring.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r639295227-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 2.0, "title": "Few camels but TONS of scam artists", "review": "Overall, I would say that you should go to Pushkar, get a hotel with a beautiful rooftop view of the lake, and have breakfast & tea while watching the sun go down.  As much as I hate to say it, we loved the little town of Pushkar and the people that ran our hotel.....as well as the views of the lake at day or night.  Although we were fortunate enough to see one very beautiful and moving Hindu ceremony, we would not visit again during the Pushkar Camel Festival (there really are no camels).  People were arriving at the lake at 3:45 in the morning and the noise was overbearing by 4:30 AM. Lots of scam artists and beggars. The crowds, smells, and relentless noise just wasnt worth it to us. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641210028-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Pushkar Camel Fair", "review": "Pushkar Camel Fair, this is very special thing to do in Pushkar. you can do camel ride here. so many camels are there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r641405021-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "Hundreds of camels", "review": "Our tour group visited Pushkar at the time of the annual Camel Fair and it was certainly an assault on the senses. Hundreds of camels, dust, noise, market stalls, hordes of people, including very poor looking families in makeshift camps everywhere, touts flogging all sorts of merchandise, beggars including what looked to be Hindu priests and camel cart rides. It is obviously a major trading event for camel and horse owners and a significant cultural experience for tourists who flock here for this event.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r644448930-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Bustling camel and horse trading fair", "review": "Our first visit here and we saw hundreds of camels and horses for trade; by small time traders all over india. I believe this fair has become smaller over time. However, it is still interesting to see the many camels, how they are cared for, and visiting the families that make tented homes here for the fair. Small tents with outdoor makeshift kitchens. Groups of men and women gather togethers squatting in small groups to while away the time, Also lots of small shops selling camel and horse paraphernalia, together with small shack restaurant, household good and clothing shops and fruit/vegetable stalls. Lots of active and vibrant life here.  But be prepared for the noise, dust, dirt and lack of toilet facilities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645595709-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 5.0, "title": "Pushkar Camel Fare", "review": "The Pushkar Camel Fair is much more than just a Camel Fair it is an incredible Fair with event that also include the visiting Foreigners like the  Indians vs Foreigners Tug of War, and the Foreigners Bride and Groom Contest, Indians vs Foreigners Cricket Match, as well as much more. This is a Fair like Non Other, this is a Fair where everyone is apart of the great stage. Oh Yes and 30,000 Camales with 10,000 Desert Peoples and their families that have come from great distances to be here. I highly recommend the Pushkar Camel Fair.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r645749122-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 4.0, "title": "A highlight of our trip", "review": "Unknown to us at the time of booking our tour, the Pushkar Camel Fair just happened to be on as we were travelling through the area on our way to Ajmer.  We have stayed in Pushkar on a previous trip, but had missed the Fair by one week, so we asked our driver/ guide to stop for a few hours so we could have a look and we were very glad we did.  It was a morning visit, but there were still lots happening.  Camel rides, entertainment, horses for sale, lots of rides, stalls selling clothes, household items, souvenirs and various other wares, food vendors etc.  Lots of colour, lots of noise, but all very exciting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r646461867-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Pushkar Camel Fair", "rating": 3.0, "title": "Camel fair rink", "review": "Central location from the lake. Would need to take a cab or camel to get there! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10020421-r654513620-Pushkar_Camel_Fair-Pushkar_Ajmer_District_Rajasthan.html"}]