[{"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "360 degree view", "review": "The temple is built on the top of the mountain and provides a 360 degrees view to the city of Pushkar. It is worth a visit by walk or gandola.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r647693782-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A good workout to get there", "review": "The walk up the steep hill (20-30 minutes) via the steps required a great deal of effort and the cable car is essential for anyone who's not reasonably fit.  But the views are special, despite the temple itself being very small and not at all special.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r647128235-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Small but excellent temple", "review": "For reaching this temple trekking required so not recommended for aged people. natural location to visit so must plan for this. We have enjoyed lot here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r646723401-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views from the top", "review": "We took the cable car up to the top but you can walk the 440 steps if you are feeling up to it.  Lovely views from the top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r648067795-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Great views & some merit", "review": "Lovely little temple overlooking Pushkar..... rough track up, I managed with a knee brace on ... was expecting it to be messy after reading some reviews... but actually quite clean & even a bin there.... great views ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r648862109-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view from the top ", "review": "Quite a vigorous climb which would be dangerously hot in summer. Which is why we took the cable car in winter. Curiously you can buy a ticket from the top one way but can only buy a two way from the bottom. The temple is unremarkable for non Hindu, but the view from the top is worth the visit. Cheeky monkeys make themselves at home at the top. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r648333514-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Fantastic views and a more lighthearted temple", "review": "Rope way up to the temple is a good idea and it’s fun for 100 rupees or whatever. Views are great. Temple is tiny which is also a bonus 2 mins and you’re done without feeling like a heathen .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r650843131-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Temple on top of hill in pushkar", "review": "Savitri mata temple is located on top of a hill close to Pushkar town. Ropeway facilities are available for reaching up the hill. In addition nice walkway also is built. Even to reach the ropeway boarding point people have to walk up considerably. Hence for senior citizens it is a problem. Savitri mata temple is very nice and has long history. Excellent view of Pushkar lake and surrounding places are extra bonus for pilgrims who go up the hill. Lots of my keys are around and they are somewhat ferocious.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r651981444-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "On Ratnagiri hill", "review": "The Savitri temple is located on the Ratnagiri hill. Beautiful location to visit. Must visit place. We have took visit in morning time. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r652963466-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Breathtaking, in both ways!", "review": "Woke up at 5 to hike up the approximately 650 steps to the Savitri Temple. Breathtaking. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r638086421-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Small Temple on the Hill top", "review": "The temple is situated on a hill top which is connected by a rope way.the view of Pushkar is excellent from the Temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r652466411-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Lovely Place", "review": "We have visited first time this temple & it was really good to go by roapway. The only problem is the monkey in terms of numbers which makes you scare sometimes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r638095102-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing sunset", "review": "The temple is situated on a hill top accessible by cable car and stairs. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r640424123-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view", "review": "Savitri Temple is situated on a hilltop and it offers spectacular views of the whole city. To reach the hilltop, you can either take the stairs, which are about 1000 in number or you can take the ropeway. Best time to visit is in the evening so you can witness the sunset. Must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r638509783-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Walk or cable car access ", "review": "We walked up and down really enjoyed the  exercise even with the one aggressive young monkey. Temple not worth the trip if that is what you are going for", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r639177072-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good experience of Savitri temple", "review": "We recently visited Savitri temple at Pushkar. It is situated over a hill top. Very high indeed for elderly people. But that obstacle had been negated by very well organised cable car facility, managed by very good professionals. It is available from 8 am to 7-30 pm during Oct-Jan and from 7 am to 8-30 pm during Feb to Sept. Worth visiting place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r643481665-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Peaceful temple at hieght", "review": "Lovely temple at hieght which makes this more peaceful. Rope way is yet another advantages of this place. Finish your journey early in morning to take blessings of Devi savitri .don't click photo inside Temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r642839940-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Apart from the religious, beautiful views ", "review": "No reasons are required from religious perspective. Other than that, just the sheer view from the top is a must. Cable car is steep and safe but can be scary for some. Others may enjoy the ride too because the view from the car too is superb. All in all after the lake, this is a must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r642114064-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Family visit", "review": "Great place at Pushkar. You can take the ropeway up to the temple. Good place for family outing coupled with blessings", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r642614776-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Very good views worth a visit", "review": "Its just a little far off from the main lake you can take an auto to drop there. Temple is at height which can be trekked [you need to be a good trekker] or simply take a ropeway. It remains closed during afternoon I think 12-3 pm.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r646222933-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 1.0, "title": "OVERATED", "review": "I viewed all the wonderful reviews about this place & couldnt believe how overated it was.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r629334689-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing place for Sunrise", "review": "I went there at 6am to watch the sunrise, it's an amazing and beautiful experience everyone should do in Pushkar", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r631529363-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Temple with a view", "review": "An interesting experience.  One can either walk or take a cable car.  Once at the top, there is an excellent view of Pushkar and Pushkar Lake.  Just be prepared for the monkeys when arriving at the top!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r630993000-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "The view from top worth it!", "review": "We went the hard way to see Savitri Temple. We walked up the steep climb. The stairs have been made well except towards the end where they are too high so difficult for older people. The stairs were not particularly clean but it could be because we went up way too early to see the sunrise. The temple itself has lost the feel of an old temple with the constructions for the cable car, cafe on the side, terrace for the temple and all seems half finished. The front of the temple has been tiled unnecessarily and its a pity it has been renovated rather than restored. The view is just amazing though. Once can see the entire Pushkar town and the lake in the middle looks beautiful in the morning light. I was also happy to discover that Sharada Ma (wife of Ramkrishna Paramhansa) had visited the temple and that attracts a lot of Bengalis.  One can see many marble tiles donated by them. The temple is over all clean. Wish they would beautify it a bit. The journey down we took a cable. It was interesting but the cable car windows are stickered so visibility  is poor. A pity.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r632711773-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "great place", "review": "we really enjoyed this temple ride with ropeway because without that you can not come as it is on a high hill. it was good to see pushkar from the top but there are lot of monkeys. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r632837417-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazang view", "review": "The temple is under construction and does not deserve a visit, but the view across the city and the lake is amazing", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r633549144-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Panoramic view", "review": "It is an experience you will never f hdorget to see Pushkar from a bird's eye. Great place to enjoy view and cool breeze. Temple is also nicely maintained but place around is not clean. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r634295602-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A Temple on the top of the Hill", "review": "Savitri Temple is a must-see tourist destination in Pushkar. Besides the religious sentiments associated with the temple the place has an added attraction in the form of a cable car ride which gives a panoramic view of the Pushkar town. However one can walk up the few hundreds stairs which are not that uncomfortable. You will be greeted by a not-so-disciplined group of langurs at the gate of the temple; so one has to be careful. The view of Pushkar town from the top is beautiful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r634320883-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Amazing sunset views in Pushkar", "review": "I started visiting this hill too temple 10 years ago and I have seen it pristine without a ropeway they recently built and without trash. Barring the above the views are gorgeous at sunset. Leave at least couple hours prior to sunset and don’t carry eatables as the monkeys can go crazy and attack as well. He walk is steep about 14-45 mins depends on your fitness level and the other options is the rope way off course !", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r616834777-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Very nice viewpoint", "review": "To get here, we drove from Pushkar through the Camel Fair grounds, and parked at the bottom of the hill where the cable car starts, and took the cable car up; though you can climb up a lot of steps to get here if you want. The cost was about Rs. 90 I believe for round trip.  On the way up, the cable car stops once half way, to let others on and off at the top and bottom. Make sure you save your ticket for the return else they will NOT let you on. A tourist couple had a hard time convincing the staff at the temple that they had bought return tickets but had lost them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r638085079-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good Experience", "review": "Had a wonderful rope way experience . The whole city view was mesmerising ..... Would wish to visit agAIN ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r636944982-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Beautiful at sunrise", "review": "The view from the top is worth it if you can make it. The hike up is long and requires some amount of physical endurance. Watch out for the monkeys and the stray dogs along the way. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r621900332-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great View from the Top", "review": "A great temple at the top and a wonderful ropeway to reach it. Must visit when in Pushkar. Lots of Monkeys around.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r622069710-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "JAI HO SAVTRI MATA KI", "review": "whenever i m in pushkar i always went there ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r623572594-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Temple visit", "review": "Great view of pushkar from the hill Top Savitri Temple also monkeys kept us amused and we enjoyed climbing up also there is cable car at nominal cost, the view is incredible. Reccomend this to everyone", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r623942111-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great view for sunset ", "review": "Well worth a trip if you’re in Pushkar. Great views and a lovely sunset. The monkeys are very cheeky and make sure any food is hidden! But it is really fun watching them. We took the cable car up but the walk didn’t look too challenging. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r624672110-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good views ....", "review": "lots of steps to get to the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r624972421-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Breathtaking view", "review": "You have to take a cable car to reach the top of the hill where the temple is location. The cable car ride makes you bit nervous but the view from the top is every bit worth the trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r627100995-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "a nice hilltop temple", "review": "This temple in Pushkar is situated on the top of a hill and is connected by a ropeway. The ropeway was very good and well maintained. The staff were courteous and efficient. It was a thrilling experience going up. The temple is a very ancient one and the diety is savithri wife of Lord Brahma. We had a good darshan and the view from the top was great. Worth visiting this place while in Pushkar", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r627652638-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Beautiful view of Pushkar", "review": "Loved the way up by rope way. We get a complete view of Pushkar plus the Rann backside. Too many monkeys there..... Beware of your belongings. Savitri Mata temple is small but good. They will soon have a viewing gallery.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r591567002-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A Fantastic View of Pushkar", "review": "This temple has recently have a cable car installed with a magnificent view of the city as well as a sunrise n sunset point.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r629110711-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A challenging walk but great view!", "review": "We opted to walk rather than take the cable car which is the quickest option! The steps in places are rather steep, but are in good order but the handrail is missing in places! The temple is rather plain but still interesting to see but the view is stunning and you can get a nice cup of chai from the cafe behind the temple. Lots of people come up for the sunset which was quite good too. Interesting to visit if you have enough time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r590001813-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice temple ", "review": "There are lot of monkeys to see , beautiful view of city , u can enjoy rope way , u can click a beautiful panorama pics from high point ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r595156848-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill top temple", "review": "There is a religious significance about this temple. It's on top of the hill. You can use the steps.. Some say 600-some say 1000. I have climbed the steps but haven't counted. It was a nice experience walk g up the stairs. Wasn't an easy climb but wasn't like undoable either. If you are used to a medium fitness routine one can easily do the climb. But other wise there is a rope way also. Savitri mata is very kind and inside the temple i just felt home. For who can't climb up, there is a rope watmy too with minimum cost. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r596256061-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Devi Temple", "review": "You may either use the tram to go to the temple or use the steps. Go there before the afternoon sun to enjoy the temple. The entire trip would take up to 1 hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r599729989-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Religious place", "review": "We visited here with my whole family. It is very peaceful and calm place. You can climb here by steps (Approx 800 to 1000). There is also facilities of cable car which can be used if needed. Nice place to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r601470797-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful Temple", "review": "950 steps was daunting, but, the cable car was a blessing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r600369445-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Can’t believe this is Pushkar ", "review": "We never expected scenic beauty on top of Savitri temple. You will not believe that u are in Rajasthan as it was all green around. Also rope early was the great experience for children.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r606297613-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Excellent View", "review": "Beautiful view of Pushkar town and very close to nature. Temple is very good. It is on hill top, people are very friendly", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r611365195-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view from the top!", "review": "You can hike to the place or you can use the cable car. There are a lot of steps, so beware. But the view from the top, is amazing. Worth the visit, better to go for sunset or sunrise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r572457433-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views over Pushka", "review": "Well worth the trip to the top. We took the cable car up and walked down. Mind the monkeys. They will grab any bags that look like food. Fantastic views over Pushka. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r607960560-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "must visit place", "review": "To reach Savitri temple you need to take the ropeway cable car. Please keep 30 mins aside from this temple. It is an experience to reach to this temple.you can see a whole Pushkar from hilltop temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r573423159-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Holy place..", "review": "A old temple located at Hill top. Best way to reach there is cable car which is cheap as well. You may also option for hiking which is not very tough. Go in the morning for best vally view. Beware of monkies.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r575949863-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "great view but beware the monkeys", "review": "crazy monkeys await you when you get off the cable car or walk the steps, we saw a few people getting attacked.  but apart from that, beautiful views.  especially go for a walk along the mountain ridge.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r578405253-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Beautiful place. Would be amazing view in monsoon.", "review": "It was very hot when we visited this place, yet it offered a spectacular view. This place would be a paradise in monsoon. Be ware of monkeys though. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r581223931-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth climbing the stairway to temple! ", "review": "The stairs to the temple seem to never end but I’d recommend it anyway! Go early in the morning to avoid the crowd and the harsh sun and do take the cable car for the way back down! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r578730545-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "The Savitri Devi Temple", "review": "Savitri temple is situated on the top of Aravali Hill. It gives the best aerial view of holy town of Pushkar. The temple is not open full day, there are certain time of opening, so better confirm the time before going. There are two option to reach to the temple one is by climbing the stairs and there is a rope way as well. The temple is bit away from lake and other attractions, so you better take a rickshaw or you can drive your own vehicle.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r583970804-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "okay", "review": "It is good place to visit on a rainy day but not advisable to visit in summers. It is on the top of aravalli hills.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r587938662-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great Experience", "review": "Reaching to the temple through Stairs is good if you want to burn the calories and have plenty of time to spend in Pushkar. People with Short trips and typically Weekend trips. MUST try Ropeway. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r588276142-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth one visit.", "review": "If you don't have any spiritual commitment to that place, it's a single visit worth. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r586465631-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit when you are at Pushkar", "review": "You must visit this place when you are At Pushkar. 360 degree view from from the Rope Car while you go up will definitely delight you.  If you do not have your own car or conveyance it is better to take an Auto to save time.  Not to wait for any public transport.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r566635200-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Awesome climb up Pushkar Hill", "review": "Don’t miss out on walking up this hill. It’s a fairly long hike up but well worth it. There is a sweet temple (of goddess Savitri) with amazing views of Pushkar at the top. We did the hike early morning when it was nice and cool. Never took the ropeway. No need. The hike is extremely do-able especially if you pace yourself!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r565755099-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Superb Place", "review": "I must say that this is the best place of pushkar which lot of people don't know even. You have a option to go by stairs which are too many in nunbers or else you can take a roapway which is much easier as it is on a quite high height. love to see the entire pushkar from top. must come place", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r567649662-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Get a workout and see sunrise from the mountain top", "review": "The draw for this temple is the view, not the temple itself, which is small, plain, and unfinished. The 365 degree territorial view is wonderful.  There is a cable car to the top, but it won't be open for sunrise.  Plan on a half hour hike from bottom to top.  Lots of monkeys at the top that may mug you if you take food along -- not recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r567996042-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Top of the pushkar", "review": "its a very good place to vist with the help of roapway and you can see the entire pushkar from top. Only one problem is their that they have too many monkeys which troubles you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r568204977-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Tough walk up but worth it", "review": "We didn’t take the cable car up and instead walked up instead, was a little steep but definitely worth the views at the top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r567999819-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Definitely worth a visit", "review": "Breath taking views! Lots of monkeys and a great couple of hours out! We took the cable car up and walked down the stairs, make sure you have plenty of water if your choosing the stairs route!  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r569026101-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 2.0, "title": "Dull temple good view of Pushkar", "review": "This rope car ride is hampered by the dirty Windows so seeing out to the view is hindered. This is  ride to nowhere as once at the top the temple is awful a big money box ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r560943247-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view at sunrise.", "review": "Get up early and climb up the steps to this temple on the top of a hill on the adge of the city to greet the sunrise ( and the monkeys)  worth it.  I was a bit disappointed that there was too much litter there but this was one of my overall disappointments on this trip in Rajasthan. There is a cable car that will save you the trouble of the climb but not as rewarding!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r571143303-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Best view and nice temple ", "review": "Go for sunset. It's beautiful, with the monkeys and everything. We walked up - takes around half an hour from the foot and one hour from Pushkar Lake.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r562228939-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Worth it", "review": "We woke up early to try to see sunrise there, didn't work...we left around 7...walked until the temple, it's a bit hard but totally possible! Worth it! Take lots of water with you. Cable car starts at 08:00am so we were able to take it to come back. INR71.00 per person. I recommend it a lot! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r569836939-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Very good temple", "review": "SaciThe Savitri temple in Pushkar is located on the Ratnagiri hill which is a popular pilgrimage site for the Hindus. The temple is dedicated to Goddess Savitri. It is a very strenuous work to climb on the hilltop but it is believed that the harder you work the more ‘Tapas’ are gained. In this temple you will find the idols of", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r562455079-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful temple and perfect spot for the sunset", "review": "The temple is very peaceful and the ridge behind it is a great place to sit and watch the sun disappear into the haze.  The walk up is great exercise, and walking down at night is well lit and the steps are in good condition.  I did not ride the cable car, so cannot comment on it.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r562645857-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Little climb or cable car experience, a lot of monkeys, good place for photos", "review": "Good view , possibility to ride on a cable car or you can climb - it’s easy not so high, about 30 min walk. Monkeys are waiting for food upstairs, take some bananas and camera", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r562843794-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Recommended to Visit.. Nice view of Pushkar Lake", "review": "On the hills. Scenic, beautiful and serene. Must visit if visiting Pushkar. Rajasthan government constructed a rope way to travel up making it easy to reach to temple and  It takes 5 minutes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r563109856-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Sunset fun.", "review": "Do visit during sunset and spend some time with friends there. cable car is a good option if you dont wish for a sweaty climb. it costs around  Rs.115  two way", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r565014387-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Total view of Pushkar from top.", "review": "Nice place . The topmost point of pushkar. Rope way charges Rs.104 to reach the top. But for photography lovers walk all the way up and enjoy the view. Complete pushkar is viewable.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r563528521-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Good View of the City", "review": "take the Ropeway-car or climb the stair while you enjoy the view of the city and the hills guarding the city..", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r565023471-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "For the view", "review": "The temple itself on this hill summit is without the slightest interest but the view over Pushkar and the neighbouring hills and countryside is superb. There is a well paved way leading up or a cable car for an easy access in 10 minutes. You can walk there from town without problem.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r565594975-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great...", "review": "Great place to visit. We went there by cable car. Temple is just beautiful. But we enjoyed the view of city and sunset from the top of hill.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557009799-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Offers panoramic view of the town", "review": "It offers sweeping views of Pushkar town and lake. Go for an early morning or late evening hike for sunrise and sunset.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557259139-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "temple ok ok but view amazing", "review": "temple not maintained but view from the savirti temple is amazing and cable are essayist way to going there. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557460062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Lovely sunset!", "review": "One of the highest points in Pushkar. We went up the cable car and came down by the steps. A fun downhill stroll. The sunset is epic.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557263018-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautifiul view", "review": "This can be reached by either trekking up the hill or by taking a cable car. The view from the temple is breathtaking and once can see the entire pushkar from here.This place is a must visit. The temple is very peaceful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557478363-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "jai mata ji", "review": "good temple on a  mountain. added attraction is to reach there by rope way.temple surounded by arravali hills full view of ajmer and pushker", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r558204819-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Temple on the top of hil", "review": "So this temple is on a great height as to go there you have to  take around 1000 steps or you have the other option which is rope way that cost you around 103 rs for both the sides and yes you can see  the amazing view of the city pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r557852339-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Ascension to the spiritual", "review": "One of the sacred places for Hindus, very spiritual, and also a good trek of 40 min. We have been there at the sunrise. Level difference 200 m, distance 1,5 km from base to top, 650 steps, medium difficulty. A beautiful panorama of Pushkar from top. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r558228942-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Just sit and stare a while", "review": "We went at sunset our last night in Pushmar and it was lovely. We thought we'd be on time with a 45 minutes to sunset but with the lines for tickets and cable car plus the ride up we just missed it at the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r560381700-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful view", "review": "A must visit place if you come to Pushkar. They have just installed a Rope way last year. Easy approach and excellent view of pushkar and Aravali hills. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r560352350-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "mountain top temple", "review": "beautiful temple and the best way to going via cable car price is very cheap for the cable car and hill view is superb.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r552884102-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Spectacular view", "review": "Decided not to do the cable car and walked the 700 plus steps. The views were spectacular and the meeting and encounters of the local people and worshipers was fantastic. Really well worth the exercise and to spend time marvelling at everything on the way up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r553055133-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Beauty in need of preservation ", "review": "The view is really really beautiful. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r553384697-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "climb or take ropeway but must do", "review": "pushkar needs to be seen from above as its a special place both for spirituality seeking pilgrims and comfort seeking escapists. try feeding langoors here or watch the sunset behind the temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r553765208-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Temple with cable car", "review": "Savitri temple is located on the top of a steep hill near the main town of Pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r553724859-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Cable car ride to the temple is pretty awesome", "review": "The temple is up a tall mountain and you can take a cable car or walk up the stairs, We took the easy option of Cable car. The view from the cable car is awesome. The temple is beautiful and ancient. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r554278431-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Walk up and ride down :)", "review": "We arrived at the bottom around 5:30pm with a large queue for the lift, so decided to walk. 2/5 of us were lucky enough to catch the sunset. 80rs for up and down, I think we paid 70rs for just one way. Best views of pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r554324536-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Very good Lookout over Pushkar Lake and surroundings", "review": "We traveled there with the new cable car to see the sunset. From the city with Tuk-Tuk you need about 15 minutes + cable car or footpath to the top. The view is very good and the mood is really relaxing. Just pay attantion to the Apes, they look cute but can be very aggressive.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r555114846-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Awesome views", "review": "We drove to the place. A rather long wait in line but the cable ride is fun and the view is awesome. For the religious there is the temple too. Watch out for the monkeys! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r555407093-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "relax", "review": "visit this place see the simple life very nice take half day off enjoy this lovely area off the small city in to peace of mind", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r556800692-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "View from the temple", "review": "Enjoy a breath taking view of pushkar town and the sarovar from this temple. The Savitri temple is dedicated to godess Savitri , first wife of lord Brahma  and is believed to be staying here on the mountain showing her remorse after her husband married godess Gayatri.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r546386409-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Sunset over the desert", "review": "The temple itself is not spectacular but the view from here is.  There is a cable car to the top of the hill on which the temple is built or you you can walk up the (vry long) flight of steps. We arrived in time to watch the sunset over the Thar desert.  Very romantic!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r547269531-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing view from the top", "review": "Take the Cable Car to reach the top . Please find out the temple timings before you start for the ride. Spend a good time to view the entire Pushkar City from the top. You can safely have the Soda Shikanji on yoru way back . Very unfortunate to see small kids begging for alms , money and even food ( they do it out of habit rather than need )  . Do not fall in to the trap . ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r547706101-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Spiritual Journey", "review": "The visit happened by chance, we were staying at Hotel Bhanwar Singh Palace Pushkar. Had visited Pushkar Fair the evening before and someone suggested to visit Savitri Godess Temple. It was about 15 mins drive from hotel. We used GPS, it works perfectly fine in Pushkar, unline Mideast where I stay. There is ample parking space, no parking charges here. Best part was now visitors have to no longer make the climb of 2 hours to reach the temple. Recently started ropeway/cable car is a great option. Charges around 130 rs per person (approx). At   one time which is every 15 mins, they can take 18 people with 3 cable cars, so on a usual day you have to wait around 30 mins. Which is worth the wait. Bit crowded, but then you are visiting a holy place in India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r547305532-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Panormic View", "review": "The ropeway has made it very convenient to have a panormic view of the entire town of Pushkar. The temple has great historic significance and is very symbolic in Hinduism. It has special significance for Hindu married women and so a lot of women from all over India come and visit this temple not once but many number of times.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r548082209-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great views of Pushkar", "review": "We took the cable car uphill - the car itself was closed on all sides and therefore not as much fun. The views from the top were pretty good - overlooking the entire Pushkar town. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r549139109-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Pushkar Visit ", "review": "Beautiful place. a must visit in pushkar. one can use a roap way to enjoy scenic beauty. go n enjoy the mountain view", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r549410659-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice walk to holy temple of Savitri", "review": "You can see a wonderful view of Pushkar lake and surrounding countryside from the hill top of the tample. We walk up to the top quite early in the morning ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r549864921-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Must visit for the Complete Pushkar View", "review": "The temple of Goddess Savitri is situated at the top of a hill. You can get a complete view of complete Pushkar from the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r550806229-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "hill top temple", "review": "hill top temple can go via cable car that is around 100 inr for both way higly recommended this place", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r550549490-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A beautiful Sunset Point", "review": "A peaceful and beautiful place to spend your evening, watching sun goes down.Its a must if you are in Pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r540290435-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunrise View", "review": "If you want to see an amazing view of Sunrise, then this is the place for you in Pushkar.  Being a photographer I can say that I got some amazing shots here. Reach around 45 mins before sunrise here, as the place requires climbing some steps and then trekking. But it is really worth it. You get to see the whole pushkar city from this place and the distance if the weather is clear, you can see ajmer lake as well. A must-visit place in the morning in Pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r540025853-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset view and birds eye view of Pushkar", "review": "The sunset view from the top of the temple along with the bird's eye view of Pushkar makes this a must visit! It takes about 40-45 minutes to hike up the temple(about 1000-1200 steps) and you can relax on the top of the temple with tea and snacks!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r541027873-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Small temple on hill top", "review": "This is one of the much hyped tourist attraction when you are in Ajmer. However, this is just a small temple for Savitri mata. Located at 2km from the Brahma temple of Pushkar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r541113035-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Good climb and great views", "review": "If you are feeling up to climbing 925 steps- some of them big ones - this is definitely worth doing although the hideous lift station takes away the magic when you arrive at the top. That is unless you have taken that way up!  We went up at 6am to watch the sunrise over Pushka. There were just a few pilgrims up there so very peaceful. When back down we went to the ghats which were magical. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r541317655-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing view point, make sure you go for sunrise!", "review": "This is by far the best view from above in Pushkar. I would highly recommend the sunrise trek and watch the colours transform infront of your eyes. It's quite a walk and some of the steps are huge but it's worth it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r541283130-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Must Visit", "review": "To reach Savitri temple you need to take the cable car. Please keep 45 mins aside for this temple. It is an experience to reach to this temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r543261814-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Short hike with a great view", "review": "It's a short 45 minute / 700 ft. hike from base to top. If you're walking all the way from  the city add another 15-20 mins. It'sy easy and can be done by anyone. For the more lazy people, there's a cable car but expect long queues. The views are scenic and offer a great aerial view of Pushkar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r543347577-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Morning Energizer", "review": "Early morning wake up in Pushkar with a walk in the dark to ascend the over 900 steps to reach the Savitri temple. Morning rise with a mug of morning chai in hand. great way to start your day in Pushkar. Go for it!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r544824495-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "500 step super workout for a heavenly view", "review": "Love pushkar for this amazing hike, 3 km from the city around 500 steps take you to the most breathtaking view & a temple. Great way to start your day !", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r546204372-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Perfect sunrise destination", "review": "We rose at 5am to hike to Savitri Mata for sunrise (around 6:27am in October), it took us about 50 minutes from the south side of Pushkar Lake.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r532381363-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice View Point of Puskar", "review": " We have visitied here by Cable Car . This is on a hill top . The View of Puskar is Spectacular from here .  One can take photos of Puskar and Araballi Hills from here .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r533977890-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Need modernisation of place", "review": "This place has great potential to be a tourist spot, but need upgradation of facilities available. more cable car. better roofs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r534770578-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Amaing view of pshkar from hill top", "review": "Too steep rope way to hill top, nice experience to have. also you will get some amazing view from top try to go wither in early morning or evening. Temple closed in after noon.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r534506249-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing Ropeway", "review": "The new rope way cable car is n amazing experience. The cable car is stopped mid way to allow the yatris the thrill of height and George on the scenic beauty of the Pushkar", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r535428057-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "rubbish temple, nice view", "review": "The temple is not even  worth a visit unless you are going to worship but the view is nice and it gets a cool breeze up there. The cable car is ok. don't forget to scream when it suddenly stops half way and freak out the rest of your gondola. lol.  Best thing is westerners don't have to pay any more than Indians for once so go for this reason and enjoy. The summit is a mess of a building site.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r534856068-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good Ambience", "review": "From top of the Sawatri Temple it gives a good scenic view and with Ropeway the visit is comfortable to & fro.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r535565917-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Breathtaking views", "review": "This is great activity to do whilst in Pushkar if you are looking for some morning exercise. It takes about an hour to walk from Lake Pushkar up to the top of the hill where the temple is situated. However, the temple itself is not the main attraction, rather it is the panoramic view of Pushkar and the surrounding area below. You will want to avoid the heat of the day so the best time to set off is about an hour before dawn and then you will see the sunset from the top. The walk requires a moderate level of fitness and as you near the top the steps become steeper. The view from the top makes it all worthwhile, it is stunning!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r537760075-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Perfect Sunrise", "review": "This is a beautiful spot to watch the sunrise. It's an easy climb up slightly crumbly steps to the top and the vistas are truly spectacular. When you come back down after watching the sunrise, take a walk through town. Pushkar is particularly beautiful just after dawn. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r536001176-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Get together of family", "review": "This temple is located in a hill near Puskar lake. You can climb the hill by steps or even use the cable car on purchase of tickets. The beautification work of the temple was in progress once completed it will be very convenient to cost. The view from the top of the puskar city and lake is breathing. You need to take care of the Langurs (black face Monkey with long tale) they are not aggressive but smart. You can feed them gram on sale at a small tea shop. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r515391459-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Excellent temple at such Location and hight", "review": "Without visiting savitri temple your trip at puskar will incomplete.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r515696457-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Great view and climbing exercise, Temple is mediocre.", "review": "The view is amazing from the top of this hill, but sadly the temple is just mediocre when it comes to amazing temples of India. The exercise you get from climbing up is great though! If you are in Pushkar it is definitely something cool to do! If you don't choose to climb and take the cable car, then the views are the only thing worth going to the top for!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r538625442-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Picnic to ajmer pushkar ", "review": " A worthwhile visit to savitri mata temple and the rope way has made it very convenient for the visitors", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r515890197-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good view", "review": "The temple was unfortunately closed when we went. But the view of the city was spectacular. We took the cable car to reach the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r516931093-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "must visit temple in Pushkar", "review": "There are lots of temples in Pushkar and this temple is situated on the top of a mountain. There is a rope-way system to go up and come down, the cost being Rs.92/head for 2-way journey. We climbed up by rope-way and preferred coming down by steps. The view pf the Pushkar town including the lake and all its 52 ghats, from the top is awesome. Try to see the sunset from the mountain.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r517866754-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Savitri Temple", "review": "Fantastic views of beautiful Pushka. An exciting little cable car ride to the top, then an invigorating walk back down!! A must for tourists in the adorable little town of Pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r522291730-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "The view!", "review": "The Temple is situated at a height such that you have to climb 500 odd stairs to reach the temple. We started early morning to see the sunrise and reached the temple in 25 min. But due to the clouds sun was covered, but the view was amazing!! You could see the Pushkar lake and all the greenery around you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r522284444-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Good view. Temple not impressive. ", "review": "We got the cable car up. The steps are endless and in the heat of the afternoon these did not look fun! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r528046190-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Very good views", "review": "With a cable car to the temple, it has become a tourist attraction. The charges for cable car are Rs105/- for both ways", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r530680018-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Savitri Temple", "review": "Another very important temple which must be visited while in Pushkar. The best way to get here is of course by Cable Ropeway, but the determined and the faithful also walk up the steps which look easy but get steeper as you near the top. The view from the top is breathtaking. Nothing much to do there except to offer your prayers and enjoy the view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r522843967-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sweaty but worth the climb", "review": "We took the stairs not the cable car..amazing view of Pushkar and pushkar lake! The temple was kind of blah.. go for the view!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r500844641-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "very good view", "review": "try rope way   to reach for the temple ,  the view surrounding the mountain is very beautiful. temple is very old .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r501909414-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Visit to Savitri Temple", "review": "Savitri Temple is located on the Hill Bang Opposite to Bramha Temple. You can reach there through Stairs or Ropeway. It takes almost 40 minutes to clim through stairs and only 6 minutes through ropeway. However, those who are scared of Heights get uncomfortable in ropeway. My wife being one amongst such person. So judge your partner in the ropeways before you get into :-)", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r501156686-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "the view is okay.", "review": "Decided to visit the temple on top of the hill, walked from the hotel and that took about half an hour so I suggest getting a tuk tuk to the foot of the hill.   Caught the cable car up to the top and the views are great, overlooking pushkar town and lakes, so it is worth it for the views.   The temple isnt too much and you cant take photos inside.   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r502333230-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Best views of Pushkar and surrounding areas", "review": "Ropeway to Savitri Temple is a good attraction. Plan your trip in advance to ensure you don't reach their when temple is closed I believe 12 pm to 1 pm. We reached there at wrong time and waited for an hour at the top for the temple to open. A lot of renovations were going on their in Jun'17. Hopefully people will find better facilities in coming months. The view of Pushkar lake from top is mesmerising.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r502365663-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "\"Amazing view of Pushkar from Savitri Temple:", "review": "Enjoy \"Udan Khatola\" to reach at Savitri temple. Its a very nice temple and here from i see the beautiful  view of the city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r506776648-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Wonderful view", "review": "We walk from Pukar tp this temple. this temple from on the mountain  and one kilometer far from Pushar town and you can see wonderful view.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r504440813-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Amazing view", "review": "The temple is not much to look at just sort of a concrete shell but the view of pushkar is spectacular and the I couldn't get enough of the many monkeys who live up there. They are by no means tame but they aren't scared of people and will leave you alone if you leave them alone. They were fantastic to watch especially with their babies and it was really special to watch the sun go down. We walked to the top which wasn't easy but wasn't what I would call difficult, just a couple of breaks needed and it made the view at the top all the worthwhile. There is always the cable car though if walking not your thing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r512114665-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth the view!", "review": "We took the rope car to experience the same ; @ 100 rupees per person (up and won)onward journey was good as the queue were well organized however once on top and returning back in the cable car was a bad experience non existent queues, less number staff to help and people breaking the line had caused a ruckus however thanks to a few travelers there a queue was organized and we were able to catch the rope car to come back.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r513617254-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Best place to have the bird-eye view", "review": "This is a must go place for the tourists. It is located away from the hustling and bustlings of the city. I realized that the best time to track there is during the morning. I am sure, Photographers would love to make photos from the top. The well built steps are close to 200 and in good conditions. There is a facility of cable-car also. You need to buy the tickets from the down. You can not buy it from the top. There is a water supply of drinking water so you can take rest in the waiting area until the gates are opened post lunch.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r513260278-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful", "review": "Got the lift up the beautiful mountain to the temple. Super cheap. Amazing view of pushkar. We need a scooter to get there tho", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r486034487-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Ropeway", "review": "Beautiful view from rope-way and they charge 92 rupees and top side lord Brahma wife temple. and many money around the temple side.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r487880015-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "rope way", "review": "we reached at temple in evening time and that was best time. camp is located on heights so we can explore whole pushkar city. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r488346805-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Enjoy rope way and view of aravali valley", "review": " Best way to go Savitri temple via rope way A rope-way is an easy and reasonable way to travel to hilly location. Keeping this in mind, a new rope-way has been started in Pushkar. The rope-way has been constructed at Savitri Mata Temple. With the help of this rope-way, now you will be able to reach the 720 meters high temple in just 8 minutes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r490343860-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "The SAVITRI temple ", "review": "Temple situated on a Hill of Arawali range,  You can go by Roapway or by narrow foot path, A must visit after worship of Lord Bramha. Lot of tempo founded near Lord Brahma temple for 5 kms. At the top of temple amazing view of pushkar city, Brahm sarovar (lake) seen.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r491407368-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Lovely view from Hilltop of savitri temple", "review": "At the top from the savitri temple great view rope way is the best option for going to savitri mata temple", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r492148267-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Sweet hike, great views.", "review": "Loved this short little hike.  Took it the first day in Pushkar and it was perfect for getting a nice overview .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r493099684-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "nice view and sun set", "review": "surrounding mountains were amazing!! Definitely worth it. Don't opt for the lift if you're physically able to walk. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r495756018-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "For getting views of the city and lake", "review": "To get to the Savitri temple, walk around the temple of Brahma on the left and then along the dusty road about a kilometer or so. Then you will face a choice. On the right you will see the funicular, on the left - hiking uphill road to the temple. Now I would have done the same as I did then - I would go up to the temple by cable car, and went down on foot. The ascent is not difficult, but do not forget about the heat, which after 10 a.m. is already floating above the town and envelops all. The temple itself is unremarkable, but  the  views of the city and lake from the top of the hill with temple redeem everything. For getting them you need to come here and not listen to the confused  legends about the relationship between different goddesses and Brahma. Чтобы сидеть в плетеных креслах, наблюдайте за незаменимыми обезьянами, слушайте музыку - и помните Пушкарь, как видно из этого.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r492691612-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Excellent View", "review": "The Savitri temple is on hill accesible by foot and through ropeway. The ropeway is a good option for Rs 92 per person for both ways. The ropeway is new and is very well maintained. In the middle it gets stopped for you to enjoy the topography. It starts at 9 am and last descent is at 7.30 pm. From 12 to 2 pm it is closed as the temple is also closed. Worth visiting the temple and to have a birds eye view of the Pushkar and sunset in the evening.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r495753336-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "savitri temple is good for sunset view and sundown view and at the top whole pushkar view", "review": "savitri temple is good for sunset view and sundown view and at the top whole pushkar view good to going to morning and and evening time and rope way is best to goung there they charge only a 92 rupees per person. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r474147344-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Huge view at rope way are good option.", "review": "We go savitri temple via rope way that charge a 92 rupees of both way and this temple is devoted to Lord brahma wife temple and great view of pushkar you can see top of the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r477912717-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Temple of Devi Savitri", "review": "Savitri Temple is very renowned Temple for Hindus as well as foreign tourist. Evening time is an ideal time to visit this site and perfect point to enjoy little hiking. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r477617330-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "excellent view from the height of the savitri temple", "review": "excellent view from the height of the savitri temple but good option if you want take stair so rope way is the best option to go savitri temple and evening time sunset is so awesome .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r474645990-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice Temple in pushkar", "review": "This Temple is dedicated to desolated wife of Lord Brahma, Savitri. And this is located on the top of Ratnagiri Hill. Its walk able distance from Lord Bramha Temple. You can take rope way or steps but better option is rope way to visit this temple. And From temple you will get nice view of the Pushkar city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r478534077-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "I love this pushkar temple because of huge view of pushkar.", "review": "I love this pushkar temple because of huge view of pushkar mind feel very relaxed at the top of savitri maa temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r482584755-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Best place to see a whole pushkar view from the top of temple.", "review": "Best place to see a whole pushkar view from the top of temple. i like the view a lot and rope way ios easy way to going savitri temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r482010320-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A Must Visit Holy Place", "review": "We were told that earlier when there was no rope-way to reach this shrine,very few people used to visit this Hindu temple......What a shame!!!! This place is worth a visit with or without the rope way,which is more of a tourist attraction.....", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r481876348-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great views", "review": "You can either hike up to the temple or take the easier way out and take a gondola. The views are great from the temple. The best part was that there were no pandits there to nag you to do some puja or the other. Positive vibe", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r482820631-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Glorious view", "review": "We wanted to see the sunset so took the cable car up as the steps down in the dark didn't look too safe. Great views on the way up and after scrambling about a bit on the top settled down to watch the sun go down. On one side of the hill are fields and trees and on the other semi desert. Very pleasant. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r469401959-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good view to pushkar", "review": "Good place to see the Pushkar from above. The monkeys there were a bit aggressive to people haha. The temple is ok.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r483545631-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Amazing sunset view", "review": "Savitri temple is dedicated to the goddess Savitri who is one of the wives of lord Brahma, the Hindu god of creation who has a temple dedicated to him near pushkar town. The temple is at a hilltop which can be reached via cable care which would cost around 90 Rs. There is also a stairway for those who prefer to climb up all the way. The hilltop is an excellent sunset view point where we can also enjoy the scenic beauty of the whole pushkar town", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r469342359-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful Vista", "review": "We went here 3 weeks ago and it was the high light of our tour in Pushkar. The cable car is worth taking at only 80rps return. The view from the temple is breath taking. Plenty of black face monkeys too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r469773706-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Amazing views! ", "review": "If in Pushkar you should definitely give this a try! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r470286858-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Amazing view of the surroundings", "review": "A pretty hard climb up the hill under the burning sun, but It's easily doable in 30-40 minutes. Really worth it, but of course you can also take the cable car for 92 rp (92 rp for both ways or just one, doesn't matter). The temple at the top is not that interesting, but the incredible view of the surroundings is really worth it. Best at sunrise or sunset of course!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r471773815-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Ropeway is the best way to going savitri mata temple ", "review": "When I go that time I don't know savitri temple devi is lord Brahma temple and the temple priest is very carding to all devotee and you can see all pushkar view from the top of savitri mata temple's my suggestion to tourist best way is the ropeway if going there ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r471899336-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Best sunset view in Rajasthan!", "review": "This temple is probably where I got to view most amazing Sunset with everything you need. The city view surrounding lake, might and picturesque Aravali mountain range, a bunch of grey langar monkeys, the rope car ride which they ll pause high for the view. Must visit in Pushkar. Head to this place by 4.30 pm and till 6.30 eve is best time to be here. You can climb the stairs as well. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r473072755-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "ropeway is the key attraction", "review": "less than half a kilometer from the Brahma temple, there is a ropeway facility to access this temple. The ropeway stops mid way for 30 seconds both ways to take in the view from the top. One can get a panoramic view, riding the cable car. The temple is closed between 12 pm and 2 pm and hence it is important to get the timing right. A lot of monkeys abound the place with people feeding them", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r473381475-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth the hike! Go for the views, not the temple. ", "review": "Bit of a struggle climbing the stairs in 35+ degree heat and after 8 weeks of eating bulk carbs with limited exercise but I made it. Took about 25 minutes with a few mini breaks in between. The temple isn't much to look at but the views of Pushkar and surrounding mountains were amazing!! Definitely worth it. Don't opt for the lift if you're physically able to walk. The stairs are very doable and you will save some rupees. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r473159152-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Nice view poor Temple ", "review": "Try to Come in the sunrise. The cable car opens at 7:30 so you will have to climb the stairs. Its a long way up so take at least half an hour for climbing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r473300139-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Nice view", "review": "A quick ride up the ropeway to have an amazing view of Pushkar Lake and the surrounding hills and landscape. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r459005819-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Circle round the back of the temple for a nice view", "review": "Go round the back of the temple and if you are up for it hike a bit slightly beyond the rocks for a nice spot to watch the sunset against the mountains in peace.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r460255755-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Nice plCe", "review": "Good views. Worth a visit. Take a pair of socks if you don't want dirty feet.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r461171887-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "If not just for the view ", "review": "Savitri Temple is well worth the time to visit built 1687 and perched a top of Ratnagiri Hill (some would say rather steep) and dedicated Lord Brahma's wife Savitri.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r460870105-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "A temple on a hill top", "review": "The Savitri temple on the top of the hill can either be reached walking up the steep hillside....partly covered by steps and some places just a path. We took the Cable car, which apparently had started in May of 2016. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r461895474-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Perfect Sunset Temple Experience", "review": "We very much enjoyed sunset at the Savitri Temple.  We took the gondola up, did a quick visit/pooja at the small temple, then enjoyed exploring the hilltop for views of the surrounding valleys and Pushkar lake at sunset.  It was a delightful, peaceful, experience.  We walked back down the approx 700 steps and made our way back to Pushkar Lake on foot (a bit confusing to find in the dark) but a very pleasant evening!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r462080069-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Views.", "review": "Don't even think about getting the cable car unless it's absolutely necessary. The 20-30 minute walk is challenging but rewarding. The top provides a complete view of Pushkar in all its beauty. We went to the temple for sunset which I advise. Make sure you leave enough time to descend in the light though! The path isn't entirely lit and can be unstable.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r464653398-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Panoramic view of pushkar", "review": "Just 1+ km uphill walk from Brahma temple will bring you to Savitri temple which is a small yet famous temple among locals. One can walk up and down or take the gondola (Rs.92/- both ways/pp). Amount is same for one way too. Also, one person is free for every 3 persons. It not only gives you a very nice view of the holy pushkar but also the 360 degree view of the Aravalis (camel safari area, mountains, villages, highway roads, railway station (pushkar) etc. Go before sunrise (else its too hot by 9am).", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r463121800-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great views !!!", "review": "Well worth the visit for the views but nothing special for the temple it's self. It's a nice hike up about 20mins and you can take the cable cart down. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r468447764-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Beautiful view - excellent rope way !", "review": "The temple is situated on a hillock over looking the Pushkar town ship. The temple by itself is small and is still being beautified. The way to the top is through a rope way. The starting point has to be reached by an auto or own vehicle. They have a a beautiful garden at the base with a few shops selling curios and eatables. The climb up the hill in the rope way is very good as the inclination in the final stages reaches a gradient of nearly 75 degrees. The view from the cable car as also from the temple s excellent. Photography of the deity is prohibited . The idol is beautiful and needs to be shown to more people so that more tourists and devotees visit it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r449444830-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view of Pushkar and lovely sunset", "review": "Visit this place if you have enough time to enjoy bird's eye view of Pushkar. Be on the hill a little before sunset which would be an ideal time It takes about 2-3 hours in whole. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r468513295-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Only the view", "review": "If you allready see the city from an high place, so no need to go, it's only few square meter temple that you caan even not see what's inside.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r449811451-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Good view ", "review": "This temple is although clean  but to reach at the top you need to go by stairs which are around 700 steps. If you can't walk then a rope way is there but after reaching the top it is only the views of the city which is really good to see. You can see few monkeys also at the top. Overall it was a trip not so religious but a viewing destination.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r450573860-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Incredible views of Pushkar", "review": "Great morning workout to the top of the mountain to the temple. Chai tea at the top is delicious and a welcome reward for the climb. The temple is quite basic unlike other Hindu temples  nonetheless, it is interesting and the views make up for it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r452103927-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Get Blessings from Ma Savitri", "review": "Must visit place when u visit Pushkar. Cable ride is amazing and high safety is maintained. Most of the people visit to pushkar dont know about savitri ma temple. Local administration should inform properly to tourists that Savitri temple is there. Amazing views you can see of pushkar when u take the cable ride.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r453718215-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A must do!", "review": "Walked up here on New Years Day 2017 to see the sunrise. Beautiful! The temple itself is small and simple. The masala chai at the top was one of the best I had in India!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r453130865-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Best place to see setting sun over pushkar", "review": "Generally people tend to skip it but its not something  to be missed if visiting pushkar. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r453997046-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Awesome View!", "review": "The climb is a short one. Very Scenic landscape. Perfect to end the day. Caught up with a whole lot of langurs on the top. Worth a visit for sure!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r455140205-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Awesome cable car experience.", "review": "While in pushkar do not miss the cable car ride to the savitri mandir. It costs only 80 rs per person and the experience is awesome. You get an awesome aerial view of pushkar town and the desert beneath. The cable car boarding point is at a walking distance from Pushkar town or the mela ground.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r456316182-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Good view", "review": "The view from here is nice but the temple itself does not offer much to see. The cable cart ride up is very cheap (they don't charge extra for foreigners so it was under 100 rupees but can't remember the amount exactly) and a nice experience so I recommend taking that instead of climbing up. However, if you have had a chance to see the views from somewhere else there is no point in going here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r457506336-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "good t reach by ropeway trolly", "review": "many thanks to local administrations for starting rope way, people like us can go up to temple easily. its very beautiful temple on mountain and birth taking view of pushkar and soundings.   ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r440040196-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "GREAT VIEW !!", "review": "Visit this temple with a steep climb to the top.The view is surreal and one can see the whole pushkar town and beyond !!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r441044502-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Panaromic views of Pushkar", "review": "The Savitri temple is situated on a hill top and very easily and conveniently connected with cable car. The return trip costs Rs 92. You can walk up to the temple as there are proper steps. The top offers beautiful views of the Pushkar city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r441689691-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savithri temple", "review": "I feel this is a must see place for anyone who believes in Hinduism. Great place and very attractive on the hill top. Cable car is also very convenient to onto the top of the hill. Loved the scenes also. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r441328969-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great Experience of Rope Way to Temple", "review": "Temple is situated at the peak of hill and recently government develop a rope way, but stairs option are also available. 80 Rs (+ Service tax) per person is fare for travel via rope to temple. It is great experience of rope way second time. They stop the trolley for 30 second at the peak point for visiting the view of Pushkar. It is really very great journey to me but also I am scared when trolley was stop in mid-way. I personally recommend to try rope way for temple visitors instead of stairs. Savtri temple view cover whole Pushkar. But be-aware there is also monkeys and catches eatable things from hands.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r442534589-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth the climb!", "review": "This temple dedicated to Savitri, the first wife of Lord Brahma. So it is close to the more famous Brahma temple.  A long series of steps lead to the temple as it is situated on a hillock.  Alternately, you can use the ropeway. From the temple, you can catch a nice view of the adjacent lake and temples. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r443984703-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "STUNNING VIEW", "review": "It's a long walk up the hill ... but well worth the effort. The view is stunning looking over the holy lake city of Pushkar. The temple's inner sanctum is a quiet refuge for prayer and meditation.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r444930108-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset can't be better ", "review": "Its just a 25 mins climb from pushkar and offers a sunset view like no other . Cable car is available for those who don't want to walk .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r446950588-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "must visit place - lovely view", "review": "It's a long walk to the hill, use rope way instead. You can experience awesome Puskar view from this temple. A must visit place and also this is in walk-able distance from bus stand.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r447718368-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit in Pushkar", "review": "With the ropeway, visiting Savitri temple on the hilltop is a breeze. Very ancient and pious temple. Great atmosphere and superb view of entire Pushkar town.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r447850098-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Arial view of Pushkar", "review": "You can reach Savitri Temple by walking or through a  rope-way. The temple is simple but the view from the hotel is very nice. You can see the Pushkar Lake and also the city from here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r437301254-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A Pushkar must-see", "review": "Perched atop a hill overlooking Pushkar Lake and the surrounding area, Savitri Temple should not be missed. The temple itself isn't particularly interesting or photogenic, but the views are with the trip. The 30-minute hike is a moderate incline until the end when it gets pretty steep. Benches along the way provide plenty opportunity to stop and enjoy the view. There's a cable car for those unwilling or unable to make the hike. Visit the small cafe at the top, which serves chai and snacks.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r437278229-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Religious place,peaceful feeling--", "review": "Those who come to Pushkar for a religious journey it is place to see,others can also visit for a peaceful feeling,this is a small temple on the peak of a small hill,though no more rich in architecture but rich just in feelings,now rope way is available for going to temple --thanks---SSS--", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r437326330-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "stunning view", "review": "we climb up to to this Mountain by walk and as soon as we reached there the view of pushkar was amazed, beautiful sunrise view across to lake    ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r437325623-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Magnificent view from the top of the hill", "review": "After visiting Brahma temple, we went to Savitri temple on 13th Nov 2016. We had to walk around 2 kms from the temple to the rope way (cable car). Savitri temple is situated at the top of the hill. So we opted for rope way. Charges per person (to & fro) for the cable car is Rs. 92/-. The panoramic view from the cable car was magnificent. The cable car halts for around 1 minute on the way for taking photographs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r438011277-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Physical labour reqired", "review": "U need to climb so many stairs before u reach the place so its better to start early in the morning .", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r438206920-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Awesome place to visit with family and friends. We visited the temple last weekend during Pushkar fair. We really enjoyed the trek to the temple complex. The views from the hill top is really mesmerising. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r438470606-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Sand, not sunset", "review": "Its a nice walk. We did it early to watch the sunset but, the air is so poluted that we could'nt see anything. But it was a nice trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r439713185-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Perfect for Sunset", "review": "One of the most popular temples of the town situated on top of a hill, accessible by rope way or by foot. You get an amazing view of the whole Pushkar town from this place. Its also one of the best places in town to enjoy the Sunset.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r438558019-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Funfilled Ropeway Ride", "review": "Since the Temple is at a peak and the walking way is also not that good govt has jnstalled Ropeway  for to and from journey which attracts devotees and travellers both.  Being at a height, it has a good view point for Sunset and if you are visiting Pushkar or Ajmer then i will surely recommend visiting this plave. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r427934309-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Amazing views", "review": "To be completely honest, it is just worth for the views of Pushkar. The temple itself has nothing to see. You have two options, either walk all the stairs or take the cable car. We took the cable car as that day was quite hot, but the steps are not that difficult. Perfect to see the sunrise or sunset.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r428307351-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Delightful experience", "review": "Have been to this place twice before and went by steps.This time we went by rope way...which was such a delightful experience that cant be expressed in words(though sometimes scary for me and my daughter). You can also take steps to reach this place nothing can equate that experience but you will really enjoy this adventurous trip also.Midway it stops for 30 seconds so that people can take photographs.You will have a spectacular view of whole Pushkar. Overall a great experience would recommend people to try this...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r426808609-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 2.0, "title": "Disappointing to Expectations", "review": "Other reviews are correct, the temple is horrendous, it looks like a city building that has been plopped on top of the mountain.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r438048426-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Views Views Views", "review": "Beautiful, uninterrupted and clear panoramic views of the town of Pushkar, the neighboring hills and the dunes. Definitely a great place to catch the sunset or sunrise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r431251553-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Nice views", "review": "Before sunrise mountaineering experience in India in somewhat special. The climb rewards you with beautiful views of Pushkar and the lake. To be completely honest, however, the temple itself is very small and the place itself is in terrible condition (stray dogs, piles of trash etc,); what a pity. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r435253354-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice View", "review": "it is very good temple and it is located in pushkar.you never miss this if you go to ajmer.it is near to ajmer", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r434179115-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view", "review": "Great view from the temple porch and its surrounding .  The inside of ths temple isnt interesting for a western tourist.  The ropeway cost of 92 rupee (2 way) was worth is,  but if you're in good shape you can try the staired lane.  Last ropeway back was 19:30. Rickshaw from the city market 100 rupee.  Back was 120 (monopoly...).", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r430506589-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "An amazing view", "review": "We walked from our hotel in town 2k up to the temple. Most people would catch the cable car (or rope way) but although a hard climb it was a very worth while experience to see the amazing view of Pushkar and greet the locals and other local tourists as we walked. You get an understanding of the geography of the area, the town on the lake and surrounding hills, sand dunes, rose and marigold gardens, and even all the camels gathered for the fair. It was an  experience not to be missed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r436158384-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must go for trekers!!!", "review": "Savitri temple is located on a mountain located about 2 KM near the Pushkar lake. We went trekking all the way from hotel to the temple and believe me it was awesome. We felt light and blessed when we reach there. The view was awesome and can see whole pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r406998128-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Panoramic views", "review": "Easily connected with a cable car, the ride costs only Rs 92 for a return trip. The views of the entire Pushkar city are beautiful. The temple attracts a lot of devotees. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r437093136-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sun point", "review": "Be it sunset or sunrise, this place beats most places hands down. Its about a 30 mins trek or if you are too lazy to trek, take the ropeway. Ample space on top to have an ideal lonely sunset and sunrise. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r436558621-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Nice Hike", "review": "About 20 minutes walking from the lake and another 30 mins hike to to the top (There is a cable car for 90 INR, return) - offers great views of the town and beyond.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r409131327-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "darshan at savitri temple", "review": "Savitri temple is one of the attraction of Pushkar.Reahcing the temple from valley  is very attractive and withstanding the valley in the mid for 30 seconds is a gud experience .overall view of pushkar from the top is very fantastic. a must visit place in pushkar", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r410375290-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Rope way experience is awesome.. ", "review": "You can take a rope way trolly sit in very affordable price at only 93 rs., if childs and aged parents with you then they will very happy because in both of them ages this experience will be memorable for them, &  of course the scenario from that hite is beautiful and awesome... So when you reach there take a experience of trolly.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r415362950-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful Trek. Beautiful View. Beautiful Sunset.", "review": "Savitri Devi Temple is a historic temple, located at the top of a mountain next to Pushkar. The trek to the temple is all stairs made of stones. There are several resting area present on the trek to enjoy the full view of Pushkar and Pushkar Lake and people taking camel rides to the left. Do see the sunset from the top of the hill.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r410859078-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A place which I remember always.", "review": "I have been there in the year of 2004. Long back. I was around 15-16 years old. I remember road was not road. There was 200+ stairs and after that trek. I have done that. It was a awesome experience. I heard that work on progress and till temple gate it will full stairs. I don't think that happens.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r417753380-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "India Tour September 2016", "review": "The ropeway trip up to the temple is not to be missed if you are in Pushkar.  The trip takes about 10-15 minutes in an enclosed car and stops half way up to allow photos. The trip can be very hot so choose your timing well.  The view from the top is spectacular.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r420413516-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunrise delight", "review": "Don`t postpone this visit as we did - waking up before sunset is definetly worth the impressions you get at the top. The stairs are rather long and may scary someone, but nobody makes you hurry. Take your time, don`t forget to take water with you. Lots of monkeys live on the top, so take care about your belongings - especially, if you have food among them!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r421196977-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "outstanding view", "review": "rely nice view .during the day is  hot take with you enough water at the temple bottle of water is very expensive  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r421199920-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing walk and view", "review": "You can desiderosa whether take the ropeway or walk up to the mountain but when will you arrive up there if you have been crazy like me you will feel paid back of any effort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r396218947-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing", "review": "Its very good Place. I really love to this place and feeling good after reach there. whenever i go to Pushkar than i always went there and spend 2-3 hours and feel relax.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r389425806-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Excellent views from the ropeway", "review": "Interesting access to the temple via a ropeway cable car which offers some great views of the overall pushkar landscape.  Our first real experience of rajasthan's unique landscape with the Aravalli hills providing a lovely backdrop", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r426660293-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Beautiful view", "review": "Hike up! It will be more fun, it takes an hour and little more from Brahma Mandir .. The rope way gets you up faster but if you are fit and love hikes - hike up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r392411365-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "One sight and whole pushkar..Savitri Temple", "review": "If you want a clear picture of what pushkar is.. Go to Savitri temple. Located in the hill behind Brahma temple..its is and old place of worship.. As per locals it was established with the Brahma temple.. Lots of devotees visit to offer themselves to Mata Savitri..Also its the best place to view Pushkar as whole...There is two ways to reach on to of hill..1)Climb the steps if you never tires..2)Use the cable car which cost 80 Indian Rupees Now (can't be sure of changes :))..well its worth to visit this place as you can enjoy the beauty of pushkar with a almost sky view", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r396441941-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A nice stroll.", "review": "An excellent mornings outing from Pushkar. Only fifteen minutes walk from the lake.Although it takes about an hour to walk up the view is well worth it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r397331727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple", "review": "Very beautiful temple on the mountain and now enjoy the ropeway also. give ur mind peace and relaxation.  nice place to meditation. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r396980177-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "temple with a adventure of mountaining", "review": "this temple having a historic and religeous importance. its was fun to reach there with friends through walk up bt now there ropeway also available. view of city from up was awesome", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r400316068-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "View of Pushkar is beautiful the temple is ordinary", "review": "Worth going up for the nice view. The temple is not exciting. The climb took me 35 minutes and was pretty tiring I recommend going in the morning and wearing good shoes. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r403126829-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing views of Pushkar", "review": "This temple, situated on top of a hill, is accessible by track as well as cable car.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r401552164-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "enjoyed rope-way", "review": "we took rope-way ride at savitri temple and the view of pushkar town is awesome and we enjoyed a lot..  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r381293600-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "MUST GO!", "review": "The view from up there is Awesome. You can sit there for hours and gaze at the city with amazing breeze.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r405965324-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Cable car in india", "review": "You need to ride a cable car to reach the temple since it is located top of the mountain. The view is just amazing, you can see the desert and rock boulders. Though the temple at the top is small.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r382635333-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Unique One ", "review": "I was there many time and again this year.  It's perfect place for go and practice meditation,  very shanti place with real feeling.  Go and enjoy ! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r381809302-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Breath taking view", "review": "Visited on 14 June. Now trolly service has been started. One can visit this place in 1-1.5 hrs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r383165285-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A jewel of Rajasthan", "review": "Since i am not very much into forts i really enjoyed Savitri Mata temple in Pushkar.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r384258526-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "experience of visit via ropeway. wow !", "review": "We experienced temple visit via ropeway & it was very good to be there during morning time. view is best from the top of hill of entire pushkar town & you could enjoy your chaaaii at the top. Rs 100 is approx charges for ropeway per person.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r384484543-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Improved and clean", "review": "A pilgrimage to many. People from all over India comes here to pray. Ropeway to the temple gives you a scenic view of Pushkar city. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r384615518-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Ropeway makes the visit easy", "review": "I did not know the ropeway is available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r385181094-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice", "review": "Nice temple. Great feelings. Travelled on camel to visit this temple. The shaky shaky feeling on top of camel was a  Nice amazing experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r386880970-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great Temple", "review": "The temple is a very powerful but relaxing place.  I have been coming here for years making the trek up the mountain annually.  The images have great energy.  The breeze and views at the top are worth the effort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r388114533-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Quick hike to Savitri Temple", "review": "Quick hike up to Savitri Temple, took about 15-20 mins to get up there to watch the sunrise and the view is amazing! The temple is beautiful and people were accepting to our group. Would recommend!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r364816442-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "The Only mandir of savitri", "review": "This temple is situated above pushkar lake, in pushkar where one has to climb up , the uphil a distance of 1, 5 km. it is ideal to start climbing up the stairs early in the mornings so you can reach in time spend some time & walk down before hot sun catches you. Yet it is worth visiting as you can have a experience both treking as well the spiritual  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r360901186-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing sunset", "review": "After doing our camel safari, we decided to head up to the Temple for sunset which was a 10 minute walk nearby and a half hour ascent. Great climb, got the blood pumping.. Especially in the heat! Outstanding views to the side and behind. You gain more of an appreciation for the pilgrimage site of Pushkar lake.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r364832624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Stunning views cute monkeys and heck of a hike ", "review": "NOT SUITABLE FOR THE UNFIT OR PEOPLE WITH BACK AND/OR LEG PROBLEMS DUE TO THE CLIMBING", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r364926266-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "nice place to see the sunrise :)", "review": "We went in the morning to see the sunrise and we had a beautiful view of the town, lots of monkeys having their morning routine, and nice contact with the town people coming to the temple along the way. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r366745185-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "camel fair ground view", "review": "short walk with best view excellent photos from there expetially at sunset , or early in the morning...just beautiful", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r371810488-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "\"Best view\"", "review": "It was very hard to climb to the hill but it really worth it. You can have the splendid view of the pushkar. The they sell on hill is the best chai we had so far in India.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r369802353-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Short walk up to the temple, great view on Pushkar!", "review": "Something around 1h to walk (try to go outside of heat peaks), easy to find your way. Great activity to do in Puskhar asides from the shopping!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r380252740-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "good but very far", "review": "this temple is on mountatin..i been once but coudnt dare 2nd time...need energy and patience to walk ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r374730197-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Wait till cable car ready", "review": "Cable car is ready but not yet open. After that it will be easy to go there. At present you have to be physically fit to go there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r349319256-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "\"AWESUM VIEW \"", "review": "Hard to climb on hill but it really worth it. Mono Rail is also available for reached at Temple. you can have the splendid view of pushkar. i really enjoy alot.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r377238695-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "WOW!!! Thank you Savitri!!!", "review": "Super walk up to this temple, and the view is extraordinary.  Thank you Savitri. Powerful temple, and you get to contemplate many thoughts as you walk up the mountain, the steps are very solid and wide so there is no problem with loose rocks. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r350234398-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth it for the view", "review": "The walk/climb up to the temple is actually quite picturesque. It gets pretty steep the higher you go, but it's worth climbing it for the view of the city once at the top. Be careful as you go up as you will almost definitely have to walk through groups of monkeys (some of which are quite big).", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r349841187-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Main attraction of Pushkar", "review": "Fantastic view of the desert, worth climbing 30 minutes the hill.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r353840310-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Worth it", "review": "The view from the top of the hill was one of the highlights of my India trip. Interesting temple. Amazing spot to look down on Pushkar and enjoy the view of the surrounding valley.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r355162537-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "great morning hillclimb", "review": "It is with getting up early and get to the base so you can see the sunrise from the top. 30 minutes should be enough and the view with a cup of ginger tea from a vendor is marvelous.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r359024400-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "evening view", "review": "sit on the hill top to enjoy the sunset and the calm distant land. its a tough climb but worth it. its peaceful n refreshing for sure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r357215546-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "good view, not much of a temple", "review": "After a long and hot walk, you finally get to a tiny temple with a small shrine, very much like dozens I had already seen without climbing so much.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r357695091-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "mountain trance", "review": "make sure your climb is early morning as early as possible. now rope way will be open from April 1st (may be - depends on indian govt). but if you can climbing is best. it is recommended to carry a small snack with you. water bottles are available uphill. If you are religious once definitly the savitri temple is your destination. and if non religious, climb the mountain walk past the temple to the back yard, climb a few meters uphill and then you may find some small tree and shady places and rocks where you can chill out and have your snacks and be in trance. if you like to read and talk on spirituality with your loved ones this is the best place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r359644575-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful views and cheeky monkeys", "review": "We climbed up to the Savitri Temple early in the morning yesterday and really enjoyed it. It's easy walking distance from town - just ask at the Brahma Temple, from there the bottom of the hill is about 10 minutes walk. We reached the bottom at 6am and were at the temple by 6.30am. It's mostly a fairly easy uphill walk, and just gets a bit trickier towards the end, but there are steps the whole way. Once you get to the top there's a guy selling chai, which at 40 rupees is a bit steep but I have to say it was an especially delicious chai. There are wonderful views of Pushkar, as well as lots of monkeys running around - hold onto your stuff, one of them tried to steal my entire backpack! It's definitely worth going early before it's too hot, plus at that time there won't be many other people about and it's very peaceful. A cable car has been built and apparently it's in the testing phase so should be open soon - but I imagine the downside of this is it will get a lot more crowded up there!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r360898695-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "very nice view", "review": "a lot steps to go up - but the nice view above is worth it! temple was closed so we did not see it but could get a chai at the top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r335204645-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth the Hike", "review": "First things First..it might seem like a fairly moderate hike from the base but that is not the case ! Having said that, trek to Savitri temple is worth the time and the energy as you get the best panoramic views of the Pushkar town. The trek gets quite steep towards the second half dotted with uneven boulders. Start early and make sure you get to see the awesome sunrise from the hill top. Beware of Langurs which are in abundance specially close to the temple.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r335408327-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Incredible sunrise views", "review": "Made the trek up here very esrly in the morning, drove by scooter from Zostel hostel to the car park at the bottom and made my way up, ñretty tough for first thing in the morning but a nice sugary cup of warm chai awaits you st the top of the temple alomg woth chocolate, crisps etc. I went up alone to fully appreciate the beauty and relaxation that you can easily find up there at that time n the morning, an absolute must if you are n Pushkar, especially for those keen on photography, if the weather is just right, you will leave with some oitstanding photogaphs...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r340365087-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Good exercise and nice views", "review": "Walking up the stairs was a welcome exercise for me and my kids after having spend too many hours in the car previously. The views were a great reward for the hike but the temple itself rather disappointing. The good thing though at this temple was that nobody was expecting and/or asking for any donations. On the way down beware of cheeky monkeys. We brought these eatable blessed \"pops\" down with us from the temple in a transparent plastic bag and the monkeys were so cheeky that they ripped open the bag with the pops falling out. Seemed to me like an exercise they haven't done the first time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r335231885-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunrise Trek", "review": "Stunning sunrise trek up the hill - take a rest if you need to. And cash for Chai at the top. The views from the back are incredible too!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r340888414-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Nice Hike Up the Steps", "review": "Good place to stretch your legs and climb the steps to the top.  Good to get some exercise after all those curries.  Took about 30 minutes each way.  There is a cable car alternative (however it didn't seem to be operating when we were there - perhaps it only operates at certain times of the day and/or year).  The best views of Pushkar are at sunset (where the sun is behind you).  Don't leave it too late to come back down as the steps aren't lit.  Walk around to the back of the temple (via the dirt tracks) to get the best sunset view.  We had a very nice and amicable auto rickshaw driver who took us there and back.  His name was Sattu (telephone 9414666961).", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r337720554-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Religious", "review": "Temple of wife of brahma ji.on the mountain little more to travel but nice to visit and pay respect and take blessings.must recommend to visit", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r342475149-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "On the top of Pushkar", "review": "It took me half an hour to get there, not so hard but totally worth it. You can see the whole town here. Worth a visit to enjoy a beautiful scenary", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r348130760-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great View and Place", "review": "After a great trekk walking at the top when the breeze flew it feels awesome nice view now rope way is also going to start so it will attract more people there", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r341689681-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "All senior people who can walk can access to this temple.", "review": "All senior people who can walk can access to this temple. Great view of Pushkar. View to see Mela ground and lake. If you can walk, you must be there. it takes an hour to arrive the temple from the road.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r328710649-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Lovely temple with beautiful views from top", "review": "The temple, view from the top and sacred worship of the goddesses at the temple are well worth the arduous hike...don't miss it ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r328184554-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Nice View of Pushkar from top.", "review": "We started in the morning at 5.00 am, after visiting to Brahma's temple,we  took the narrow lane on the right side to go to Savitri temple.There are stairs as well as sloped pathway leading to temple.The temple is not having any remarkable architectural interest but the journey is wonderful- it takes about 2.5 hours to go up and come down.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r328506912-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Most enjoyable place in Pushkar", "review": "The walk up the hill and the view on top was the best trip we did in Pushkar. A lot of locals walk up there to pray at the temple, its an about 45 min. walk, we also met really cute black goats with light dots on their furr and white ears ;-) and on the top there are a lot of monkeys. Totally worth a visit!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r328714192-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Good views", "review": "Good views from the top of the hill.  Go early- it gets hot.  Watch out for the monkeys near the top, but they won't bother you if you don't bother them.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r328796209-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great sunrise or sunset hike!", "review": "This is a fairly challenging 'walk', it takes around 40 minutes to go up and 20 to come back down. Good shoes are recommended! The view from the top is spectacular. A 360 degree view of Pushkar and the surrounding desert and mountain landscapes. If you continue on behind the temple to the edge of the rocks it is very peaceful and you have a spectacular sunset view. The sunrise comes over Pushkar town. There is a small chai and beverage shop at the top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r329307492-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Nice view", "review": "It took about 30 minutes to reach the top from the bottom of the hill. The place is free to enter and the walk isn't too hard. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r331814244-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Good walk during a early morning", "review": "Savitri temple is nothing to talk about. Walk there is great. You have a  brilliant view and exercise is good. Steps are uneven so good footwear is essential. I found baboons mild- not aggressive like I expected. They were in group of 20. Early morning walk was so quiet, there is not many quiet places in  Pushkar.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r329515076-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Good exercise", "review": "We did the climb/walk up the hill to this temple at sunrise. It is good exercise! Higher up the steps are steeper and more uneven. Good view when you get to the top, though it wasn't very clear the morning we went. The temple at the top is nothing much. Mind the monkeys, as they will grap your camera, water bottle, or anything else. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r332202077-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Quite a Climb", "review": "quite a climb but worth it as you get the complete view of Pushkar and the hills beyond. Its better to trek to the temple early morning in order to avoid the harsh sun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r308021094-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Hell of a Hike", "review": "Savitri Temple is a very steep hike, so good for exercise..Be prepared to sweat! Temple itself is small and nothing special.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r333405168-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Great view, do it in the early morning", "review": "If you are in Pushkar go for this early morning trek. Do it BEFORE sunrise, it is quite a cardio exercise. We started around 5:30 (check the distance from your hotel and the time of the sunrise)", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r311449703-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "\"splendid view of pushkar\"", "review": "its very hard to climb up to this hill in beganing but once you reach there it provide a great view of pushkar lake &city.all the city looks white&white.i also recommend a chai shop just outside the temple.it serve very good chai.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r314171484-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "The Savitri Temple", "review": "This temple is dedicated to the first wife of Lord Brahma.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r315787838-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Beautiful Review", "review": "Located high on mountain in Pushkar town. You can get nice view from this place.  Would be better if visit this place early morning. Sunrise is amazing from the top. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r321049073-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go for the view...and the trek!", "review": "The temple for the first wife of Lord Brahma is atop a small hillock close to the Brahma temple in Pushkar. Beware it is a proper trek up. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r319207098-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Quite a climb! ", "review": "From a distance it looks like a smallish hill, but once you start it's turns out to be quite a hot and strenuous climb, however great views make up for it, also you will meet cute monkeys! There is construction in progress, a cable car apparently...the temple at the top is nothing special, just go for the view... A shop at the top sells cold drinks and tea, very handy! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r321891752-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Jay matadi ", "review": "Savitri mandir is just behind the bramha temple on the mountains. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r324872522-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Superb climb up to a small temple - one of the few peacfull places we found in India ! Very peacefull....", "review": "We adored our treck up to this small temple overlooking the town.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r324252000-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "So many steps to climb, but worth the visit!", "review": "I first heard about this temple from the locals. I heard many good things about temple being very powerful and local married women go this temple for long life of their husband. When I visited this temple in September -15 , construction of lift is going on which should be done in less than 4-6 months time. However, if you choose to climb, be prepared to have lots of water to carry with, also there are monkeys close to the temple main door and they will try to snatch anything you carrying. Wonderful top view of the whole Pushkar town. If possible, go early hours of the day as its very hot during afternoon hours. Elderly people are not advised climbing the steps , nor children. Good Luck!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r324994157-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Seriously hot", "review": "Best to avoid in summer - the locals are lovely, but they were so hot and bothered and couldn't believe a tourist would choose to put themselves in this heat. Don't trust the bottled water -  unless the lids are tamper proof. I saw the kids picking up discarded bottles and refilling them.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r281073935-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "For Heights lovers", "review": "good place to go if you are in pushkar,", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r285471168-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Unbelievable view", "review": "The steep climb to the top is will work it when you see the view over Pushkar. Temple itself is quite small and similar to most small temples in the area. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r288035542-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "great temple", "review": "this temple is on the rock.beautiful  pushkar was nice city . to many temple there. Pushkar has a magnetism all of its own – it's quite unlike anywhere else in Rajasthan. It's a prominent Hindu pilgrimage town and devout Hindus should visit at ...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r288668954-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A trek To Holy Abode", "review": "A great trek to the historical temple,  but a tough one in the scorching heat. Breath Taking panoramic view. Must be good during monsoon or winters", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r286416157-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Too far from city", "review": "The temple was interesting as a rare Brahma temple site.  The distance travelled however made it not worth the trip.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r298498928-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "view of pushkar from temple height", "review": "view of pushkar from temple height  you can see whole pushkar from one place the view is awesome ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r305273123-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Soothing trek", "review": "This temple is 4 KMS from Brahma temple. 1.5KMS of walk and 2.5KMS of trek. The trek consists of combination of small steps and stone built steps. On reaching the top, the view is breathtaking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r302429477-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Walk dont Run", "review": "This is quite a steep climb for us older folk, but the kids fly up and down it. Nobody said it was going to be easy. Fantastic panoramic views from hilltop until the complete the chair lift which is in the process of being built. The Savitri Temple itself is lovely and  quite peaceful, but remember no photos.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r305529174-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "good", "review": "good I like to go early morning when the sunrise up...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r307446256-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing morning hike to beat the chill!", "review": "Its a comfortable 2 hr hike (entire trip) carry light though because its a little steep. The journey is just long enough to absorb the spectacular view...", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r249660602-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Ohm, Shanti!", "review": "We're a middle-aged couple and not in perfect health, so this wasn't exactly an easy journey up the mountain for us. However, something beautiful happened along the way up...a pilgram was returning to the bottom as we were ascending and called out, \"Shanti, Shanti!\" to us. Oh, yes! Peace, peace...instead of continually looking ahead at the long journey, we walked in peace, each step a new experience and fully embraced. It became much easier from that point onward...a peaceful journey to the top and back. We met so many lovely people along the way.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r252182590-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Nice to walk up to the hills for view of Pushkar...", "review": "It is just out side of Pushkar and can be nice walk at evening time and see the view from the top. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r257012009-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Excellent view of Pushkar & desert", "review": "The temple is on a hill top, which is top most point of Pushkar. We climbed steep steps for around an hour to reach the top. We went in the evening and had Sun set view in the desrt. The temple is small and old dedicated to Maa Saraswati. The view of Pushkar on one side and the desert on the other side is excellent. Choose either morning or evening to climb to avoid hot Sun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r259052942-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Temple of Goddess Savitri", "review": "The temple is dedicated to Goddess Savitri, wife of Lord Brahma sitated on Hilltop near brahma Mandir. You can see an ariel view of Pushkar and desert from here.If you start early evening you will be able to watch Sun-Set. We have to climb for one hour to reach on top.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r263942253-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Stunning scenery", "review": "It is a steep climb in parts and is good cardio exercise, but worth it once you get to the top and enjoy the view, especially good if you're there for sunrise. The climb itself takes between 15 and 40 minutes with a few places to sit on the way up, however the steps are just cut rock towards the top so take proper shoes. There is a temple at the top and and a small shack where you can get drinks if needed.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r260664870-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Worth the climb!", "review": "The temple itself isn't the most spectacular, although it definitely has its own charm to it. The climb is gruelling as well, particularly in the midday sun, so stick to sunrise if I were you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r264203686-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Definitely worth the climb", "review": "Stunning views from the top, steep climb up. There is a cafe at the top with water and snacks. Lots of monkeys on the trail so avoid carrying food with you (they are not shy to come up and take it). Definitely a must-see in Pushkar!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r274570386-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "savitri temple", "review": "gud place should go and find the good art work there and even its a kind of a adventure visiting this  place situated on the top of a hill ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r266102976-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Sunrise and chai", "review": "The hike to this place is a bit tedious but worth it. Go before the sunrise and enjoy the tea you get at the top. It an experience you should try and get in during your stay at Pushkar", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r192182928-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Perfect way to start a day !", "review": "A lovely temple about 45 min walk from Pushkar past the Brahma temple.  It gives a good view of the city and is the perfect way to start the day looking at the sun. Start early as it gets hot walking.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r260495185-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "A Must see for trekkers - I Just loved it!", "review": "This savitri temple is on the top of Ratnagiri Hill which is in pushkar. This hill is around 1-2 km from lord brahma temple. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r193023624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "viewpoint", "review": "temple itself is not so interesting but it's definitely worth to climb Ratnagiri Hill. whether for the sunrise or sunset you will be rewarded with the great view of Pushkar and surrounding desert.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r200194857-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Amazing View!", "review": "The favourite thing I have done in the entire country so far! Walking up the hillside isn't too difficult and the reward at the top is incredible! Such a fantastic view of Pushkar and the surrounding areas, the temple at the top is very quaint and gives 360 degree views of the Pushkar area which is very rewarding and peaceful. Highly recommended.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r195541834-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Some good views in a nice day", "review": "We hiked up to this temple for sunrise in Pushkar. The temple itself is not overly spectacular but the views over Pushkar were good, despite the disappointment of a hazy morning.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r224106635-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 3.0, "title": "Long climb", "review": "We climbed to the temple today. We are in our 60's and found the climb challenging. It took an hour and the grade was 45 degrees at times. The path was just rough stacked stones in places. The temple is OK but the view is nice despite the haze. A guy at the top watched our shoes. When we finished viewing the temple, we went to tip the guy. The shoes were there but he was gone. We asked a guy in the adjacent shop if he knew where the shoe guy had gone. He said \"Oh, he is out to lunch.\"", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r237715479-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 2.0, "title": "Visit if you have extra time..not much great view from top", "review": "You will need flat 2-3 hours to complete this temple if you intend to go to the top and come back. We had halt at Pushkar and hence we had decided to go to the top. We completed the full trek to the top and back in 2 hours flat. Many people have said view from the top is very nice but that is not so true. I did not find the view to be very great..its was just an ok. You can skip trek to the top if you are short on time. Work of ropeway al the way to the top is in progress.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r245340199-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Sunrise Hike up to Temple", "review": "We did a sunrise hike up to the temple during the Pushkar Fair. We took a camel cart from our tent camp through the fairgrounds (fun to see everyone waking up) and arrived at the base of the hill about 6:30ish. The hike up is very steep with many rocky steps. It is definitely for those sure of foot.  Uphill is quite the cardio work out and down hill will work your knees and ankles. Wear sturdy shoes! At the top of the hill there is the temple and a small stand that sells tea and bagged snacks. There were a few places to sit as well to catch your breath.  Watching the sun rise was very pretty, but it was very overcast and the views weren't the best of the surrounding areas. I definitely suggest going on a clear day if possible. My husband loved the hike, perhaps because his cardio is better than mine! I was huffing and puffing the whole way up and didn't enjoy the view quite as much.  He carried our toddler on his back in a carrier.  I think it would be hard for young children who can't be carried.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r238837599-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunrise", "review": "We travelled up here for sunrise... amazing views! The sun slowly rose over the mountains and the light streamed into the valley. The lake is beautiful from up here, and part of Ajmer can even be seen!", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r249398180-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Incredible sunrise!!!", "review": "This was actually the best thing I did in Pushkar, heading up the hill for sunrise.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r182225591-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A temple with a view", "review": "Savitri temple, as it is popularly known, is in fact devoted to three Godesses, Sharda, Savitri and Sarasvati. It sits at a spectacular location in Pushkar, on a small hillock, from where you get a beautiful view of the town and the surrounding plains and hills.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r190300011-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Get way to start a day", "review": "Go up the climb for sunrise. The view is amazing up there. The climb will get you blood pumping a bit. When we were there there was a cow that lives at the top and monkeys around. Good entertainment (but monkeys are everywhere). The temple is nice with a great spot to sit and look out at where you staying.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r191103069-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Must visit", "review": "Beautifully located at the top of the hills with great views of Pushkar and Mountains. There are two ways to reach the temple - either chair lifts or walk up there. Walking is good if you have health and time. Spend few hours. Monkey business is literally in plenty.  Try to visit during late evening, Sunset is breathtaking. You will not be disappointed", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r653581561-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Savitri Temple Pushkar", "review": "A must for those on a religious trip to Pushkar ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r654640252-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Great views of Pushkar! ", "review": "Amazing view of the whole village of Pushkar, great for sunrise. The walk can be challenging for people who don’t like stairs but it’s relatively easy. To find it, just follow the mountain, looking at the cable car. You will find steps, take then to the top. If you feeling tired to go down walking you can always take the cable car down or the way around. I am not a big fan of the temple itself as I am not religious but the walk is great and the view breathtaking! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r657705660-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "A most amazing view", "review": "Walk up the mountain, or catch the cable car for the most stunning views of the whole area. They do close for lunch so its worth checking how long you will have up there when you buy your cable car ticket. There is a beautiful temple on top of the mountain and a little gift shop. There are many monkeys up there so bring something to feed them if you like or buy something there as they do sell food for the monkeys. Don't get too close to them though . If you are coming to Pushkar I recommend a visit to this temple, and also the one on the opposite mountain if you are fit enough to walk up. A truly wonderful experience.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r655815756-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Good scenic view.", "review": "The temple is situated at the mountain top. There are 2 ways of reaching the temple from the base. either go walking or take a to and fro cable car, which is a good experience. There is asmall temple at the top, with good scenic view of whole city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r658280727-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Hill Top Temple offers panoramic view of Pushkar", "review": "A very simple temple on top of the highest hill near Pushkar which can be accessed by steps by sport loving young people and also by rope way for easy going or those with less time in hand. It gives a breadth taking panoramic view of area around Pushkar with Brahma Sarovar in the center.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r659557624-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Sunset ", "review": "This temple is on the hill. There are two ways of going to the temple one is by way of stairs approx 1100 stairs and the other is the rope way . We had gone by using rope way or cable trolley you may call them. The best time to visit this place is when it is about to have sen set. A spectacular view of sunset and the whole Pushkar can be seen from the temple and the hills . Must visit ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660399402-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "Go there for the view", "review": "We went there today by car from Ajmer. You won't find much traffic in Pushkar as you will follow the outer route to reach here thus avoiding the city. As mentioned by others, there are 2 ways to reach to the temple at the hilltop, through stairs or through ropeway.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r660563311-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 5.0, "title": "Holy place ", "review": "After offering prayer at Brahma Temple we went to see Savitri Temple. Nice view of temple from hill top ", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662330427-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Savitri Temple", "rating": 4.0, "title": "good workout", "review": "the new steps made the climb easier. if you feel being lazy, take the gondola, the views are fantastic, i hope they are opening a chai shop in the not finished building on top", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d4437514-r662145062-Savitri_Temple-Pushkar_Ajmer_District_Rajasthan.html"}]