[{"point_of_interest": "Shiva textiles", "rating": 5.0, "title": "Best place for shopping ", "review": "I bought nice Tapestries and mandala bedsheets they all are nice and fabricated by high grade fabric colors are nice you can use many times also you can find other things like cushions puffs scarves pashmina bags and many more shop is nice as well as staff is nice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10729225-r417405941-Shiva_textiles-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Shiva textiles", "rating": 4.0, "title": "Cool threads", "review": "Nice shop with good handmade hadicrafts bedspreads cushions puffs pashmina with reasonable prices. Owner Shiva is a nice and kind person help in every kind of work like tickets restaurant parcel sending etc. You can by many gifts or for reselling nice products.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10729225-r431386529-Shiva_textiles-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Shiva textiles", "rating": 5.0, "title": "Good Quality", "review": "I once bought a lot of products to take to my country and everything was sold out in weeks. The second time I asked for a parcel for them to send directly to my country since I couldn’t go to India personally and the attention and service was 100% professional and on time. Highly recommend their products and services.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10729225-r637622664-Shiva_textiles-Pushkar_Ajmer_District_Rajasthan.html"}, {"point_of_interest": "Shiva textiles", "rating": 5.0, "title": "Shiva ", "review": "Shiva textiles and his owner are the cherry on the cake when you want to bring back high quality textiles. Prices are very reasonable and if you take the time he will pull out some fine treasures for you. Hard to resist, I ended up spending most of the day there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g319729-d10729225-r657833837-Shiva_textiles-Pushkar_Ajmer_District_Rajasthan.html"}]