[{"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "Local market", "review": "It is  Nainital's local market which is easily accessible to everyone. It is mixed market with branded and non branded showrooms. Most of shops were selling woollen clothes or wool, rates here are better than that offered by shops on mall road. Some candle shops can also be found here. Overall it is an average market and can be visited once for shopping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r475827055-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Market with more variety", "review": "Market is good for shopping purpose were things are available at reasonable rates and more variety of products are also available.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r497020219-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Plenty to varities and well managed", "review": "The market is quiet clean and well managed .Crowd and traffic is well manged by police. The market is having all varities of products but i specially liked wooden products like bangles,bowls,showpieces.The shopkeepers are all well behaved.There are many good veg.resturants too for having nice dinner.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r497620485-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Frequently visit the place. Oldest market in Nainital more than 140 years old  with effects of modernization.", "review": "As oldest market one can shop around for almost anything and if one gets hungry variety of eateries to fill the palate. If you are in Nainital Do not miss this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r545674589-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Candle shopping - Barra bazaar", "review": "We were thinking of buying mementos during our Nainital trip and couldn't decide what to buy. We saw some beautiful variety of candles near the Naina Devi temple during our morning sightseeing and decided to explore this buying option. Our evening shopping sojourn led us to Barra or Burra or Bada bazaar. We visited 3 shops over there and were hugely impressed by Gupta's and Mehrotra's outlets. Especially the latter had the maximum variety. 1 visit to this shop is recommended to soak in the atmosphere.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r512209992-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Best place to shop at nainital", "review": "Though the Mall road is more famous it has shops which are more expensive. Bara Bazaar is just 300 mtrs away from Mall road across the cross road and it is a much better place to shop. The shops have a better variety at cheaper or even wholesale prices. So do have a look at Bara Bazaar shops before making your purchases.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r570137808-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Shopping Paradise", "review": "At Mall Road / Bara Bazaar you may find all sorts of stuff from local produce, to branded products. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r531103996-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Better than Mall road", "review": "Yes this is the best market in Nainital as lot of options are there for local products to branded one. This is locals favorite market too. A little crowded some times but worth visiting. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r574830452-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Good Place to buy items in Nainital", "review": "If you are travelling to Nainital and looking to buy something, you should visit this place which is just 5 minutes walking distance from Naina Devi Temple. The market is having good collection of Garments, Candles, Foods. Don't forget to buy the famous beautiful candles of Nainital from the Mehrotra's shop at Bara Bazar. Rates are quite cheap with compare to the rates at Mall Road Shops in Nainital", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r641397329-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Good place to have a shopping experience in Nainitaal", "review": "I did not shop from this market but enjoyed taking a stroll through it. I only shopped for some lovely candles that are the most famous shopping item in Nainitaal.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r383919863-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "SHOPPERS PARADISE DON'T SKIP IT...", "review": "We visited the bara bazar recently here there is more posibilities of shopping especially candles in different forms of statues and scented candle attached ceramic budha artifacts to use along with scents poured in water in bowl attached to it .Due to heat convection scent spreads through out the room by evaporation they are many designs of course  with electric attachment also available here.cheaper than online stores .Acrutes;badam, is just cheap here slightly on my observation.shawls also .", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r652004405-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "U can get anything here ", "review": "This is one place where u can anything u require for your daily need and on fair price and there at some very famous shop like candle shop winter clothing shop and some of very good dhaba .. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r389421475-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "great walk", "review": "famous mamu's sweets is located here, there is good shop for khadi and chicken corner is there which offers brilliant food under budget, tandoori roti only costs rs. 8. Thats really cheap in there.  there is also fruit shop the prices are really good if you want fruits to your home  he (muslim guy) will pack it accordingly.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r385785140-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "Okay than average ", "review": "Small & limited options. Bargain market. All general stuffs. No special variety.. It's okay if you skip it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r443340323-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "local flavour", "review": "We turned from the tibetan market to this place. This market is well known for locals who do shopping at this place there are some reasonable shoe shops,Candle Shop,Bakery,Desert Shop,fast food place on very fresh and reasonable price,if you like to walk then its worth to visit and save some money in eating and shopping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r453730291-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Walking Market", "review": "This market is very well known for locals who do shopping at this place there are some reasonable shoe shops,Candle Shop,Bakery,Desert Shop,Saloon,and bank ATM and some good vegetable and meat shops,with good fast food place on very fresh and reasonable price,if you like to walk then its worth to visit and save some money in eating and shopping.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r441738104-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "An okay place", "review": "This place is okay if you want to buy some local stuff, candles or souvenirs as the prices are more reasonable than mall road. Few restaurants are also there n the food is cheaper than at the mall road. All in all an okay place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r389774527-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "Local market", "review": "This essentially a market place for the locals, though there are hotels and restaurants catering to the needs of the tourist. If you are looking for freshly made Kumaoni sweets and other local delicacies; this is the best place to be in Nainital. The Bazar is at the beginning of the climb of Mallital.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r453775973-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "In Mallital", "review": "Bada Bazaar is in Mallital. After roaming in the Tibetan Market, we decided to see bada bazaar. This place is studded with a lot of economic hotels and restaurants. Remember to bargain whatever you buy from here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r444407573-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "A great market near nainital lake", "review": "You must have buy small products to decorate your home and to have a memorable item that you can say i had bought this item from nainital. I had bought some craft like a rikhsha a bicycle and some tiny bicycle keying that are made of single wire . A great experience. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r467970875-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Good quality food", "review": "This is a very good market for tourists. here one can find the same branded clothes at very low prices. the quality is good. its a main attractions near Naina devi temple. here u can get good food..", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r303090214-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Shopping !", "review": "Located in the midst of Nainital city/ next to Naina Devi temple and offers great shopping options at right price for all.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r304559814-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Lively place loads of shops!", "review": "This is the main market area present at the northern end of the lake(Mallitaal) where everything is available. Check out for enticing shawls, woolens, jackets, candles, wooden artifacts. Stoles are available from INR 100 ( Example: Sunny's Collection). The shopkeeper 'Firoz' turned out to be a friendly lad!Candles from INR 10. Wooden artifacts from INR 30.Jackets are available from INR 800. Though I found a particular jacket for INR 550 being sold at various shops in the Tibetan Market. Colors are very fluorescent in nature. Shops selling tasty chicken rolls and other eateries, vegetables, flowers for offering in Puja all are present!", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r326813968-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Best place for shopping", "review": "This place is just next to mall road and naini lake. There are lots of candel shops, fine restaurants, woolen shops. The price of the products are not expensive. There are fixed price of each products. Very less chance of bargain.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r336009719-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "do visit if you are in the town", "review": "the place is a must visit in nainital.  I had a really great time here shopping and enjoying the fast foods . The place is so vibrant and cheerful, some may call it crowded, but i liked the hustle and bustle of that market. The items were very reasonably priced and there was no window left for bargain. I bought souvenirs for all my relatives from there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r339046827-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Lots of local souvenirs", "review": "It was nice time pass, the kids and family enjoyed looking at the things, nice window shopping. I am not a big fan of shopping, but it was great to see your family enjoy.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r330145212-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Value for money shopping and eating", "review": "Bara Bazaar is located right next to the mall road and is a great place for roaming around, shopping and eating on the cheap. Compared to its peers on mall road, you will find local restaurants here who serve the same or even better food at half the prices (Try the new chicken corner for all the non veg lovers)", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r354015444-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Worth the visit at least once", "review": "Whenever you would be visiting a tourist place you would always want to buy some gifts and memorabilia for loved ones, and this place can answer all such needs. Rates out here are decent and you can always negotiate hard. Not to miss the famous candles of Nainital.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r340295544-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "Its local market..", "review": "It's a market for locals to buy daily need stuff. Nothing much to write or appreciate. Though it's a local market but if they find out that you are from outside they try to charge extra. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r365432929-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Market", "review": "One of the best place for shopping at nainital.This place is just next to mall road and naini lake. There are lots of candel shops, fine restaurants, woolen shops.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r377485099-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 1.0, "title": "Normal Market, nothing much to do", "review": "We crossed this market on our way to the mall road. This seems to be a local market and not for tourist. There is nothing different here. I would recommend the Bhutia Market near by, where much more options are there in terms of shopping for winter cloths as well eating.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r131802161-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 1.0, "title": "never buy anything from Prince Store Mall Road", "review": "I had very bad experience at a store called Prince Store located on Mall Road near Nanak Restaurant. They sold me a ladies woolen wear that had a hole ! When I went to get it changed next day, the shop owner behaved in a very arrogant manner and even said that the piece was ok when sold and we had caused the damage ! How terrible a behavior ! When we objected to such irresponsible remarks, he said he was allowing us to replace it but said  this was purely an obligaton on us ! Instead of apologising for having sold a defective piece the owner behaved in the most arrogant manner possible. We strongly advise all tourists to avoid dealing with this shop. We ultimately refused to change the piece out of sheer disappointment and to deprive the owner an opportunity to load an obligation on us. We valued our self respect more than the money spent on the defective garment", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r209286538-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "main shopping centre of Nainital", "review": "This is the main shopping centre of Nainital with number of shops selling different  items .There are a number of eating joints also.It is    most of the time crowded  with people.Bargaining is common.for clothes especially.Not far from flat .", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r216029851-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 1.0, "title": "Local cheap market", "review": "As we see in mumbai or delhi its a market which has close resemblance to markets near a railway station just local stuff fr d localites nothing really worth seeing", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r187170405-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 4.0, "title": "Local market - fascinating", "review": "In contrast to the previous reviewer, we found the Bara Bazaar fascinating. It is indeed a truly local market and not for tourists. The other markets we found to be rather disappointing copies of western-style shops, whereas the Bara was full of colourful, genuine, local tradespeople. Deliveries into the narrow alleys were of necessity by foot and therefore huge trunks and packages were carried - traditional-style - on the backs of the tradesmen, using worryingly flimsy-looking material bands around the forehead. It was busy on the day we visited, but not too crowded to spend time trying to identify the various spices on show, cheek-by-jowl with live maggots (a delicacy, we understand!) and rainbow-coloured shalwar kameez. However, when it comes to clothing, the most attractive items were the tartan shawls - useful for the cold nights  in winter up here at 6 thousand feet - a leftover from the days of the Welsh and Scottish missionaries. Worth a browse", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r145386069-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "Fantastic", "review": "Fantastic. A a complete Tourist Shopping experience with anything, & everything available. Shop owners are very humble, with very friendly behavior. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r249462900-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 5.0, "title": "The Orignal Bazaar of Nainital", "review": "We were on our way back to our hotel in Sukhatal and decided to enter into the local Bazaar at Mallital in Nainital, we found quite a few interesting shops, old restaurants, party shops, Halwai shops, medical & artifact shops, Candles & Umbrella shops and ofcourse Vegetable & grocery shops in the Bara Bazaar!", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r283518148-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "Crowded", "review": "Crowded place with lots of cheap stuff to buy. You will get a lot of variety here and you can negotiate rates for everything. You can walk around in the evening and enjoy the shopping with cool breeze.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r279853780-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Bara Bazaar", "rating": 3.0, "title": "For all!", "review": "The main market of Nainital, you can find all sort of things here from foods to souvenirs. You may like to purchase fancy candles which are iconic souvenir of this hill station. Bit crowded.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d2711701-r292499019-Bara_Bazaar-Nainital_Nainital_District_Uttarakhand.html"}]