[{"point_of_interest": "Gurney House", "rating": 5.0, "title": "Gurney House - The only House in Nainital for Attraction", "review": "Gurney House is an old building about 135 yrs belonged to one of the renowned Hunters Mr.Jim Corbett. The house has been maintained well by the present care takers with all the historical assets collected by him.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r479206908-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Historic", "review": "This is a historic building and was a house of Jim Corbertt once upon a time.  now it is owned by an Indian family.  it was enjoable to be here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r467465521-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Must visit place", "review": "it is an old building and was house of jim corbett. Now its converted to museum with every room keeping its old era feeling. Museum is free and probably the only place in Nainital besides temple which is free. Every room takes you back almost 100 years back from bed, mirror, almira every thing of older years. His living room still has lion skin carpet and lots of dear head hanging on wall. Going around his house doesn't take more than 15-20 minutes but its worth of every time spent there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r576176721-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Awesome", "review": "We have seen movie on Jim Corbett @ Jim Corbett and in the beginning of the movie they have shown this home. This house was owned by Jim Corbett before 150 years and now owned by a gentleman from Delhi.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r581731024-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "Not a museum for sure", "review": "Apparently the house has been sold off and is not open to the public so dont expect anything...although the trek up to the house is worth it. Take the offbeat path to the house and enjoy the trails", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r595991190-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "A place most of the tourists do not know about. For Jim Corbett fans.", "review": "This is the place where Jim Corbett lived years ago. Now owned by Dalmia who bought it around 80 years ago. This is on a steep road, and most of the tourists are not aware of it. Maintained by an old lady who opens it for you.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r628944760-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Gem of a place. Old World Romance.", "review": "This is the most stellar place in all of Nainital. Dont forget to visit it while you're there. Its the old residence of Jim Corbett and his sister Maggi. It currently organises meet ups, book readings and general gatherings of old timers. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r585702784-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Great Service in a colonial setting", "review": "We did not stay at Naini Retreat but had gone to the restaurant twice. It's  expensive for the place but the service is really awesome. Jalal, Harish & Govind have taken care of our food needs. Quick & efficient . Food was also very good.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r616345234-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "not that great", "review": "first of all, the place was not very easy to reach since not many local people knew about the location. Our driver had to ask from a bunch of people and then finally we reached there. On our arrival there, we were very disappointed to see that the place was closed. We didn't know about the visiting hours,still we had reached there by 12 noon, which shouldn't be a time for the place to be locked. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r339047493-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "Jim Cobett Lived here--many years ago!!", "review": "This is famous house as Jim corbett stayed many years ago. House is sold out and owned by some businessman . You can reach this house by trekking and enjoy the view of surroundings. Otherwise nothing  great and not on tourist map.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r650010800-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Home of Jim Corbett", "review": "The current place was once the home of  famous hunter Jim Corbett. The Place is now converted to museum. One good place to visit and experience history.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r378542321-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Nostalgic", "review": "The estate manager Mr.Joshi showed us the house on our 3rd request as this is a private property. The owners have a big heart to keep it accessible to public who have a keen interest in Jim Corbett. The furniture in the dining are from Corbett's time and most of the place has not undergone any change. This makes it more wistful. Thanks for the owners for maintaining it well and allowing public to have a tour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r379820850-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "Museum of great Hunter", "review": "The residence of of the famous hunter Jim Corbett,where,he and his sisiter Maggie Corbett had stayed during their tenure in Nainital,built on the top of Ayarpata hill, at an altitude of of 3000 mts. and approx 3.5 km from the main town of Nainital.This house has now been converted into a museum name Jim Corbett Museum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r378109071-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Gurney House", "review": "Gurney House, the former residence, of Jim Corbett, is located on Ayarpatta Hill. Before leaving for Kenya, Jim and his sister Maggie sold the house to a zamindari family in Bihar. It is a private residence but is open to visitors as a museum of Corbett memorabilia.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r456064070-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Good Taste", "review": "Nice lunch food and home made rotis and but the menu is limited but mutton by the chef is very good but portion is limited. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r220490413-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "Lovely historical and nostalgic place, albeit rude caretakers", "review": "This is a wonderful place to visit for those affectionate of Jim Corbett or those who love visiting historical buildings. It is also very generous of the owners of this house to let their private property be available for public viewing.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r426275459-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "House Cum Museum", "review": "Jim corbett lived in the Gurney house with his sister maggie corbett.Now,the house has been converted into museum and also known as Jim Corbett Museum.The museum has on display memorabilia from corbett's life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r440295352-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Majestic!!", "review": "The place is located close to \"Thakur Dev Singh Bisht Campus\" college. You can get there by walk. It's a small climb from the Nainital lake, on the Hanuman mandir side. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r415555232-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 3.0, "title": "not as interesting as Corbett museum @ chhoti Haldwani", "review": "this was the summer residence of Jim Corbett built in 1881 by his parents .", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r461147160-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Sir Corbett's Home, do Visit", "review": "It is where Sir Jim Corbett was born and lived. You can find each room preserved with his belongings and other memorabilia The Dalmias owning it has protected it all along, but it deserves much better upkeep and word of mouth. A brief trek of less than an hour along a populated road up the hill overlooking the lake will take you here. One can as well hire a car to reach here. The caretaker residing nearby is generous to show you in and around. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r238121026-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Nostalgia for Corbett-o-mania!", "review": "A must visit, Gurney House is a step into the past. Jim Corbetts home till he left India, the new owners have tried to preserve the place as Corbett left it. His chair, bed, rooms, study, verandah, even some old photographs add to the ambience of the place. If you grew up on Corbett's accounts of the maneating tigers and leopards of Kumaon, and now are a conservation buff, dont miss dropping by. The caretaker is willing to show you around at your own pace.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r268414284-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 2.0, "title": "Gates Closed and no one is there", "review": "Read a lot in the reviews. After visiting Jim Corbett sanctuary thought we will visit this place. few members mention that it is a restaurant. Not sure if this is correct. It is for sure the place where Jim Corbett stayed. Not many people in the locality new, so after asking few localites, went to this place but to our disappointment it was closed and not even a soul. Disappointed....", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r265066690-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Jim Corbett's Home", "review": "A nice place to visit if you are on a trip to Jim Corbett. A small trek from the park takes you the place. The house is well preserved though needs more attention in terms of maintenance and publicity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r266653681-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 1.0, "title": "Never even think of visiting this place", "review": "A fu****g place to consider to visit. Nothing you will see here. I have read on the website that this was the residence of Jim Corbett and will give you the feel like you are in the British India age. I asked atleast 20 people where is Gurney House, Nobody knows that. Then I opened my GPS and start tracking it by myself. After walking around 6 km on a difficult road on hills, I finally reached at Gurney House. It is like an normal house you can see in any village...A VERY NORMAL HOUSE OF A POOR FARMER YOU CAN SEE IN ANY BACKWARD VILLAGE. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r312552804-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Unmatched grilled food", "review": "Wait till you savor the bursting smoked flavours of the grilled food at Gurney House and the lavish breakfast! The best restaurant in Nainital!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r260351078-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "Wow - this was Jim Corbetts house ", "review": "Being a big fan of Jim Corbett and his work, I jumped at the opportunity of visiting his home where he grew up. This is situated in the hills of nainital and is very close to Emily cottage. Taxis will take you there from the mall road for inr 200. The Dalmias who are the current owners of the house have tried to preserve it as well as they can. All his stuff including the bed, couch, chair, some photos, are all kept here as is though the place needs some more maintenance. The gates to the property are usually locked and you have to go through the side entrance. The care takers will ensure you get to see the house and don't rush you around. This place takes you back in time and you can imagine how this would be 100 years back. Must visit and take in the bygone era. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r269951752-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 2.0, "title": "Absolutely Nothing", "review": "We went to the place which was marked Gurney house. All we saw  was an weathered abandoned house and another place which was very well maintained(looked like a private property). We waited there for over 10 mins and tried to call out and rang bell and no one showed up. It was well landscaped and tables and chairs on the outside. Not sure what I was supposed to make of that, if only there was someone around. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r281521753-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Legendary place", "review": "Want to see how the legendary Jim Corbett lived during his stay in winters of Nainital, isit Gurney house. Winter home of Sir Jim Corbett, the legendary hunnter and one of the noblest Englishman to have lived in India. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r159154507-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "In memory of Jim Corbett", "review": "Visited Gurney House in September'2015. The main building with covered verandah is unchanged probably - rest all has been refurbished and furnitures replaced. However, it is still very nostalgic for corbett lovers as one can recall many small incidents described in his writing related to this house.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r317312722-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Best place to visit for Jim Corbett Fans", "review": "Owner of the house has maintained everything there better than any museum. One can learn about Jim Corbett's lifestyle after visiting this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r165145984-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 5.0, "title": "Heritage well preserved", "review": "This is the house where Mr.Jim Corbett was born and stayed for most of his life before he was forced to leave India in 1947. The house is now a private property but the owners have kept the original memorabilia intact. Even the original structure has not changed and the house still stands on those 150 year old logs as pillars. Mrs.Dalmia, the owner, was the perfect host. She took us around the whole house and also explained the complete history. This house was purchased by his paternal grandfather from Mr.Corbett.", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r212285560-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}, {"point_of_interest": "Gurney House", "rating": 4.0, "title": "The House of Corbett", "review": "brings back many nostalgic memories for avid readers of corbett , you can still see the trophies he collected , old pictures and almost imagine corbett , his sister maggie and loya robin roaming around , the house belongs to a private owner , so seek permission before going", "url": "https://www.tripadvisor.in/ShowUserReviews-g660548-d4088726-r195412327-Gurney_House-Nainital_Nainital_District_Uttarakhand.html"}]