[{"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "Death by Antiques", "review": "a.k.a. Alibaba Cave, our guide named it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r326429474-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "More antiques than you can imagine", "review": "This is the only shop I went to in Jaisalmer. It is amazing. My sister and I spent hours in here drinking tea, listening to stories and just absolutely delighting in every inch of this place. I have a great respect for anyone that can organize and beautifully display as much stuff as they have. They have EVERYTHING. Button, paper matchboxes, chess sets, locks, brass statues, toys..it is endless. At one point I told him I collected buttons. Next thing I knew I was looking at his collection of 20,000 buttons!! I purchased some things that have yet to arrive. He called me the other day to let me know why they were delayed. Hoping they arrive soon! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r346421934-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "It's like a Art Musium.", "review": "I like very much this place. It's a pride of jaisalmer & art lover's. All goods nicely decorated on right place. They explain well about items.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r439169421-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "An extraordinary place to visit!!", "review": "Anyone visiting Jaisalmer must visit Basant to experience extraordinary collections of very high quality handicrafts gathered over 3 generations. Walking into the shop is only the start. The is room after room of carving, metal pieces, decorative boxes, old toys, figurines and so much more. Something for everyone & we enjoyed buying several wonderful pieces with the ease of having them shipped directly home. Can't wait to enjoy our little pieces of Rajastan in our home in Sydney. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r445475036-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "Ganesh and Laxmi", "review": "Good art emporium situated in the mediaeval narrow lanes surrounding Jaisalmer fort, Manak Chowk and Diwan Nathmal Ki Haveli where we bought our carved camel bone Ghanesh and Laxmi to help us over hurdles and towards prosperity.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r455940047-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "Great antique collection!!", "review": "We spend a couple of hours wandering around this gallery before we made up our mind and bought some beautiful antique items. They arranged sending these items to The Netherlands perfectly. All was delivered in a strong wooden box within a week.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r550837017-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "Good Collection", "review": "This art emporium has good collection of very old things, stuffs and any one who like old stuffs, must visit such places.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r629795111-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "The best antique shop in India!!!", "review": "The best antique shop in India. The best antique objects we have seen. It is a real Ali Baba house! Great value for money. Great hospitality. We spent a lot of money but we will certainly come back. To be strongly recommend. If you come to Jaisalmer you must visit this place!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r476651661-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 4.0, "title": "Good Shop for Antique Lovers", "review": "Basant Art Emporium is perhaps one of the best places one can go to buy genuine artifacts of Rajasthan. The collection here is actually quiet diverse ranging from small brass door handles to stuff carved from camel bones. Definitely a must visit shop in Jaisalmer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r631815251-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 4.0, "title": "For Art Lovers", "review": "This place- Basant Art Emporium is a must visit for all art lovers and has a nice collection of antique items for buying", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r654424879-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 5.0, "title": "The best antique shop ever.", "review": "This is situated in jaisalmer near geeta ashram opposite hotel gangour jaisalmer u can get real antique....", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r210370892-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Basant Art Emporium", "rating": 4.0, "title": "Off the tourist route", "review": "There's little chance of you stumbling across this place. It's down a normal looking street away from the action and I was taken there by my guide whom I'd instructed, under no circumstances, to take me to any shops. It sells itself as more of a museum and the owners explained that they spend 6 months each year trolling Rajasthan's villages on camels obtaining their collection. They did indeed have collectable items and most of their stuff appeared antique. I purchased a brass door handle, Ganesh's head with the trunk as handle. I don't particularly care whether or not it's antique, it's lovely. If you're looking for a different type of shop, crammed full with curios, here it is.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d3701736-r251290391-Basant_Art_Emporium-Jaisalmer_Jaisalmer_District_Rajasthan.html"}]