[{"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "An Abandoned Fort", "review": "The Khaba Fort can be visited on ones way to Sam Sand Dunes. The fort is less frequented by tourists and hence when we went there we found ourselves with only a few other tourists. The fort itself is very small and much of it ruined. However one gets some good views from inside the fort of the surrounding barren landscape. A must visit place for those who like the off beaten track places.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r631816602-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Khaba Fort", "review": "Khaba Fort is another small fort in Jaisalmer. not much crowd were there. so if you want to skip then skip this place. photogenic place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r636255813-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Its one of a kind place", "review": "My first recommendation for people visiting this place is that please drive yourself to here, rentals are available in jaisalmer and it is one hell of a drive to reach khaba. The fort is quite small and ruined but the views are spectacular and the best part is there are almost never too many people here. just sitting on the ramparts of the fort and basking in the beautiful thar views can make the traveller inside us feel satisfied.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r634603335-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Well restored. Great view of Abandon village too", "review": "Khaba fort is well restored and gives you a good aerial view of the abandoned Khuldhara village as well.. Two in one benefits of visiting this place... ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r642751977-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Worth spending 15-20 min", "review": "Abandoned fort.  Amazed to see pack of peacocks and doves in front of the fort.  The security feeds them daily.  Can get a view of kuldhara village too.  It's also situated in an abandant place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r647902157-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Where did they go?", "review": "A lovely place to wander among the ruins, very quiet. We heard the entire village just disappeared one night rather than have one of their women taken as bride to a local official. Courageous people.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r652657005-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "The secluded fort.", "review": "We reached the fort around 5 pm and the front of the fort was totally bathed in the setting sun. No human around the fort but around 50 something peacocks and peahens and pigeons. What a marvellous sight. We parked about 200 meters from the fort so as not to frighten the birds. I took my camera and slowly moved forward and the birds gave me some fantastic shots. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r660651978-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "Not worth it", "review": "There is nothing much here and rarely people visit this fort. It's on the way to Sand dunes and Kuldhara. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r651197046-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "Very small fort. Nothing to see", "review": "Very small fort near sam. Nothing to see. hardly 3 to 4 rooms are in that fort. Locals manage the tourists. No shops, nothing", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r660670130-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Fort is so so, but the view is awesome.", "review": "I did not see anything special about the fort. But it offers a grand view of the village downhill, most of which was abandoned.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r549138544-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Nice Place to visit", "review": "Khaba Fort visit was nice , there is deserted village also on the foothill . Conservation work is going on this place. You will see many peacocks here , visit this place when on the way to Sam sand dunes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r550006627-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "A Forgotten Fort", "review": "The ancient fort of Khaba dates back to the 13th century set amid a barren desert village was once populated by the Paliwal Bhramins. This fort was once an important part of Kuldhara administration and was the first point of entry for the traders who came from the Middle East and China.   Today, most part of the fort is in ruin and abandoned. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r661305138-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Ruin of Khabha", "review": "The small kingdom of Khabha has also a small fort along with the ruined Khabha Village. The fort is under maintenance this time, but the very unique part about this is, it has a small museum that contains ancient time pots which were made of some desert stones and the soil. Apart from this there are some stories written and other kind of stuffs will remind you the era of that kingdom. The king of this village was very voluptuous and that caused the ruination of the kingdom.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r547855226-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Nothing great", "review": "Its a very small run down fort on way to Sam village.It was used as a picnic or halt place by king.From the backside you can see ruined and abandoned houses like kuldhara.Can be missed if you are short of time.Or it just takes 15 mins to have an entire look", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r564230369-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "Nothing much to see", "review": "One can skip going there, they have archeological stones whose descriptions are faded now. It's ill maintained. It was a part of our package from Damodar camp but can be skipped for sure.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r554112018-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "just an abandoned not worth a visit", "review": "I do not know why do they charge , though they charge very less, noting great about this place, just a very tiny fort, with few antique things , rocks and some wooden statues here and there, Nothing else.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r551196403-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Peaceful historical place ", "review": "I have visited Jaisalmer several times but had never gone to Khaba Fort. Am thankful to have visited with my 11 year old daughter. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r569413224-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Trading outpost at ancient silk route", "review": "Khaba Fort, which was used to be the trading outpost fortification on the ancient silk route, is located on the link road from Sam sand dunes main road. The approach towards this fort on the link road is very quiet and picturesque. I would recommend to go here during early morning hours, as it will give you the chance to peacock sightseeing, many of whom resides in near the fort, but leaves early morning as peoples start coming in. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r578186813-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "It's not always the destination but sometimes the journey", "review": "OK so the fort is small and in disrepair. But let your imagination run wild in the peace and quiet of this remote desert outpost, gaze across to the abandoned village of Khaba and imagine how it once was.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r569672543-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Not quiet a fort, still under construction", "review": "Its an abandoned place, and you hardly see any people. May be worth a visit once the for tgets completely constructed", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r403076608-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Great views and nice photo ops", "review": "Its literally in the middle of nowhere.  The views are great.  The abandoned village below it lends an air of eerieness to the place which is great.  There really isn't much to see inside in terms of a fort, its mostly the outside shell with a few random items in relatively poor conditions strewn around. The views are great and do walk through the ruins of the abandoned village below. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r604548912-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Interesting historic ruin in magical spot", "review": "This ancient fort is off the beaten track, but worth the trouble to find.  Its perched on top of a hill, above a village that is mostly in ruins with goats wandering through it.  There are rooms with artifacts in them and a beautiful view of the surrounding area.  The village below has a sense of mystery about it- try to go at sunset to take photos of the ruins.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r430724036-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Small fort- pleasant drive but the fort itself is in shambles", "review": "This is an old fort just off the Jaisalmer-Sam road- the drive is nice as you see some small dunes on your way. There is an abandoned/ruined village in front of the fort with a well preserved temple- kind of eerie. This is one of the 84 odd villages that were abandoned like Kuldhara. As for the fort, it seems like the ASI is restoring it but they are not doing such a great job. Instead of just restoration, they seem to be reconstructing the whole place- so much so that it looks like a new fort being built! There are lot of old artefacts inside which have just been placed in the open and randomly. There are some old faded posters in Hindi explaining the geological history of Jaisalmer but these were so faded that it was tough to read anything.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r438705999-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Khaba Fort and village are my one of the Most Favorites Places around Jaisalmer", "review": "I love being at Khaba onboard TAURUS and it is an amazing experience because it offered me and my family to stay for two nights and that offers lovely village experience at dusk and dawn. We had lovely tea session in the morning and it was soul stirring experience sipping tea with my fav cookies while witnessing the Sun rising against the smoke spiraling from some rooftops. Life in Village starts early with domestic animals going out for grazing. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r454031221-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Its ok ok", "review": "Khaba fort which is around 18 km from Kuldhara.It doesnt look like a fort and entry ticket is 10 rs per person.The fort houses the geological museum which exhibits fossils.It shares the same legend as Kuldhara and is supposedly one of those 84 villages that were abandoned in one night and remain deserted till now.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r470204755-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "very good place at remote....", "review": "It is very good place to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r467718444-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 1.0, "title": "Not worth Visit", "review": "We reached there quite late and it was already closed. But people could enter from back gate. There is nothing much to see.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r487199709-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Small but historical place.Neat clean", "review": "A slice of History .A cute fort. This is a very calm place and away from civilisation. History is evident here.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r434951356-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Good place to visit !! ", "review": "This is a nice place to visit if you have interest in history. In this fort you will get a strange information about Rajasthan.. which says that in ancient time here was a big sea and you can see proof in this fort. Will recommend. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r470554950-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Small Stopover", "review": "Fort is very small & ruined, hardly can be called fort, but it is being rebuilt by Gov of Rajasthan for tourism purpose. Road to Fort is good, one can see beautiful peacocks on the way. View from fort is good,one can see the ruined homes made of sandstone, there are steps downward from fort which goes to Khaba village. Inside the fort there are some fossil remains. It is 18 km from Kuldhara, so while going to Sam Sand Dunes, one can take a small stopover at Khaba.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r502179898-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "khaba fort", "review": "way too interior and then on top of hill is this deserted fort with little or no visitors..worth a miss.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r328621329-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "On the way to kuldhara", "review": "Nothing much to do or see but here are awesome views from this small fort kind of building. Might take a visit while on your way to kuldhara and safari.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r330431412-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "A Place Worth a Visit", "review": "A small fort which was once inhabited by the Paliwal Brahmins, was deserted by them for reasons not explained anywhere. There are no guides available, however, the Tourism department have placed a number of charts, the ink on which is fading, about the history of Jaislmer which make interesting reading. Worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r330652929-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Mirage @ Jaisalmer", "review": "I wonder when I see a fort like Khaba in an isolated place. Wherever you look you'll see golden yellow field & no population around. And on top of it if you see a fort like Khaba & you'll be surprised and will force you to think if it really existed in those days. And you'll reach in your dreams. Amazing location for photography. Quiet close to Kuldhara", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r334358180-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Abandoned Fort", "review": "Visited for about 15-20 min. abandoned fort, however there are some boards with the story written on them. Worth a quick stop on your way to the dunes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r334609591-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Khaba fort - Average place, decent view of the plains from the fort", "review": "Not much of an attraction. Offers a decent view of the plains below. The fort is pretty much in ruins without much maintenance. Not too grand as well.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r335324075-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Surreal, basic yet so beautiful", "review": "Ruins around the fort are amazing to walk through. One gets such an empty feeling which could be strange for some. For us, it was such a beautiful sight that we didn't want to leave had it not been for the rowdy locals. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r337155281-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Not quite a fort, but its quite an eerie place", "review": "Visit: December 2015", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r341434308-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 1.0, "title": "Certainly not a fort.", "review": "Guided by locals we visited this so called fort. Can be skipped, nothing interesting. Its a waste of time.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r337758377-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "The ancient fort", "review": "This fort situated in Khaba village near to 35 km away from Jaisalmer. Its also contain one museum also. This place fill up with Peacocks, half dessert place is not forgot to visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r343450836-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Khaba Fort", "review": "nothing much here apart from some old structure of fort and village view down...yes some photo shoots can be done...this is actually covered en route to ur desert camp..if ur taking one", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r259695761-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "sunrise point", "review": "This fort is known for beautiful sunrise.. the fort structure seems newly constructed and is not kept well. the beauty of this place lies in the many peacocks that come up during sunrise.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r265221841-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Nice fort with Peacocks romaing", "review": "Was a very nice fort overlooking the ruins of a village like Kuldhara. Very nice place. youll need to go on a safari to access this, this is quite far from city. We went along with the Pleasant Haveli safari", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r311594282-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "never seen so many peacocks at 1 place before", "review": "its a nice place for a quick visit... from top we get a good view of the entire village... abandoned and in ruins now... and there are sooo many peacocks all around... its beautiful!!! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r259894521-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "Nothing extraordinary", "review": "It is a waste of driving time when there are so many better things to do and visit in and around Jaisalmer. This \"so called\" fort is poorly maintained and seems like some \"not so ancient\" artifacts have been put up on display... the only thing ancient is the dust accumulated on these items. There is no real history to the abandoned village, which is claimed to be over 400 years old (which is not thaaat old for Rajasthan standards); and it has a pretty modern looking Shiv temple (built probably a decade ago) in the middle of it. Don't waste your time... go visit the India - Pakistan border instead - That has some great history !!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r261259736-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Feel the feeling of being solitary...", "review": "With a deafening calm, one can experience the solitude here...Abandoned houses and villages, seen from from the top of the fort can surely make you wonder about the past of this place. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r316004403-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Breathtaking Panoramic Views", "review": "Not to be fooled by the name, Khaba Fort is actually pretty small to be even considered a real fort. Maybe a Garrison will be apt. The reason why I visited was the fact that it is considered to be Haunted. There is basically nothing much to do within the fort. The only positive and it makes up for the other negatives is that it offers a good panoramic view of the Thar & also at the Fort's foot is an abandoned village desolate & lifeless similar to Kuldhara. Excellent for Shutterbugs though.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r323937476-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Small fort with an abondand village.", "review": "Khaba fort is very beautiful fort and around khaba fort you can see empty village like kuldhara.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r314745803-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "beautiful views", "review": "hope govt puts up some resources and make this a good tourist attraction. Currently, the pictures and sculptures are left in open to read, they should do something to preserve and present better. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r319255685-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Nice View from the Roof Top", "review": "Fort is on way to Sam Sand Dunes, the best thing about the fort was the view from the roof top to below - deserted land especially the ruins of one of the villages similar to Kuldhara. and Second Best thing is the view of the Fort from the below from Ruins.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r244818230-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Lots and lots of peacocks ", "review": "Nothing much to do but go there early morning if u want to see hundreds of peacocks together. There is a young boy, may be caretaker of the music would bring food and make special sound to call the peacocks. Its amazing to see how the birds respond to his voice. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r325079287-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Surprised to find Peacocks", "review": "This fort is close to Sam dunes. Though this fort is small fort you should not miss it for one reasons. Peacocks. We had not know this an we just took a chnace on our way from Kuldhara village. We are surprised to find around 30 to 40 peacock around the fort. They even enter this fort. Would recommend it.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r237276647-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Breathtaking sunrise", "review": "While the sunset at dunes is beautiful, the sunrise is equally stunning. Most people miss out on it in their itinerary. The fort is run down and small, overlooking the country side and Kuldhara abandoned village. We left from Damodar desert camp, where we were staying at 5.00am to watch the sunrise. And we were not disappointed. We have watched sunrise in hills, and on the beach. But desert sunrise is something else! A must have experience!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r207441941-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "A different landscape, terribly peaceful place", "review": "This was a terribly peaceful place and the abandoned village was looking a bit scary, but it presented a good scope of landscape photography as it was a different place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r247521814-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "a living memery", "review": "This was my favourite Fort. as it is still being lived in by a thriving community.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r252694214-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Best Location", "review": "Been there  is  best  fort  small  but   very good   view  and we can see  lot  history there !!  we  been there  few time  still we  love  it  on way  u can see  lot  things  kuldhara  village  and Amar   sager  village  too", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r253290152-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "a abandon fort without maintainance", "review": "A beautiful little fort with beautiful view. you can enjoy the ride to fort with desert national park and play with peacock .", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r252057702-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Nice spot", "review": "We liked the way it is and the kids had s good time. Some history behind it but we basically enjoyed the structure. This was enroute to our desert camp else we may not have gone there", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r255708684-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "desolate ruins", "review": "a good attempt at trying to maintain the ruins, the fort is reconstructed, the ruins are a reminder of a proud heritage", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r150203785-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "not worth visit", "review": "waste of time and very bad managed. The govt want to just mint money by levying the entry fees and it has nothing to watch. It looks like it is not cleaned for years", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r256279127-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Nice and calm", "review": "This place is just like Kuldhara and has the same story and also it is near Kuldhara. But unlike Kuldhara, it has a palace which is on a hillock from where you can view the full village underneath. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r256274373-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "\"Not interesting\"", "review": "there was nothing to see ......it is not giving the felling as we are visiting the fort......  it just  a simple stone structure all that it has...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r194958116-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "AverAGE", "review": "Once again a place wherein you won't find anything to enjoy and cheer!!!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r156360130-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Fort in Ruins, good views", "review": "Visit only if interested to see a fort in ruins and peacocks in their natural habitat. This is about 15 odd kms from the kuldhara village which is also now a site promoted for its ruins. There is a good view of the desert (the beginning of it) and the adjoining village which was emptied by its residents overnight owing to a Brahmin - Rajput quarrel.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r190799949-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "come for the view", "review": "this is hardly a fort as forts go.It was not meant to be either,it was originally meant to be a kind of police station cum meeting place for the maharawal when he came touring in these parts and so it has no fancy carvings, no vast galleries etc.It is a simple stone structure absolutely utilitarian in nature.all that it has are a few pictures and posters about the paliwal brahmins who inhabited the abandoned villages below.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r192455932-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Worth if you are around the area", "review": "The abandoned village across the road from this fort gives an interesting experience. This place also has a small ancient temple that gives some photo ops.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r195316973-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 3.0, "title": "Nice fort", "review": "Nice fort on the way to SAM.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r197910220-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 1.0, "title": "Only Hunted Place", "review": "It is a only hunted place.... ntng to see.... We were went in group wd total 10 boys on around 7 pm. .. We all feel something really hunted experience... request u to plz don't go alon or with family.... It was a very terrific experience of our life... We just thanx to god... For helping and save us...", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r200199533-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "beautiful fort.....", "review": "Khaba fort is very beautiful fort and around khaba fort you can see empty village like kuldhara.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r122132060-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Must visit place in Jaisalmer", "review": "Bird's eye view of an unique architecture, peacocks in natural environs, picture post card sunset and interesting story about its existence", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r138853051-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "JAISALMER FORT - VISIT FOR THE EXPERIENCE", "review": "I was disappointed.  Reading too much about the approach \"appearing in the desert\" etc.  Visit inside didn't improve my opinion much.   It seems to be a bit of a shock after lovely Merangarh Fort in Jodhpur.   It was very, crowded with the young and to be honest I didn't feel safe.    My first \"downer\" on India.Sorry!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r122184666-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "spooky", "review": "a place again like kuldhara and the same story with a village that was abandoned. a half done fort with unprotected artifacts . a stop over on way to sam dunes but a must visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r196279214-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Peacocks everywhere", "review": "The Fort is run-down and small, but the views of the countryside and the ostentation of peacocks (we saw about 40 when we were there) was truly phenomenal. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r198281660-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "small but nice", "review": "great views, not much in the fort but peaceful surroundings. i would suggest you stop by if you can but dont make an effort just for this.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r145297068-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Excellent", "review": "entrance of fort and location of Fort, it is easily reachable by transport. Guide service also available in this fort", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r141393318-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "Not to miss when you travel to Sam", "review": "Khaba is a village close to Jaisalmer, more than half of which is completely ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r146855468-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 2.0, "title": "Visit on if you have spare time", "review": "Nothing much to see here. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r149723508-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Small fort with an abondand village of paliwal", "review": "15 km from from Kuldhara village. A must see if you are interested in paliwals and abandoned villages. ruins of villages. no guide support", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r148831090-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 5.0, "title": "peacocks", "review": "a good detour on the way, i liked this compact fort with its ladders and the view of the (astonishingly) green fields below. Also, we spotted so many peacocks, it really made our day. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r147773545-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Khaba Fort", "rating": 4.0, "title": "Khaba Fort ...Story of Paliwal Brahmin Girl", "review": "Its really superb. Normally you will not find in standard itinerary.It is a ancient cursed village of Paliwal Brahmins which they left about 250 years back. Since then this place is totally ruined and not a single family have lived here since then.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d2432390-r148812983-Khaba_Fort-Jaisalmer_Jaisalmer_District_Rajasthan.html"}]