[{"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Very genuine artist with a beautiful gallery ", "review": "I stumbled into this little art gallery and was pleasantly surprised. Mahesh was very humble and genuinely willing to show me his work. Definitely worth picking up some of his art which is very different to the rest of the mass produced items you find in the fort. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r455528070-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Great gallery, genuine guy", "review": "We met Manish, the proprietor of Sonee Art Gallery late one night when wandering round Jaisalmer Fort looking for a hotel after leaving the one we had booked in disgust. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r456321294-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Excellent art galery", "review": "Visited on my March trip.Various  choices. Different  styles. Beutifull  pices. Best galery in Jaisalmer. Must visit. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r468229213-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Sonee Gallery", "review": "Came upon the gallery by accident while strolling through the fort and started chatting to the owner. He was very passionate about his work and he was kind enough to offer us some delicious chai his mother next door had made while we chatted, which was lovely. Really enjoyed the images he had painted over India post cards from the 1950's, a few of which we picked up.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r502839945-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Beautiful Art Shop in Jaiselmer", "review": "Not only is the art incredible, but Manish is gracious host. We learned about his techniques and also learned about the artist, his family, and Indian culture. Even if you don’t buy, stop by and speak with this engaging, friendly and talented man.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r561284214-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Original handcrafts", "review": "This family handcraft shop offers original paintings on silk and postal cards... wonderful decoration and souvenir to bring back at home ! We love it", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r533311284-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Honest kind skilful artist", "review": "We spent a few time looking for drawings and craft items. The space is nice and Manish is generous and helpful. We compared his products and prices and he was really the best. He explained us essential elements of art of drawing and invites us to a excellent tea. No pressure for buying. Very nice experience. He has an original taste. Bravo!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r565383365-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Great Work", "review": "Art gallery has much collection and how they have made, it really amaze us. it really needs hard work and artists have really done a wonderful job.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r629796901-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 4.0, "title": "Interesting Art Gallery", "review": "Sonee Art Gallery is located inside the Jaisalmer Fort and one of the few art galleries where one can just look around without being pressurized into buying some thing. The paintings made by the owner are quiet good and reflect the desert lifestyle of the common people in and around Jaisalmer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r631133053-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 4.0, "title": "Sonee Art Gallery", "review": "Sonee Art Gallery is located in Jaisalmer Fort. collection of art is nice. it shows the hard work of artist. such a amazing arts are available there.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r635987949-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Sonee Art Gallery - An Artist with true passion - a must if you visit Jaisalmer", "review": "Sonee Art Gallery must not be missed. Ask any local and they will take you to meet Manish who runs the art gallery. Manish has the traditional art miniatures that are predominantly painted by his father, but the talent lies in Manish's hands. He seems to have a way of capturing the beauty of the people that live and surround Jaisalmer with vibrant colours in his art work. He uses oil, acrylics and water paints and with each paint delivering a different type of beauty. We finally bought a piece from Manish and currently saving our dollars for Manish to paint something else that will remind us of the wonderful trip we had to Jaisalmer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r348319895-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 4.0, "title": "visit the gallery", "review": "great artists. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r349972563-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Definitely worth a visit!", "review": "There are plenty of stalls selling various products around the old fort in Jaisalmer which are all nice enough. Sonnee Art gallery however stopped us and required a closer inspection. Truly beautiful artworks in a variety of styles. We met Manish who was so so nice and just wanted to talk about the art that he was so passionate about. I've had other experiences in different shops where there's so much pressure to by something you can't really take the time to enjoy. Manish wasn't like others. His mother made us 'the best chai in the world'.. and that it most certainly was! It was nice to sit down and share stories and talk all things art related! Definitely going to try and get some lessons in the shop next time we're back in town and have a bit more time! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r362258458-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Nice surprise!", "review": "Although we went in to this art gallery to just change American money (no exchange fee!!) we were delighted to see such beautiful diverse images of India. Wonderful conversation and Chai tea with the artist, with absolutely no pressure to buy, although his works were so beautiful we wished we could have bought them all!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r360239090-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Fantastic gallery with some great art", "review": "This is a wonderful display of traditional and modern painting. The work is very skill full and his family are very talented artists. Mannish really captures the spirit of desert life in his paintings. He was so welcoming and very helpful. A really lovely way to spend an hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r375693791-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Wonderfull acrylic artwork. I was lucky enough to get meet Mr. mahesh who showed me this very nice gallery.", "review": "Great paintings, the big ones are painted with amazing details. You also have typical rajhastan paintings that are exquisite. The paintings are from Mr. Mahesh and his brother Manish. I defenitly advise this place, besides the wonderfull artwork you will have the oportunity to meet one of the nicest people in jaisalmer that can give you a honest insight.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r399804874-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Legit", "review": "Manesh who runs the shop is a cool dude. His mom makes the best chai in Jaisalmer, and is just around the shop. Ask for it! So I bought 3 works here (like the other reviewer) and I'm very happy about them. It's a good place to stock up or start on your art collection since the prices are reasonable and the vibes are good. Definitely a favorite spot here in Jaisalmer. Stopped by twice.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r408151469-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Nice person ", "review": "I really nice owner that has a shop and is also the owner of the art gallery,  he makes paintings by himself.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r432190963-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "So Friendly So Talented", "review": "I was visiting the fort in Jaisalmer with my sister and stumbled across this shop. It is amazing and Kamal is so very talented! He even sat with us and explained his work process while we drank his wife's famous Masala Chai Tea!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r428605757-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "Sonee Art Gallery", "rating": 5.0, "title": "Excellent Gallery!!", "review": "This gallery caught my eye while wandering around the fort in Jaisalmer and I'm glad I stopped in! They feature some very unique pieces from local artists around Rajasthan and I decided on an oil portrait of Maharajah Takhat Singh which I absolutely love. Manish owns the gallery and is a wonderful guy, he even invited my girlfriend and I to stay a bit and have a chat and a chai with him. Thanks for everything and I can't wait to frame and display the painting!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d9792499-r446871004-Sonee_Art_Gallery-Jaisalmer_Jaisalmer_District_Rajasthan.html"}]