[{"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Insight into life in the Thar", "review": "I liked this petite privately run museum. The charge is quite nominal and it was touching to see the lovingly preserved artifacts along with a guided tour. Vastly better than the dusty run-down government museums which litter the landscape.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r640489886-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Definitely worth a visit", "review": "This is a very interesting museum, small but full of information and run by a lovely man and his very dedicated helper. They both show passion for the collection on display, that is contagious. The fact that you are being given a private tour is fantastic so you get to understand the use of some of the artefacts you may have seen before but never knew what they were. The private tour also allows for questions. Great experience, highly recommend. If the museum is closed, just send a text to the phone number written outside, they will answer and tell you when to come.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r646365454-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Sweet, well set out museum", "review": "This is a small but lovingly assembled collection of artefacts from the local culture. The owner is an anthropologist who is very knowledgeable and helpful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r644457046-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Private tour", "review": "This is a small and quiet museum out of the town centre. There’s a truly brilliant collection of local folk art and history. We were told this is the history of the common people rather than the Maharajahs. Knowledgable guide with good English skills and an obvious passion for his local culture. Don’t miss this while in Jaisalmer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r646711308-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Very nice place", "review": "The museum is small but packed with interesting things about the local culture . Make sure to take the guided tour with laxmi. He has a lot of knowledge and speaks good english.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r653400478-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Great Jaisalmer Museum", "review": "This Jaisalmer Meuseum is a real gem, providing an insight into the culture and social customs of the people who live in and around Jaisalmer - putting it all into perspective which can otherwise be lost. Highly recommended, especially with Laxmi the local historian bringing each exhibit to life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661318973-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Small but interesting collection", "review": "A very interesting museum. It’s very small in size but rich in information. The owner/collector is very passionate and explained everything with enthusiasm. If you have some time on your hands in Jaisalmer it’s worthwile to visit to get to know more about the Thar culture. It’s only 100 rupees entrance fee.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r656907792-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Good private museum", "review": "It's not a very big, grand, or royal museum, generally like others you see in Rajasthan, rather it's a simple private museum, very well maintained and showcasing the simple, local things of people from different sects of society, that's what I liked the most.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r654016427-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Fabulous!", "review": "This small but fabulous museum is a treasure trove of artefacts and information, and is perfect for putting the rest of Jaisalmer into context. What makes this museum most special, though, is the commentary provided by Laxmi, the museums extremely knowledgable owner and curator. Well worth a visit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661319968-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Extra Special", "review": "We were exploring the local market and saw a sign directing us to the Thar Heritage Museum. Feeling curious, we went inside and a young man telephoned the owner. Laxmi arrived and gave us a sensational tour of the museum which was his own private collection of interesting artefacts and stories. We chatted to him for hours and then went back to his shop and bought some gorgeous textiles and even had some custom made tea towels made right there in the shop. It was certainly a highlight of out visit to Jaisalmer. Highly recommend.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r567591218-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Preserving the rich culture of Jaisalmer", "review": "Mr Khatri is doing a fine and commendable job. Not just the museum but the way he explains everything in such detail wants you to keep listening to him....its a one man’s show and he is taking so much pain...hats off ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r570056560-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Nice prep for camel safari", "review": "This museum is a gem... Mr. Laxmi will wall you around the space for 20-30 minutes explaining the collection of artifacts, pictures, and fossils from the Thar for 100 rupees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661750541-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Best way to learn Jaisalmer History and Culture", "review": "LN Khatri is the most hospitable and knowledgable person about Jaisalmer that I have met in this city. This museum started out as a hobby of his and now it is home to thousands of Jaisalmer artifacts from centuries old tools and cookware to fossils dating back millions of years. PhD students and researchers have done extensive work with some of these pieces to give a sense of how relevant they are to the culture and herritage of Rajasthan. The best part is that Mr. Khatri brings these pieces to life with his detailed explanations and stories. Make sure to ask lots of questions from religious figures to the geological past as he is a fabulous resource, not to mention a warm and welcoming host. As I visited in the hot summer he even lugged an electric fan from section to section of the three room museum to keep us cool. This museum has been awarded prizes from the Rajasthani and Indian government. Easily worth the donation of Rs. 40-100. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r588379728-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Rich personal collection of Jaisalmer curios", "review": "Tucked away at a small corner inside the market, The Thar Heritage Muesum holds a large and varied collection of antiques. The items are varied from fossils to daily use objects. The best part is  one not only gets to see these but Mr. Khatri explains in depth about each item.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r592930113-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Nice little museum", "review": "We enjoyed the little museum very much. One could see that the founder of the museum was very fond of his piece of cultural items he had collected over the years, which he presented and explained to us in a private tour that lasted approx 15 minutes . His initiative of founding a museum on his own is impressive and based on genuine passion for the culture of jaisalmer. At the end of the tour he didn't push at all for making donations, you could see that he was managing the museum for the sake of preserving the local culture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r624355488-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Must visit!! ", "review": "A must visit for every tourist in jaisalmer. Super interesting collection and we got a personal tour from the founder’s son which was amazing - we learnt so much about the history and also were able to ask him questions about basically anything. 11/10 would recommend ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r618550920-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Great little museum", "review": "The proprietor is enthusiastic and knowledgeable. Some great exhibits and well worth a visit. My tip is to take photos of the description placards to read later.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r629760243-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "The Thar Heritage Museum", "review": "The Thar Heritage Museum, this is not a big museum like other museums in jaisalmer. but the collection was very old. pleasure to see this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r635986574-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Knowledgeable", "review": "Museum has great knowledgeable details and people can gather more and more. Very old stuffs placed so people can learn more.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r629798176-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "You wont be disappointed!", "review": "This is a private museum, which exhibits the collections of its owner, Khatri. His son gave a nice tour of the museum. The exhibits include wide range of items from fossils to items used for daily purpose. You may find many of these items in the havelis and fort. However there were some items which were unique. You can see some boards with informative descriptions as well. Overall it was a good experience. There is no ticket as such. They accepts donations to run the museum.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r639219262-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "A day well spent indoors", "review": "It s located in the market of the main city. Laxmi Narayan Khatri founded this museum, which houses sea fossils, ornaments from the ship of the desert and horses. Antique coins, documents regarding the history of Jaisalmer, ancient weapons and manuscripts offer a glimpse of the origins to such a fascinating city.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r490333729-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 2.0, "title": "More expensive", "review": "Price of entrance is now 100 rupees so more than double the entry fee a few months ago, although the museum is the same and very small but still interesting ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r536336042-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Excellent, small private collection", "review": "Excellent, small and authentic museum on life in the Thar desert run by a local shopkeeper, who has studied and is an author in local history. Exhibits I have not seen in other museums. Well worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r538445838-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "interesting museum", "review": "The heritage museum was quaint and full of interesting relics and stories of the local history. You can really sense the effort that mr. Khatri put in and the passion he has for anthropology. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r543510067-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "Cute puppet show", "review": "The puppet show had recorded music and was enjoyable, but the explanations of the exhibits were in broken English and were difficult to read.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r549112504-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "I love it", "review": "This is private museum. The owner collected all of things in the museum by himself. And the owner is really good for the explanation because he can speak English well and he is so smart. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r560741844-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "nice little private collection", "review": "This is a cute collection of artifacts and objects that common people of the Thar desert area use/have used in the past, Th owned is very knowledgeable and can explain the meaning and usage of the objects and answer any questions you may have,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r565569746-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Hidden gem of local culture", "review": "The Thar Heritage Museum is a little gem waiting to be discovered by the curious. It is owner Laxmi’s private collection of desert artefacts, photos and historical scriptures. The guided tour is given by Laxmi himself and being the connoiseur and collector he is, you truly get an encyclopedic experience. Very interesting and highly enjoyable! Also, be sure not to miss out on his Desert Handicraft shop just around the corner.. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r562839904-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Tick tane place", "review": "Museum have so many historical contents and it could be a good option in city while you are waiting hours for buses or trains . Good museum as all over others cities.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r557844649-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Lovely", "review": "This place is very interesting. A unique place which is not very commercial and hence easy to miss. I recommend you step in briefly to see this and you can also talk to the manager who is very friendly and a genuine soul. A little gem of a place which you can see peacefully on your way to the Fort.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r336325132-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "lovely", "review": "the musuem was right next to hotel moomal. worth a visit. lovely exhibits of wood and animal fossil and carvings and stone excavations from various eras. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r336930262-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "Jaisalmer's History!", "review": "While you are walking through the narrow streets of the main market of Jaisalmer, you can find a banner of \"Thar heritage Museum\". It's not a big place, neither any directions which can lead you there, but visit to this place is not wasted, as you can see collections of some cool things, which were used few decades ago in this and nearby regions. Their handicraft shop is good, and we liked the collection too.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r565663699-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "small but living museum", "review": "the museum is a private museum owned by a local uncle and the exhibits were all his personal collection out of his own study and interest. if you are lucky enough to encounter the owner, he will explain and show you around the museum. A really interesting spot hidden in the residential area of Jaisalmer!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r350450013-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "Private museum of desert lifestyle and culture", "review": "This is the private collection of artefacts related to Jaisalmer and the desert lifestyle and culture. The place is small and rather worn down but understandable, considering this is a passionate individual's effort to preserve the local culture. There were no other visitors so I had a personal guided tour. Very informative and interesting. If there is nobody at the entrance, just look for the owner's stall five stalls on the left on the main road. Or just the neighbor running the cybercafe.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r442591359-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Owner gives you detailed tour", "review": "Much better than other museums as the owner is on hand to give you a detailed explanation of all the items. The owner is very knowledgeable and friendly, he also speaks excellent English. The museum is small but it's still well worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r438286981-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Shouldn´t miss!", "review": "We enjoyed to see the great private selection that explain former life in the desert. The owner explained everything full of dedication. That made our stay to a very special experience. Go to see that small, special museum! You will not regret it!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r382148105-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "A small place with Good exhibits", "review": "A very friendly employee showed us around. The ambience is very shoddy. A single collectors exhibition.worth a visit.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r434951222-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 1.0, "title": "Another tourist trap!", "review": "This is a shop with few supposedly authentic old items, you don't get a real printed ticket or receipt but they charge whatever they want. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r456122924-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Small and interesting", "review": "The museum is a private collection of the owner about desert culture. It is small but very interesting. The owner gives you details and he speaks excellent English.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r458887865-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Charming museum with an extensive collection", "review": "I felt like this museum gives a great taste of the real life and culture of Jaisalmer. This museum is filled with items that have all been collected by the owner, who I believe was a teacher. (And also very sweet and charming himself) ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r265110497-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Amazing", "review": "Desert have their own charm and beauty this muesum have many stuff related their local culture preserved must come it is the another place which help you to know about rajputana", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r479053481-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "A small but impressive collection", "review": "This museum shares a common wall with The Moomal Hotel where we stayed so we took a walk and entered this otherwise isolated and lonely museum. We were the only visitors!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r278710709-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "An interesting but small place", "review": "The Thar Heritage Museum was one of our tour stop ta our Rajasthan holidays. The museum has a small but nice artifacts collection. Now there aren't many artifacts or painting here as a art lover must be aspect but the ones which are here depicts history of Jaisalmer and their monarchs. I must say that the this is an interesting but small place which you must give 1/2 hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r301539835-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "Small private collection", "review": "Small collection of artefacts related toThar people. The museum is privately created and owned by a local passionate, who also guides through it. Rather nice than impressive, going through whole collection should take no more than 20 minutes.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r301129955-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Interesting glimpse...", "review": "of the history of the desert people. Ancient coins, manuscripts,", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r291047108-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "great interesting collection", "review": "The collection here is an excellent insight to the culture or the tribes . Worth a visit to soak up some history ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r329933165-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Glimpse of History", "review": "The museum is similar to any other museum we see in all the historical places. The swords, the protective gears, the Royal palace and private rooms of King and queen..The only thing different in this museum is the height of the gates..they were purposely constructed very low so taht any body who enters into the palace, must bow his head to get in. And that's all the king wanted that every body must bow his/her head in presence of king. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r314253342-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "for Antique and Art lovers ..", "review": "If you are into history, culture, antiques and artifacts, you will appreciate this place! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r318490951-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Made great by the personal touch.", "review": "I had the pleasure of being shown around this petite museum by the owner, curator himself, and quite enjoyed the fact that he brought his offsider along to help teach him the ropes, education can seem sparse in Jaisalmer and its great to see teaching in action. It's a simple museum and it pays to bear in mind that a great deal of the very historic looking basic household items are still in use in many of the nearby villages today. There is a book for sale which covers most of the content of the museum, it also covers some good basic info re the ( now banned) caste system and the different styles of dress of Jaisalmer s various people groups. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r320295451-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "An Interesting Place", "review": "The Thar Heritage Museum is very nice but it is a small museum. All the collections are so wonderful and beautiful. You gonna love it. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r334355703-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Wonderful and insightful visit", "review": "Certainly the highlight of my brief trip to Jaiselmer. The collection may be simply presented, but provides a welcome insight into the history of the ordinary people of the area - a history far detached from the splendour of the city's palaces and havelis. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r214232293-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "\"amusing place\"", "review": "the thar heritage museum is very exiting place to visit.Very interesting portraits and sculptures. i visited there with my friend and found it very great and amazing.i recommend others to visit there atleast once. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r211319283-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Best attraction in Jaisalmer!", "review": "The most informative and interesting museum that we've seen so far in all Rajesthan. We paid a small entrance fee (Rs 40 each) and were guided round by the enthusiasic and very knowledgable Mr Khatri. The museum is a large collection of artefacts and photos of thar desert life that Mr Khatri has collected throughout his life. He is very passionate about preserving it for future generations. We learnt more at this museum that at any other to date. Highly recommended ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r223093843-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "A few items of interest", "review": "This town centre museum is an interesting 30 minute visit, various artefacts from the Thar Desert with informative explanations. On two floors so access is limited for the disabled.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r224130423-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "History of rajasthan", "review": "Beautiful images and writing telling the history of Jaisalmeri people and culture.   The museum is well placed and curated in a natural simplistic way.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r247697673-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "History buffs should visit", "review": "The place is owned by L.M.Khatri, who also owns the Desert Handicraft Emporium nearby. What strikes you most about the place is the amount of time and effort that he has dedicated to preserving remnants of a way of life. He's even written a book about it! If the place is not open, you can reach him at 9414150762, or email him at thmjsm@yahoo.com. There is a website (www.tharmuseum.com) but that doesn't seem to be working.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r232078797-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "A jewel not to miss", "review": "Informative little museum--not to be missed! The curator/owner has put his enthusiasm and intelligence together to tell the story of the desert tribes. FAscinating and fun.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r239191086-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Interesting museum and owner", "review": "This museum is small and without any pretentiousness, but the visit with Laxmi the owner is very interesting. He will explain to you all the traditional things in the desert Thar, with passion and kindness. Cheap price (40 rps) and take like 1 hour.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r250323144-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Nice museum", "review": "This museum depicts cultural history of people living in Thar desert from then until now. Invaluable items with the best guide, Mr.Laxmi, the owner. Worth a visit if you want to know more about the legacy of Thar and Jaisalmer. Recommend!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r254833493-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Excellent collections.", "review": "Very good collections of rajasthani heritage.Owner himself is the person who make collection of all the things.He is very well behaved and gentle.He himself guide us about his collections.Good place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r253830405-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Charming and lively puppet show", "review": "I'm an adult, with kids, and really enjoyed the dynamic puppet show with live musical accompaniment.  you could tell the team lovingly practiced their art, making the dolls by hand.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r185707006-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Great experience at a small museum", "review": "We visited here in our recent trip to Jaisalmer in the evening. The museum was closed but we walked around to the shop owned by the same people and the son promptly closed up shop and took us to the museum. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r188033198-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Knowledgable yet simple", "review": "It is situated in the middle of a hussy market and is not big.just 2 floors,but still gives you a very deep understanding of the Rajasthani culture and history.The owner of the museum is an enthusiast who loves his tradition and history and is a keen collector of Rajasthani culture.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r188059715-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Very cool place!", "review": "This museum was close to our hotel. It's a small place, with a lot of interesting history. It was great to hear about the efforts to keep the culture alive. Also, we very much enjoyed the cultural show. I", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r191077409-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "\"Museum\"", "review": "It is not too big insight ........but with the very interesting facts ........ it was good to hear &read about......", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r194956630-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Best attraction in Jaisalmer!", "review": "The most informative and interesting museum that we've seen so far in all Rajesthan. We paid a small entrance fee (Rs 40 each) and were guided round by the enthusiasic and very knowledgable Mr Khatri. The museum is a large collection of artefacts and photos of thar desert life that Mr Khatri has collected throughout his life. He is very passionate about preserving it for future generations. We learnt more at this museum that at any other to date. Highly recommended", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r196505657-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Best value night out in Jaisalmer in every way", "review": "The traditional puppet theatre that plays here every night is a must see for any visitor to Jaisalmer.  The live musicians are quite brilliant and the puppeteers tell their beguiling and often humorous tales very skilfully without words.  After the show your can take a leisurely walk around  the museum enjoying the magnificent collection of heritage artefacts and folk arts, gathered by owner Mr M K Khatri M.The museum also sells wonderful puppets along with  books, post cards and portable story telling theatres.  The whole experiences utterly enchanting.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r197203411-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "An interesting collection", "review": "A small museum but still an interesting collection and worth a visit as you wander through Jaisalmer town. Only 1 staff member was on duty but he was friendly and helpful, but English explanations proved a little challenging.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r203674544-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 3.0, "title": "Nice Museum", "review": "I Liked museum nice things to see there i stayed most of the time there during my holiday awesome historic things kept there its just not show piece it make us things about those things it take us in past and we enjoy hmmmmmmmmmmmmmm", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r189727162-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Mr. Khadri's interesting collection", "review": "This man keeps this small collection as a labour of love . His 14 year old son was on school break and showed me the exhibits.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r210033298-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Worth a stop in Jaisalmer", "review": "As other reviewers have described, this is a quirky museum run by one very charismatic owner. I had to laugh when we had the same experience as others-- just show up to the door of the place and out of nowhere a young person will let you in and the owner follows shortly after.  Allow 30 minutes or so-- not a ton of stuff here, but fun facts nonetheless and it feels good to support this place.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r132521873-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Excellent to visit before Camel Safari", "review": "This small museum is the passion of a local amateur anthropologist and shopkeeper, Mr. Laxmi Khatri.  In addition to the museum, Mr. Khatri has written an excellent booklet on the history and culture of the Jaisalmer region.  Reading through this booklet (it is very well-written and not too long) really improved my understanding of some of the people and villages I encountered on my safari later on.  The visit to the small museum - Mr. Khatri's passion - showed some of the things that were mentioned in the book.  Unlike most museums, Mr. Khatri gives a personal tour and even took out some of these 100+ year old pieces - which he has collected over 30 years - and allowed me to handle them to get a closer view.  It is a shame that the museum doesn't receive more visitors, as it would really help people understand more about the people and the desert prior to venturing out on a camel safari.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r148131386-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Puppet Show - must watch", "review": "There are typically two shows (~30 minutes duration I beleive) every evening. The ticket price is Rs.60/ per head (don't remember the exact figure, might be off by a bit) The puppet show per se is very interesting and the owner himself is a dramatic man, giving introductions about each act of the puppet interspersed with his personal views about society and relationships !!! The entire package was very entertaining. After the show is over, you have to go around the museum, although several of the 'attractions' are kitschy posters, the entertainment quotient is very high. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r133665179-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Puppet show was fantastic", "review": "This small museum has a nightly puppet show, which was definitely worth seeing. The show is actually a set of musical numbers with live music, and puppet dancing. Before each number the narrator gives an explanation of the upcoming skit in both Hindi and English. Each number has some historical significance keeping with the Thar Heritage theme of the museum. The show is about 30 minutes and held in the central room of the museum. There's space on the floor for kids to watch. This is a small community center type feeling museum, so nothing too fancy. You can take a look around the musuem before / after the show.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r148334007-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Charming place", "review": "This is a hidden gem of Jaisalmer totally worth visiting. Loved the fact that this is one man's effort to document and preserve the culture of the region. The puppet show was so charming!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r152999177-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 2.0, "title": "dust", "review": "dust covers all the few objects in display in this badly kept museum,a pity in such a beautiful building.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r158416241-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Worthwhile", "review": "The owner makes the museum an interesting stop. Allow about 30 minutes, or more if you want the puppet show, which we didn't have time for. The owner takes you around and explains some ofthe treasures there, we found him passionate about his collections. There are some real gems there. Ths booklet that he write is worth buying, we used it to learn about the area.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r159542883-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Interesting, unique and welcoming experience", "review": "Laxmi (sorry if the spelling is wrong!) is a wonderful person who owns the museum and offers interesting and insightful tours of the museum. He knows a great deal about his city and state and shares this information with anyone who is willing to take the time to listen. His English is fantastic and it is worth having a long chat over chai. He is one of the most friendly and welcoming person I have met on my trip! ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r184438018-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Very interesting and hassle free!!!", "review": "The museum is very interesting, with a lot of old  artefacts from the area. The museum is small but you enjoy, especially that the owner of the place take the time to talk to you about all his collection and a little history of jaisalmer. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r120140539-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Hidden in plain sight", "review": "The Thar Heritage Museum is a surprisingly little visited gem in the heart of the old city of Jaisalmer. It lies in an alley off the main bazaar street, and has good and varied displays of Rajasthani folk art. The museum is the result of the enthusiastic Mr. Khatri's life-long passion for collecting anything old and interesting from antique shops and private homes. He even has a small opium den downstairs!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r184987170-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Worth visiting for the puppet shows", "review": "This is a one man effort. Everyday evening, they have puppet shows, which are quite enjoyable. The local musical instruments on display are quite knowledgable. Visitors can also buy hand made puppets directly from the artists, after the puppet show. They also have a small souvineer shop.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r120464194-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Heritage Museum", "review": "Small museum, full of nice old photographies, old music instruments, posters and other things which help you to look on Jaisalmer from other perespective. There are multimedial devices where you can see how people play on the several music instruments. In the evenings thaere are 30 min puppet performances. (I can not rate it because we did not attend due to lack of time)", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r124071424-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "a must see", "review": "city is a bit dirty but palaces and sand dunes are great.the musuem   is a must see", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r122802982-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Amazing local history and great attention to detail with personal touch.", "review": "I was very impressed with this little gem of a find hidden away in Jaisalmer. It ALWAYS open, you just have to ask the Mr. Khatri, owner of shop around corner.  Do yourself and the museum a favor and stop by, it's cheap, you will learn a lot an be impressed with the local collection.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r125221550-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Hidden Gem", "review": "We found this place while wandering along the backstreets of Jaisalmer, and found the owner to be very interesting , and  passionate about his subject.  The entrance fee is minimal, and he didn't even try to sell us loads of artifacts!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r126486027-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Thar museum.", "review": "I chanced across this small private museum while I was walking in the city. The owner came after a few minutes, and was very informative abut the items. He is very interested in the culture of the outlying villages.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r128464109-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "getting to know rajasthan culture", "review": "This small museum contains an interesting collection of old user- and art-objects that are typical of Rajasthani culture. The collector and owner Laxmi will show you around personally and explain what the items were (and in some cases are still) used for. Definitely worth a visit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r50247212-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "Gives great insight into the culture and life of the desert people", "review": "Displays old sea fossils found in the desert, camel and horse ornaments, old musical instruments, arms, old documents, coins and ancient manuscripts.   Of particular interest is the replica of a typical marwari business office of yesteryears and the 100kg. containers to transport ghee on camel backs.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r87729148-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Interesting", "review": "About Thar Heritage Museum in Jaisalmer – Rajasthan INDIA", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r37697254-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Worthwhile Visit - Thar Heritage Museum", "review": "Visit this museum if you're interested in connecting with genuine local culture, history, and folklore. The curator, Laxmi, started the museum himself and is fluent in English.  His passion for preserving and disseminating Rajasthani heritage extends to any visitor. He offers a personal tour of the museum's artifacts, and answers inquiries with animated and well-informed stories. The museum itself hosts objects from a variety of historical periods, representing a broad spectrum of Rajasthani worldviews. Most impressive is the collection of ancient manuscripts on ayurveda and jyotish (hindu astrology), and the reenactment of a customary opium party.  ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r22994963-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 4.0, "title": "A great alternative to rajasthan's forts", "review": "We really enjoyed visiting Mr Khatri's museum.  He is a wonderful guide with a wealth and genuine passion for local history. ", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r23625923-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Insight into life in the Thar", "review": "I liked this petite privately run museum. The charge is quite nominal and it was touching to see the lovingly preserved artifacts along with a guided tour. Vastly better than the dusty run-down government museums which litter the landscape.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r640489886-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Worth every bit of support !!", "review": "As a collector myself and someone feeling very passionate about the preservation of historical and and ancient folk art I would like to urge everyone to support Mr Laxmi Narayan Khatri by visiting his museum, THE THAR HERITAGE MUSEUM in Jaisalmer, Rajasthan.. His love for his heritage is so obvious as also the difficulty he is facing in trying to maintain his museum on his own. He has done a brilliant job but needs your support and appreciation. After all, it's not easy to open a museum !!!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r49720108-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Sweet, well set out museum", "review": "This is a small but lovingly assembled collection of artefacts from the local culture. The owner is an anthropologist who is very knowledgeable and helpful.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r644457046-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Definitely worth a visit", "review": "This is a very interesting museum, small but full of information and run by a lovely man and his very dedicated helper. They both show passion for the collection on display, that is contagious. The fact that you are being given a private tour is fantastic so you get to understand the use of some of the artefacts you may have seen before but never knew what they were. The private tour also allows for questions. Great experience, highly recommend. If the museum is closed, just send a text to the phone number written outside, they will answer and tell you when to come.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r646365454-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Private tour", "review": "This is a small and quiet museum out of the town centre. There’s a truly brilliant collection of local folk art and history. We were told this is the history of the common people rather than the Maharajahs. Knowledgable guide with good English skills and an obvious passion for his local culture. Don’t miss this while in Jaisalmer.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r646711308-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Good private museum", "review": "It's not a very big, grand, or royal museum, generally like others you see in Rajasthan, rather it's a simple private museum, very well maintained and showcasing the simple, local things of people from different sects of society, that's what I liked the most.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r654016427-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Very nice place", "review": "The museum is small but packed with interesting things about the local culture . Make sure to take the guided tour with laxmi. He has a lot of knowledge and speaks good english.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r653400478-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Small but interesting collection", "review": "A very interesting museum. It’s very small in size but rich in information. The owner/collector is very passionate and explained everything with enthusiasm. If you have some time on your hands in Jaisalmer it’s worthwile to visit to get to know more about the Thar culture. It’s only 100 rupees entrance fee.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r656907792-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Great Jaisalmer Museum", "review": "This Jaisalmer Meuseum is a real gem, providing an insight into the culture and social customs of the people who live in and around Jaisalmer - putting it all into perspective which can otherwise be lost. Highly recommended, especially with Laxmi the local historian bringing each exhibit to life.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661318973-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Fabulous!", "review": "This small but fabulous museum is a treasure trove of artefacts and information, and is perfect for putting the rest of Jaisalmer into context. What makes this museum most special, though, is the commentary provided by Laxmi, the museums extremely knowledgable owner and curator. Well worth a visit!", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661319968-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}, {"point_of_interest": "The Thar Heritage Museum", "rating": 5.0, "title": "Nice prep for camel safari", "review": "This museum is a gem... Mr. Laxmi will wall you around the space for 20-30 minutes explaining the collection of artifacts, pictures, and fossils from the Thar for 100 rupees.", "url": "https://www.tripadvisor.in/ShowUserReviews-g297667-d1210928-r661750541-The_Thar_Heritage_Museum-Jaisalmer_Jaisalmer_District_Rajasthan.html"}]